#Mon Oct 19 21:06:38 GMT-05:00 2015
JNCK049=Error JNI a %s\: s'ha detectat un \u00FAs repetit de va_list
JNCK048=Error JNI a %s\: el receptor no \u00E9s comprensible
JNCK047=Error JNI a %s\: l'argument clazz \u00E9s incorrecte
JNCK046=Error de JNI a %1$s\: el m\u00E8tode t\u00E9 un tipus de retorn incorrecte ('%2$c')
JNCK045=Error JNI a %s\: el m\u00E8tode no \u00E9s est\u00E0tic
JNCK044=Error JNI a %s\: el m\u00E8tode \u00E9s est\u00E0tic
JNCK043=Error de JNI a %1$s\: argument \#%2$d; no es pot trobar %3$s
JNCK042=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una subclasse de %3$s
JNCK041=Error de JNI a %1$s\: l'argument \#%2$d \u00E9s fora de l'interval d'un %3$s (0x%4$x > 0x%5$x)
SHRC189=N\u00FAm. m\u00E8todes AOT      \= %d
JNCK040=Error de JNI a %1$s\: l'argument \#%2$d \u00E9s fora de l'interval d'un %3$s (0x%4$x < 0x%5$x)
SHRC188=Bytes AOT          \= %d
SHRC187=Inhabilita l'emmagatzematge de dades AOT a la mem\u00F2ria cau est\u00E0ndard
SHRC186=\tPartici\u00F3 %.*s a ModContext %.*s
SHRC185=\tModContext %.*s
SHRC184=\tPartici\u00F3 %.*s
SHRC183=No es pot crear la taula de hash a ScopeManagerImpl.
SHRC182=No es pot crear el supervisor a ScopeManagerImpl.
SHRC181=No es pot entrar al mutex de taula de hash de ClasspathManager.
SHRC180=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ScopeManagerImpl.
JNCK039=Error JNI a %1$s\: l'argument \#%2$d \u00E9s NULL
JNCK038=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia d'objecte v\u00E0lida. El seu tipus \u00E9s\: %4$s\n
JNCK037=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia local. El seu tipus \u00E9s\: %4$s
JNCK036=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia global feble. El seu tipus \u00E9s\: %4$s
JNCK035=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia global. El seu tipus \u00E9s\: %4$s
JNCK034=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una %3$s
JNCK033=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una jarray
JNCK032=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una jobjectArray
JNCK031=Error JNI a %1$s\: l'argument \#%2$d \u00E9s NULL
SHRC179=El segment ROMClass s'ha malm\u00E8s. Error en llegir ROMClass a 0x%p.
JNCK030=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 mentre la recollida de deixalles est\u00E0 inhabilitada (probablement la crida s'ha fet des d'una incid\u00E8ncia de JVMPI o JVMTI)
SHRC178=S'ignorar\u00E0 l'opci\u00F3 noIncrementalUpdates a caus de l'\u00FAs de l'opci\u00F3 singleJVM.
SHRC177=No es pot treballar en mode segur a causa de l'opci\u00F3 singleJVM.
SHRC176=Reubicaci\u00F3 d'invariants de cadena habilitada
SHRC175=Fes que la mem\u00F2ria cau sigui persistent despr\u00E9s de les rearrencades (nom\u00E9s el Win)
SHRC174=Habilita les optimitzacions per a un sol \u00FAs de la JVM
SHRC173=Defineix el directori dels fitxers de control de la JVM (avan\u00E7at)
SHRC172=No es pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada a causa de restriccions del sistema operatiu.
SHRC171=El z/OS no pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada\: comproveu els par\u00E0metres BPXPRMxx del sistema z/OS.
SHRC170=Especifiqueu el nom de la mem\u00F2ria cau compartida.\n \t(Utilitzeu %%u per substituir el nom d'usuari).
JNCK029=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 dins d'una secci\u00F3 cr\u00EDtica.
JNCK028=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 quan hi ha una excepci\u00F3 pendent.
ZIPS001=No es pot obrir %s (falta l'exportaci\u00F3)
JNCK027=Error JNI a %s\: JNIEnv no \u00E9s el JNIEnv* per al fil actiu
ZIPS000=No es pot obrir %1$s (%2$s)
JNCK026=Error JNI a %s\: JNIEnv no sembla ser un fil v\u00E0lid, o la mem\u00F2ria s'ha malm\u00E8s, o b\u00E9 no \u00E9s una m\u00E0quina virtual J9
JNCK025=Feu servir -Xcheck\:jni\:nonfatal per seguir amb l'execuci\u00F3 si es detecten errors.
JNCK024=S'ha detectat un error JNI. Avortant.
JNCK023=S'ha detectat un error JNI. Continuant...
JNCK022=refer\u00E8ncia local alliberada
JNCK021=refer\u00E8ncia local en un altre fil
SHRC169=S'ha detectat un canvi a %2$.*1$s...\n \t...S'han marcat %3$d classes emmagatzemades a la mem\u00F2ria cau com a obsoletes.
JNCK020=refer\u00E8ncia del depurador
SHRC168=Bytes totals de classes compartides llegits\=%1$lld. Bytes totals emmagatzemats\=%2$d
SHRC167=Inhabilita l'\u00FAs compartit de les classes.
SHRC166=Connectat a la mem\u00F2ria cau "%1$s", mida\=%2$d bytes
SHRC165=[Sortida detallada d'API d'ajuda de -Xshareclasses habilitada]
SHRC164=[Sortida d'E/S detallada de -Xshareclasses habilitada]
SHRC163=[Sortida detallada de -Xshareclasses habilitada]
SHRC162=S'ha superat el temps d'espera per al mutex de creaci\u00F3 mentre s'obria la mem\u00F2ria compartida.
SHRC161=S'ha superat el temps d'espera per al mutex de creaci\u00F3 mentre es creava la mem\u00F2ria compartida.
SHRC160=S'ha superat el temps d'espera per al mutex de creaci\u00F3 mentre s'obria el sem\u00E0for.
JNCK019=refer\u00E8ncia global feble
JNCK018=refer\u00E8ncia global
JNCK017=refer\u00E8ncia local
JNCK016=NULL
JNCK015=\thelp           imprimeix aquesta pantalla
JNCK014=\tpedantic       realitza comprovacions m\u00E9s detallades, per\u00F2 m\u00E9s lentes
JNCK013=\tnovalist       no comprova la reutilitzaci\u00F3 de va_list
JNCK012=\tnoadvice       no visualitza suggeriments
JNCK011=\tnowarn         no visualitza advertiments
SHRC159=S'ha obert la mem\u00F2ria cau de classes compartides "%1$s".
JNCK010=\tnonfatal       no surt de l'aplicaci\u00F3 si es detecten errors
SHRC158=S'ha creat la mem\u00F2ria cau de classes compartides "%1$s".
SHRC157=No es poden assignar %1$d bytes de mem\u00F2ria compartida sol\u00B7licitada\n \tMem\u00F2ria compartida m\u00E0xima assignada correctament permesa (%2$d bytes) \n \t(Per augmentar la mem\u00F2ria compartida disponible, modifiqueu el valor SHMMAX del sistema)
SHRC156=Error en copiar el nom de grup al nom de mem\u00F2ria cau
SHRC155=Error en copiar el nom d'usuari al nom de mem\u00F2ria cau
SHRC154=El car\u00E0cter d'escapament %.*s no \u00E9s v\u00E0lid per a noms de mem\u00F2ria cau.
SHRC153=Especifiqueu el nom de la mem\u00F2ria cau compartida.\n \t(Utilitzeu %%g per substituir el nom de grup i %%u per al nom d'usuari).
SHRC152=Inicia sempre la JVM independentment dels errors/avisos
SHRC151=Suprimeix tots els missatges
SHRC150=Habilita la sortida detallada d'API d'ajuda
JNCK009=\tnobounds       no realitza comprovacions de l\u00EDmits a les cadenes i matrius
JNCK008=\ttrace          rastreja totes les funcions JNI
JNCK007=\tverbose        rastreja determinades funcions i activitats JNI
JNCK006=\tall            comprova les classes d'aplicaci\u00F3 i sistema
JNCK005=\u00DAs\: -Xcheck\:jni\:[opci\u00F3[,opci\u00F3[,...]]]
JNCK004=jnichk - Programa d'utilitat JNI per al J9, Versi\u00F3 %s
JNCK003=Programa d'utilitat de comprovaci\u00F3 JNI\: no es pot assignar l'emmagatzematge local de la VM
JNCK002=Programa d'utilitat de comprovaci\u00F3 JNI\: no es pot registrar cap esdeveniment
JNCK001=El programa d'utilitat de comprovaci\u00F3 JNI est\u00E0 instal\u00B7lat. Feu servir -Xcheck\:jni\:help pel seu \u00FAs
SHRC149=Habilita la sortida detallada de cerca/magatzem
JNCK000=-Xcheck\:jni\: no es reconeix l'opci\u00F3 --> '%s'
SHRC148=Permetre l'acc\u00E9s del grup a la mem\u00F2ria cau (a l'usuari \u00E9s per defecte)
SHRC147=El car\u00E0cter %.*s no \u00E9s v\u00E0lid pel nom de la mem\u00F2ria cau
SHRC146=S'est\u00E0 cercant la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb el testimoni %4$.*3$s...
SHRC145=S'est\u00E0 cercant la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb l'URL %4$.*3$s...
SHRC144=S'est\u00E0 emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb el testimoni %5$.*4$s...
SHRC143=S'est\u00E0 emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s...
SHRC142=\ta 0x%1$p\t\t%2$x \!\= %3$x
SHRC141=bytes no coincidents\:
SHRC140=mida\:\t%1$d\t\t\t%2$d\n
SHRC139=\n\tROMClass s'est\u00E0 emmagatzemant\tROMClass a la mem\u00F2ria cau
SHRC138=S'ha trobat m\u00E9s d'una ROMClass \u00F2rfena per a %.*s.
SHRC499=Placeholder, not used
SHRC137=MODALITAT SEGURA\: Av\u00EDs\: ROMClass %.*s no coincideix amb ROMClass a la mem\u00F2ria cau
SHRC498=Placeholder, not used
SHRC136=No es pot crear el supervisor a SH_ROMClassManagerImpl.
SHRC497=Placeholder, not used
SHRC135=No s'ha pogut crear una taula de hash a SH_ROMClassManagerImpl.
SHRC496=No s'han actualitzat dades adjuntes %1$s per a l'adre\u00E7a 0x%2$p, motiu\: %3$s
SHRC134=No s'ha pogut crear l'agrupaci\u00F3 a SH_ROMClassManagerImpl.
SHRC495=No s'han emmagatzemat dades adjuntes %1$s per a l'adre\u00E7a 0x%2$p, motiu\: %3$s
SHRC133=No es pot entrar al mutex de la taula d'aleatoritzaci\u00F3 ClasspathManager.
SHRC494=No s'han trobat dades adjuntes %1$s per a l'adre\u00E7a 0x%2$p, motiu\: %3$s
SHRC132=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ROMClassManagerImpl.
SHRC493=No s'han pogut trobar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC131=No es pot assignar mem\u00F2ria per a l'element de la llista enlla\u00E7ada a ROMClassManagerImpl.
SHRC492=No s'han pogut actualitzar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC130=S'ha intentat assignar mentre hi havia una confirmaci\u00F3 pendent.
SHRC491=No s'han pogut emmagatzemar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC490=For\u00E7a el descobriment d'una mem\u00F2ria cau de classes compartides malmesa
SHRC129=S'ha intentat definir readerCount en -1.
SHRC128=SH_CompositeCache\:\:exitMutex ha fallat amb el codi de retorn %d. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa.
SHRC489=Si la mem\u00F2ria cau oberta est\u00E0 marcada com a malmesa, activa una incid\u00E8ncia d'abocament de mem\u00F2ria cau
SHRC127=SH_CompositeCache\:\:enterMutex ha fallat amb el codi de retorn %d. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa.
SHRC488=El nombre total de valors -Xscminaot i -Xscminjitdata no pot ser superior a la mida de mem\u00F2ria cau disponible
SHRC126=S'ha fet una sol\u00B7licitud per afegir massa elements a ClasspathItem.
SHRC487=Espai m\u00E0xim per a bytes de dades JIT    %*c\= %d
SHRC125=No s'ha pogut assignar mem\u00F2ria per a la mem\u00F2ria interm\u00E8dia de cadenes a SH_CacheMap.
SHRC486=Espai reservat per a bytes de dades JIT   %*c\= %d
SHRC124=La mem\u00F2ria cau \u00E9s plena al %1$d%%.\n
SHRC485=Espai m\u00E0xim per a bytes AOT         %*c\= %d
SHRC123=%% de classes obsoletes    \= %1$d%%\n
SHRC484=Espai reservat per a bytes AOT        %*c\= %d
SHRC122=\# Classes desfasades  \= %d
SHRC483=no s'ha pogut actualitzar la mem\u00F2ria cau
SHRC121=\# Senyals         \= %d
SHRC482=l'adre\u00E7a no \u00E9s a la mem\u00F2ria cau
SHRC120=\# URL           \= %d
SHRC481=la mem\u00F2ria cau est\u00E0 malmesa
SHRC480=hi ha massa actualitzacions durant la lectura
EXEL099=\  -Xrealtime -Xnortsj           habilita el temps real lleu
EXEL098=\  -Xgcpolicy\:metronome          habilita el temps real lleu
EXEL097=\  -Xrealtime                    habilita el temps real lleu
EXEL096=\  -Xgcpolicy\:metronome          habilita les extensions en temps real
EXEL095=\  -Xrealtime                    habilita les extensions en temps real
EXEL094=\  -Xcompressedrefs              utilitza les refer\u00E8ncies d'emmagatzematge din\u00E0mic comprimides
EXEL093=Les opcions seg\u00FCents controlen la configuraci\u00F3 global de la VM\:
SHRC119=\# Classpaths     \= %d
EXEL092=\n  -Xdump[\:opci\u00F3,...]  controla els abocaments de mem\u00F2ria; utilitzeu -Xdump\:help per obtenir-ne m\u00E9s informaci\u00F3 detallada
SHRC118=\# ROMClasses     \= %d
EXEL091=\n  -Xcheck[\:opci\u00F3[\:...]]  controla la comprovaci\u00F3; utilitzeu -Xcheck\:help per obtenir-ne m\u00E9s informaci\u00F3 detallada
SHRC479=no s'han pogut assignar %d bytes de mem\u00F2ria
SHRC117=Metadades %% utilitzades \= %1$d%%\n
EXEL090=\  -Xscmaxaot<x>   defineix l'espai m\u00E0xim de mem\u00F2ria cau de classes compartides perm\u00E8s per a les dades AOT en <x>
SHRC478=la mida de dades %d \u00E9s superior a la mida %d disponible
SHRC116=Bytes de metadades   \= %d
SHRC477=no hi ha espai a la mem\u00F2ria cau per a %d bytes
SHRC115=Bytes de ROMClass   \= %d
SHRC476=les dades ja existeixen
SHRC114=bytes lliures       \= %d
SHRC475=no hi ha dades
SHRC113=mida de mem\u00F2ria cau       \= %d
SHRC474=error d'enterReadMutex
SHRC112=Punter d'assignaci\u00F3 \= 0x%p\n
SHRC473=error d'enterWriteMutex
SHRC111=Adre\u00E7a final        \= 0x%p
SHRC472=no hi ha acc\u00E9s al recurs
SHRC110=\nAdre\u00E7a base       \= 0x%p
SHRC471=No s'han pogut actualitzar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC470=S'han actualitzat %1$s dades adjuntes per a %7$.*6$s%3$.*2$s%5$.*4$s
EXEL089=\  -Xscminaot<x>   defineix l'espai m\u00EDnim de mem\u00F2ria cau de classes compartides reservat per a les dades AOT en <x>
MECK002=S'ha produ\u00EFt un error en crear l'estructura de dades de lloc de crida. La informaci\u00F3 de lloc de crida no es mostrar\u00E0.
EXEL088=
MECK001=Opci\u00F3 -Xcheck\:memory no reconeguda\: %s
EXEL087=\  -Xjni\:<opcions>               defineix les opcions de JNI
MECK000=S'ha produ\u00EFt un error en inicialitzar la utilitat -Xcheck\:memory
EXEL086=\n  -Xtrace[\:opci\u00F3,...]  controla la tra\u00E7a; utilitzeu -Xtrace\:help per obtenir-ne m\u00E9s informaci\u00F3 detallada
EXEL085=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nADVERTIMENT\: Utilitzeu "-jxe <path>" com a alternativa.\n
EXEL084=No es pot fer una c\u00F2pia de seguretat del fitxer\: %s
EXEL083=No s'ha pogut obrir el fitxer\: %s
SHRC109=DESFASAT\!
EXEL082=\  -Xlp<x>         defineix la mida de p\u00E0gina gran en <x>
SHRC108=\t%.*s
EXEL081=Versi\u00F3 de Java "%1$s/%2$s"
SHRC469=No s'han emmagatzemat dades adjuntes 1$s per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\:%2$s
SHRC107=\t%.*s
EXEL080=Versi\u00F3 de Java "%s"
SHRC468=S'han emmagatzemat %1$s dades adjuntes per a %7$.*6$s%3$.*2$s%5$.*4$s
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC467=No s'ha pogut trobar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s.%6$.*5$s, motiu\:%2$s
SHRC105=%1$d\: 0x%2$p URL
SHRC466=S'han trobat %1$s dades adjuntes per a %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC465=[Sortida detallada de dades JIT de -Xshareclasses habilitada]
SHRC103=\tTestimoni 0x%p
SHRC464=Habilita la sortida detallada de dades de JIT
SHRC102=\tURL 0x%p
SHRC463=El valor de -Xscmaxjitdata \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en il\u00B7limitat.
SHRC101=\t\u00CDndex %1$d a la variable classpath 0x%2$p
SHRC462=El valor de -Xscminjitdata \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en el mateix valor que -Xscmx.
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s at 0x%5$p.
SHRC461=El valor de -Xscminjitdata no ha de ser superior al valor de -Xscmaxjitdata.
SHRC460=Inhabilita l'emmagatzematge de dades JIT a la mem\u00F2ria cau compartida
EXEL079=\  -Xscmx<x>       estableix la mida de la nova mem\u00F2ria cau de les classes compartides en <x>
EXEL078=\  -Xshareclasses[\:opcions] permet compartir dades de classe (utilitzar l'ajuda per veure detalls)\n
EXEL077=\  -Xssi<x>        estableix l'increment de pila de fils java en <x>
EXEL076=JIT  - %s\n
EXEL075=\  -Xquickstart    millora el temps d'engegada gr\u00E0cies a les optimitzacions de retards
EXEL074=No es pot redirigir la consola a\: %1$s\:%2$d
EXEL073=Error intern de VM\: no s'ha pogut crear la VM de Java
EXEL072=Error d'engegada de VM\: sense mem\u00F2ria
EXEL071=No s'ha pogut trobar el nom de classe principal
SHRC459=Inhabilita la capacitat de compartir classes i les API d'utilitat
EXEL070=La imatge ROM \u00E9s una d'una versi\u00F3 err\u00F2nia
SHRC458=Inhabilita la capacitat de compartir classes sense inhabilitar les API d'utilitat
SHRC457=Nom de mem\u00F2ria cau no v\u00E0lid, el nom de la mem\u00F2ria cau "%.*s" cont\u00E9 nom\u00E9s espais en blanc o \u00E9s buit
SHRC456=For\u00E7a el descobriment d'un canvi a l'ID de muntatge de la VM
SHRC455=For\u00E7a la comprovaci\u00F3 de la taula de s\u00E8ries en el proc\u00E9s d'inici
SHRC454=Inhabilita la comprovaci\u00F3 si l'ID de sem\u00E0for SysV actual \u00E9s igual a l'ID de sem\u00E0for SysV de la mem\u00F2ria cau
SHRC453=Llista tots els elements de la mem\u00F2ria cau, incloent-hi les classes \u00F2rfenes
SHRC452=Inhabilita la protecci\u00F3 de mem\u00F2ria de l'\u00E0rea de lectura/escriptura (taula de s\u00E8ries)
SHRC451=El camp d'inici de dades de la cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Adre\u00E7a inicial de dades a la cap\u00E7alera de mem\u00F2ria cau\: 0x%p.
SHRC450=El camp de longitud de dades de la cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Longitud de dades de la cap\u00E7alera de mem\u00F2ria cau\: %u.
EXEL069=No s'ha pogut trobar la imatge ROM
EXEL068=Error intern de VM\: no s'ha pogut establir l'element de la matriu per %s
EXEL067=Error intern de VM\: no s'ha pogut crear java/lang/String per a l'argument %s
EXEL066=Error intern de VM\: no s'ha pogut crear la matriu de bytes per a l'argument %s
EXEL065=Error intern de VM\: no s'ha pogut crear la matriu d'arguments
EXEL064=El m\u00E8tode main s'ha de declarar p\u00FAblic, est\u00E0tic i nul.
EXEL063=La classe %s no implementa main()
EXEL062=Error intern de VM\: s'ha exhaurit la mem\u00F2ria en convertir la cadena a car\u00E0cters UTF per al nom de classe %s
EXEL061=Error intern de VM\: no s'ha pogut crear java/lang/String per al nom de classe %s
SHRC449=El valor de farciment \u00E9s diferent de zero. Bytes de farciment a la cap\u00E7alera de mem\u00F2ria cau\: %u.
EXEL060=Error intern de VM\: no s'ha pogut crear la matriu de bytes per al nom de classe %s
SHRC448=El camp de mida de mem\u00F2ria cau de la cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Mida de la mem\u00F2ria cau a la cap\u00E7alera de la mem\u00F2ria cau\: 0x%x.
SHRC447=El reclam de cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Adre\u00E7a de la s\u00E8rie de reclam de la cap\u00E7alera de mem\u00F2ria cau\: 0x%p.
SHRC446=No s'ha pogut adquirir el bloqueig d'escriptura de cap\u00E7alera durant l'inici de la mem\u00F2ria cau amb el codi d'error\: %d.
SHRC445=La mida de la mem\u00F2ria cau \u00E9s massa petita perqu\u00E8 sigui \u00FAtil. Mida de mem\u00F2ria cau no v\u00E0lida\: 0x%x.
SHRC444=Dades corruptes de lectura per a la cap\u00E7alera d'entrada de mem\u00F2ria cau 0x%p (longitud d'element no v\u00E0lida)
SHRC443=El CRC de mem\u00F2ria cau indica de manera incorrecta una mem\u00F2ria cau corrupta. CRC de mem\u00F2ria cau incorrecte\: 0x%x.
SHRC442=La mem\u00F2ria cau compartida "%s" est\u00E0 malmesa. El codi de corrupci\u00F3 \u00E9s %d. El valor malm\u00E8s \u00E9s 0x%p. No es permetr\u00E0 a cap JVM nova connectar-se amb la mem\u00F2ria cau.\n \tLes JVM existents poden continuar funcionant, per\u00F2 no poden actualitzar la mem\u00F2ria cau.
SHRC441=El valor de -XscmaxJIT \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en il\u00B7limitat.
SHRC440=El valor de -XscminJIT \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en el mateix valor que -Xscmx.
EXEL059=Error intern de VM\: no s'ha pogut trobar la classe java/lang/String
EXEL058=Error intern de VM\: sense mem\u00F2ria
EXEL057=
EXEL056=IBM \u00E9s una marca registrada d'IBM Corp.\nJava i totes les marques i logotips basats en Java s\u00F3n marques registrades\n o comercials de Sun Microsystems, Inc.\n
EXEL055=Destinaci\u00F3\: %s
EXEL054=(c) Copyright IBM Corp. 1991, %s  Reservats tots els drets
EXEL053=Materials sota llic\u00E8ncia - Propietat d'IBM\n\nJ9 - VM per a la plataforma Java(TM), Versi\u00F3 %s
EXEL052=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: Utilitzeu l'equivalent de -X.
EXEL051=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: \u00DAs de "-classpath <via>" o "-cp <via>".
SHRC439=El valor -XscminJIT no pot ser m\u00E9s gran que el valor -XscmaxJIT
EXEL050=\  -Xrdbginfo\:<sist_prin>\:<port> habilita el servidor d'informaci\u00F3 de depuraci\u00F3 remot
SHRC438=Inhabilita l'emmagatzematge de dades JIT a la mem\u00F2ria cau compartida
SHRC437=Error en alliber\u00E0 el bloqueig de lectura de cap\u00E7aleres de fitxers de mem\u00F2ria cau de classes compartides
SHRC436=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC435=-Xitsn%2$u utilitza %1$u bytes de mem\u00F2ria, que \u00E9s un valor superior a la mida de la mem\u00F2ria cau de classes compartides %3$u bytes
SHRC434=El valor\=%d passat per l'opci\u00F3 -Xitsn \u00E9s fora de l'interval de valors de nombre principal adm\u00E8s per la VM. Interval adm\u00E8s \= 0 - %u
SHRC433=\tper a ROMClass %2$.*1$s a 0x%3$p.
SHRC432=\ Signatura\: %2$.*1$s Adre\u00E7a\: 0x%3$p
J9CL040=No es pot assignar mem\u00F2ria per a la refer\u00E8ncia global de JNI nova.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC430=No s'ha pogut eliminar la generaci\u00F3 actual de la mem\u00F2ria cau de classes compartides "%s"
EXEL049=\  -Xdbginfo\:<via fitxer s\u00EDmbol> habilita la depuraci\u00F3 del servidor d'informaci\u00F3
EXEL048=\  -Xrunjdwp\:<options>           habilita la depuraci\u00F3, les opcions est\u00E0ndard de JDWP
EXEL047=\n  -Xdbg\:<options>               habilita la depuraci\u00F3, les opcions est\u00E0ndard de JDWP
EXEL046=\  -Xlp                          habilita el suport de p\u00E0gines grans
EXEL045=\  -Xnocompactgc                 inhabilita la compactaci\u00F3
EXEL044=\  -Xcompactgc                   habilita la compactaci\u00F3
EXEL043=\  -Xcompactexplicitgc           habilita la compactaci\u00F3 a tots els sistemes GC
J9CL039=La marca hor\u00E0ria no \u00E9s v\u00E0lida quan es recupera la informaci\u00F3 d'\u00FAs de CPU de la JVM.
EXEL042=\  -Xnocompactexplicitgc         inhabilita la compactaci\u00F3 a un sistema GC
J9CL038=Error en recuperar la informaci\u00F3 d'\u00FAs de CPU de la JVM.
EXEL041=\  -Xalwaysclassgc               habilita la desc\u00E0rrega de classes din\u00E0miques a cada GC
SHRC429=No s'ha pogut eliminar la generaci\u00F3 antiga de la mem\u00F2ria cau de classes compartides "%s"
J9CL037=No es pot recuperar la informaci\u00F3 d'\u00FAs de CPU de la JVM quan s'ha especificat -XX\:-EnableCPUMonitor.
EXEL040=\  -Xclassgc                     habilita la desc\u00E0rrega de classes din\u00E0miques
SHRC428=S'ha eliminat la generaci\u00F3 antiga de la mem\u00F2ria cau de classes compartides "%s"
J9CL036=Carregant violaci\u00F3 de restricci\u00F3\: %2$.*1$s no \u00E9s visible des de %4$.*3$s
SHRC427=Modificador utilitzat per imprimir estad\u00EDstiques de mem\u00F2ria cau detallades
J9CL035=m\u00E8todes d'interf\u00EDcie privada necessiten invokespecial
SHRC426=Nombre d'entrades JCL                       %*c\= %d
J9CL034=%1$d\: Error en recuperar la informaci\u00F3 de %2$s. %3$s
SHRC425=Nombre d'objectes Java                      %*c\= %d
J9CL033=No s'ha pogut registrar %s com a biblioteca bootstrap. Codi d'error \= %zu
SHRC424=Nombre de perfils JIT                      %*c\= %d
J9CL032=%1$d\: No s'ha pogut recuperar la informaci\u00F3 %2$s.
SHRC423=Nombre de hints JIT                         %*c\= %d
J9CL031=No s'ha pogut registrar dbgwrapper.dll com a biblioteca bootstrap. Codi d'error \= %zu
SHRC422=Nombre de thunks AOT                        %*c\= %d
J9CL030=No es pot assignar mem\u00F2ria per a dades natives d'inquil\u00ED
SHRC421=Nombre de jerarquia de classe AOT               %*c\= %d
SHRC420=Nombre d'entrades de dades AOT                  %*c\= %d
EXEL039=\  -Xnoclassgc                   inhabilita la desc\u00E0rrega de classes din\u00E0miques
EXEL038=\  -Xgcthreads<x>                estableix un nombre de fils GC
EXEL037=\nEls arguments per a les opcions seg\u00FCents s'expressen com a nombres decimals.\n
EXEL036=\  -Xmaxf<x>       percentatge m\u00E0xim de l'\u00E0rea d'emmagatzematge lliura despr\u00E9s de GC
EXEL035=\  -Xminf<x>       percentatge m\u00EDnim de l'\u00E0rea d'emmagatzematge lliura despr\u00E9s de GC
EXEL034=Un valor de 0,3 representa una sol\u00B7licitud del 30%%.\n
EXEL033=\nEls arguments de les seg\u00FCents opcions s'expressen com a decimals del 0 a l'1.
J9CL029=S'han trobat car\u00E0cters de format incorrecte/que no es poden assignar
EXEL032=\  -Xmaxe<x>       estableix la mida m\u00E0xima per a l'expansi\u00F3 de l'\u00E0rea d'emmagatzematge a <x>
J9CL028=Error intern en llegir el fitxer zip, codi d'error %d
EXEL031=\  -Xmine<x>       estableix la mida m\u00EDnima per a l'expansi\u00F3 de l'\u00E0rea d'emmagatzematge a <x>
SHRC419=Bytes de classe LocalVariableTable      %*c\= %u
J9CL027=Error de lectura del fitxer zip
EXEL030=\  -Xss<x>         estableix la mida de la pila de fils en <x>
SHRC418=Bytes de dades de byte                     %*c\= %d
J9CL026=No es pot assignar mem\u00F2ria per al contingut de publicaci\u00F3 HTTP
SHRC417=Bytes de dades JCL                      %*c\= %d
J9CL025=No es pot assignar la mem\u00F2ria per a les cap\u00E7aleres de resposta HTTP
SHRC416=Bytes de ReadWrite                     %*c\= %d
J9CL024=Sense mem\u00F2ria
SHRC415=Bytes d'objecte Java                   %*c\= %d
J9CL023=No hi ha prou mem\u00F2ria disponible per llegir el registre
SHRC414=Bytes de perfil JIT                    %*c\= %d
J9CL022=No hi ha prou mem\u00F2ria per llistar els magatzems de registres
SHRC413=Bytes de hint JIT                      %*c\= %d
J9CL021=No hi ha prou mem\u00F2ria per crear la llista d'\u00EDndex
SHRC412=Bytes de thunk AOT                     %*c\= %d
J9CL020=No ha hi prou mem\u00F2ria per llegir les dades d'entorn local
SHRC411=Bytes de jerarquia de classes AOT         %*c\= %d
SHRC410=Bytes de dades AOT                      %*c\= %d
EXEL029=\  -Xss<x>         estableix la mida m\u00E0xima de la pila de fils java en <x>
EXEL028=\  -Xiss<x>        estableix la mida de la pila de fils java inicials en <x>
EXEL027=\  -Xmso<x>        estableix la mida de la pila de fils del sistema operatiu en <x>
EXEL026=\  -Xmrx<x>        estableix la mida m\u00E0xima del conjunt recordat en <x>
EXEL025=\  -Xmr<x>         estableix la mida del conjunt recordat en <x>
EXEL024=\  -Xmx<x>         estableix el m\u00E0xim de mem\u00F2ria en <x>
EXEL023=\  -Xms<x>         estableix la mida de la mem\u00F2ria inicial en <x>
J9CL019=No es pot assignar la mem\u00F2ria interm\u00E8dia SIOCGIFCONF
EXEL022=\  -Xms<x>         estableix la mida de l'antic espai en <x>
J9CL018=No es pot assignar per a una entrada de fus horari
EXEL021=\  -Xmoi<x>        estableix l'increment de l'antic espai en <x>
SHRC409=Bytes de codi AOT                      %*c\= %d
J9CL017=No es pot assignar per a un recurs de fus horari
EXEL020=\  -Xmox<x>        estableix la mida de l'antic espai m\u00E0xim en <x>
SHRC408=Generaci\u00F3 de mem\u00F2ria cau                    %*.c\= %d\n
J9CL016=No es pot crear una entrada de variable classpath nova
SHRC407=Identificadors de temps d'execuci\u00F3                       %*.c\= 0x%.16llX
J9CL015=No s'ha pogut crear la tra\u00E7a de pila (el m\u00E9s probable \u00E9s que es degui a una manca de mem\u00F2ria de SO)
SHRC406=Adre\u00E7a d'inici de metadades              %*c\= 0x%p
J9CL014=Argument de l\u00EDnia d'ordres JCL no v\u00E0lid
SHRC405=No s'ha pogut crear el directori per a la mem\u00F2ria cau
J9CL013=No s'ha pogut assignar el supervisor del sistema operatiu
SHRC404=No s'ha pogut obtenir el directori per a la mem\u00F2ria cau
J9CL012=
SHRC403=Bytes utilitzats d'\u00E0rea de depuraci\u00F3 de classes         %*c\= %u
J9CL011=No s'ha pogut fer un proc\u00E9s fork al fil del sistema operatiu
SHRC402=Bytes de dades JIT                      %*c\= %d
J9CL010=No s'ha pogut assignar JNIEnv
SHRC401=Nombre de mem\u00F2ries cau de Zip                        %*c\= %d
SHRC400=Bytes de mem\u00F2ria cau de zip                    %*c\= %d
EXEL019=\  -Xmos<x>        estableix la mida de l'antic espai inicial en <x>
EXEL018=\  -Xmo<x>         estableix la mida de l'antic espai inicial/m\u00E0xim en <x>
EXEL017=\  -Xmo<x>         estableix la mida de l'antic espai en <x>
EXEL016=\  -Xmnx<x>        estableix la mida del nou espai m\u00E0xim en <x>
EXEL015=\  -Xmns<x>        estableix la mida del nou espai inicial en <x>
EXEL014=\  -Xmn<x>         estableix la mida del nou espai inicial/m\u00E0xim en <x>
EXEL013=\  -Xmn<x>         estableix la mida del nou espai en <x>
J9CL009=El fil ja s'ha iniciat
EXEL012=\  -Xmco<x>        estableix l'increment del segment de la classe ROM en <x>
J9CL008=el valor de temps d'espera en nanosegons est\u00E0 fora de l'interval
EXEL011=\  -Xmca<x>        estableix l'increment del segment de la classe RAM en <x>
J9CL007=el valor de temps d'espera \u00E9s negatiu
EXEL010=Els valors amb els sufixos "k" (kilo) o "m" (mega) es multiplicaran en conseq\u00FC\u00E8ncia.\n
J9CL006=No hi ha dades de verificaci\u00F3 pr\u00E8via per java/lang/Object
J9CL005=Versi\u00F3 de la biblioteca de classes incompatible\: s'exigeix VM v%1$i, s'ha trobat v%2$i
J9CL004=Versi\u00F3 de la biblioteca de classes incompatible\: s'esperava JCL v%1$i, s'ha trobat v%2$i
J9CL003=Versi\u00F3 de biblioteca de classes incompatible\: JCL %1$x, VM %2$x
J9CL002=Les classes s\u00F3n de la biblioteca no J9 o JXE s'ha redu\u00EFt de forma incorrecta
SHRC755=\t invalidatedaot Nom\u00E9s imprimeix tipus AOT invalidats a la mem\u00F2ria cau compartida.
J9CL001=Proveu d'executar amb -jcl\:%s
SHRC754=La recreaci\u00F3 del fitxer de control de la mem\u00F2ria compartida no est\u00E0 permesa.
J9CL000=Biblioteca de classes incompatible
SHRC753=No s'ha pogut obtenir el mutex d'escriptura de la mem\u00F2ria cau.
SHRC752=No s'han pogut analitzar les especificacions de m\u00E8tode.
SHRC751=No s'han pogut analitzar les especificacions de m\u00E8tode. No es permeten m\u00E9s de %d especificacions de m\u00E8tode.
SHRC750=Cap m\u00E8tode AOT coincideix amb les especificacions de m\u00E8tode.
EXEL009=\nEls arguments de les seg\u00FCents opcions s'expressen en bytes.
EXEL008=\  -Xfuture        habilita les comprovacions m\u00E9s estrictes, que anticipen futurs valors per defecte
EXEL007=\  -Xnoaot         no executa el codi compilat pr\u00E8viament
EXEL006=\  -Xnojit         inhabilita JIT
EXEL005=\  -Xint           executa nom\u00E9s all\u00F2 interpretat (equivalent a -Xnojit -Xnoaot)
EXEL004=\n  -Xrun<biblioteca>[\:opcions]  carrega la biblioteca d'agent nativa\n                            (s'ha deixat d'utilitzar en benefici de -agentlib)\n
EXEL003=\  -Xbootclasspath/a\:<via>  afegir <via> a la classpath d'enceb
EXEL002=\  -Xbootclasspath/p\:<via>  deduir <via> per la classpath d'enceb
EXEL001=\  -Xbootclasspath\:<via>    estableix la classpath d'enceb en <via>
EXEL000=Les seg\u00FCents opcions s\u00F3n no est\u00E0ndard i estan subjectes a canvis sense avisos previs.\n
SHRC749=No s'han trobat els m\u00E8todes AOT.
SHRC748=No s'han pogut revalidar els m\u00E8todes AOT.
SHRC747=No s'han pogut invalidar els m\u00E8todes AOT.
SHRC746=S'han trobat els %d m\u00E8todes AOT anteriors.
SHRC745=S'han revalidat els %d m\u00E8todes AOT anteriors.
SHRC744=S'han invalidat els %d m\u00E8todes AOT anteriors.
SHRC743=Especificacions de m\u00E8tode no v\u00E0lides per a l'opci\u00F3 "%s".
SHRC742=IMPORTANT\: Podeu passar diverses especificacions de m\u00E8tode separades amb comes. Si un valor d'opci\u00F3 cont\u00E9 comes, ha d'estar entre claus. \n\t\u00C9s possible que hagueu de posar opcions entre cometes per evitar que el shell intercepti i fragmenti l\u00EDnies separades amb comes com, per exemple\:\n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" or\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC741=El format d'<especificaci\u00F3_m\u00E8tode> \u00E9s [\!]{*|[*]<nom_paquet/nom_classe>[*]}[.{*|[*]<nom_m\u00E8tode>[*]}][({*|[*]<par\u00E0metres>[*]})], per exemple\:\n \n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC740=\u00DAs\: %s{<especificaci\u00F3_m\u00E8tode>[,<m\u00E8tode_especificaci\u00F3>]}
SHRC739=INVALIDAT
SHRC738=Imprimiu els m\u00E8todes AOT que coincideixin amb les especificacions de m\u00E8todes.\n\t<especificaci\u00F3_m\u00E8tode> es defineix coma\: [\!]{*|[*]<nom_paquet/nom_classe>[*]}[.{*|[*]<nom_m\u00E8tode>[*]}][({*|[*]<par\u00E0metres>[*]})].
SHRC737=Revalideu els m\u00E8todes AOT que coincideixin amb les especificacions de m\u00E8todes.
SHRC736=Invalideu els m\u00E8todes AOT que coincideixin amb les especificacions de m\u00E8todes.
SHRC735=Utilitzeu una JVM de %d bits per dur a terme l'operaci\u00F3 sol\u00B7licitada a la mem\u00F2ria compartida de %d bits "%s", ja que la JVM de %d bits no pot verificar que la mem\u00F2ria compartida hagi estat creada per la JVM.
SHRC734=Imprimiu el nom del fitxer d'instant\u00E0nia de classes compartides que s'utilitzar\u00E0.
SHRC733=La JVM no pot emmagatzemar classpaths a la mem\u00F2ria cau compartida, ja que la mem\u00F2ria cau es va crear amb l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'.
SHRC732=La JVM pot emmagatzemar classpaths a la mem\u00F2ria cau compartida creada amb l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'.
SHRC731=La JVM ha ignorat l'opci\u00F3 '-Xshareclasses\:restrictClasspaths' perqu\u00E8 la mem\u00F2ria cau compartida es va crear sense l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'.
SHRC730=La JVM ha creat una mem\u00F2ria cau compartida amb l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'. Les invocacions de JVM futures no podran emmagatzemar classpaths a la mem\u00F2ria cau compartida.
SHRC729=La instant\u00E0nia es va crear amb un muntatge de JVM diferent i no coincideix amb la JVM que s'est\u00E0 executant.
SHRC728=No s'ha pogut llegir el fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s".
SHRC727=S'ha produ\u00EFt un error en crear la nova mem\u00F2ria cau compartida no persistent.
SHRC726=La mem\u00F2ria cau compartida no persistent "%s" ja existeix. No es pot restaurar des de la instant\u00E0nia.
SHRC725=La longitud del fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s" no \u00E9s v\u00E0lida. La longitud del fitxer \u00E9s de %lld bytes. Un fitxer d'instant\u00E0nia v\u00E0lid ha de tenir com a m\u00EDnim %d bytes i com a m\u00E0xim %lld bytes.
SHRC724=El fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida "%s" no existeix.
SHRC723=La JVM no ha pogut comprovar els permisos del fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida "%s".
SHRC722=La JVM no permet l'acc\u00E9s al fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida "%s" perqu\u00E8 l'ID d'usuari i l'ID de grup del proc\u00E9s de la JVM s\u00F3n diferents de l'ID d'usuari i l'ID de grup del propietari del fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida i l'ID d'usuari del proc\u00E9s de la JVM no pertany al grup del propietari del fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida.
SHRC721=La JVM no est\u00E0 configurada per accedir al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s". Per obtenir el fitxer, utilitzeu la subopci\u00F3 'groupAccess'.
SHRC720=No es permet la recreaci\u00F3 del fitxer de control de la mem\u00F2ria compartida en crear una instant\u00E0nia de la mem\u00F2ria cau.
SHRC719=S'ha destru\u00EFt la mem\u00F2ria cau compartida "%s".
SHRC718=La instant\u00E0nia de la mem\u00F2ria cau compartida no existeix.
SHRC717=No s'ha pogut eliminar la generaci\u00F3 actual de la instant\u00E0nia de la mem\u00F2ria cau compartida "%s".
SHRC716=No s'ha pogut eliminar la generaci\u00F3 m\u00E9s antiga de la instant\u00E0nia de mem\u00F2ria cau compartida "%s".
SHRC715=S'ha eliminat la generaci\u00F3 m\u00E9s antiga de la instant\u00E0nia de mem\u00F2ria cau compartida "%s".
SHRC714=No hi ha cap instant\u00E0nia de mem\u00F2ria cau compartida disponible.
SHRC713=No s'ha pogut obtenir la longitud del fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida "%s".
SHRC712=Intentant destruir totes les instant\u00E0nies de mem\u00F2ria cau compartida al cacheDir "%s"
SHRC711=No s'ha pogut reposicionar el despla\u00E7ament del descriptor del fitxer al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s".
SHRC710=No s'ha pogut escriure al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s".
SHRC709=La JVM est\u00E0 creant una instant\u00E0nia de la mem\u00F2ria cau compartida no persistent "%s", per\u00F2 ja existeix un fitxer d'instant\u00E0nia "%s" i se sobreescriur\u00E0.
SHRC708=No s'ha pogut truncar el fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s" existent.
SHRC707=No s'ha pogut adquirir el mutex de la mem\u00F2ria cau "%s".
SHRC706=No s'ha pogut adquirir el bloqueig de fitxer al fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida.
SHRC705=Missatge d'error de plataforma\: %1$s
SHRC704=Codi d'error de capa de port \= %1$d
SHRC703=No s'ha pogut obrir el fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida "%s".
SHRC702=No s'ha pogut obtenir el directori per a la instant\u00E0nia de la mem\u00F2ria cau compartida.
SHRC701=No s'ha pogut crear una instant\u00E0nia de la mem\u00F2ria cau compartida no persistent "%s".
SHRC700=S'ha creat la instant\u00E0nia de la mem\u00F2ria cau compartida no persistent "%s".
PCKD091=L'anotaci\u00F3 @Unpacked al camp %2$.*1$s a la classe %4$.*3$s no \u00E9s v\u00E0lida\: el camp @Unpacked no es pot declarar est\u00E0tic
PCKD090=Anotacions al camp %2$.*1$s a classe %4$.*3$s s\u00F3n no v\u00E0lides\: l'anotaci\u00F3 @Length i l'anotaci\u00F3 @Unpacked no es poden utilitzar conjuntament
PCKD089=Anotaci\u00F3 @Unpacked al camp %2$.*1$s a classe %4$.*3$s no \u00E9s v\u00E0lida\: la classe de declaraci\u00F3 no \u00E9s @Packed
PCKD088=Anotaci\u00F3 @Unpacked al camp %2$.*1$s a classe %4$.*3$s no \u00E9s v\u00E0lid\: El tipus de camp @Unpacked ha de ser classe @Packed
PCKD087=El suport d'objecte empaquetat \u00E9s una millora nova d'IBM per Java que es proporciona com a \nvisualitzaci\u00F3 pr\u00E8via de tecnologia. El contingut est\u00E0 disponible subjecte a una ren\u00FAncia de responsabilitat.\n\nRen\u00FAncia de responsabilitat\nLes interf\u00EDcies de programaci\u00F3 d'aplicaci\u00F3 i codi que trobareu aqu\u00ED s\u00F3n informaci\u00F3 de visualitzaci\u00F3 pr\u00E8via\nde tecnologies que IBM no pot posar a disposici\u00F3 general com a producte o en un producte.\nL'usuari t\u00E9 perm\u00EDs per utilitzar la informaci\u00F3 nom\u00E9s per dur a terme\ntasques d'avaluaci\u00F3 i no per utilitzar-la en un entorn de producci\u00F3. IBM proporciona\naquesta informaci\u00F3 sense obligaci\u00F3 de suport, "tal qual" i sense garantia de cap\nclasse.\n\nQualsevol informaci\u00F3 relacionada amb possibles productes posteriors \u00E9s nom\u00E9s per indicar la intenci\u00F3\ngeneral de productes de l'empresa i no s'ha d'utilitzar a l'hora de prendre de decisions de compra.\nLa informaci\u00F3 que es menciona relacionada amb possibles productes posteriors no \u00E9s cap\ncomprom\u00EDs, promesa ni obligaci\u00F3 legal de lliurar cap mena de material, codi o\nfuncionalitat. La informaci\u00F3 sobre possibles productes posteriors pot ser que no s'incorpori\nen cap contracte. El desenvolupament, la publicaci\u00F3 i temporalitat de properes caracter\u00EDstiques\no funcionalitats descrites pels nostres productes \u00E9s \u00FAnica i exclusivament a discreci\u00F3 nostra.\n
PCKD086=La classe de matriu @Packed "%.*s" no pot tenir cap classe de membre de la matriu @Packed.
PCKD085=S'ha trobat una implementaci\u00F3 de m\u00E8tode inesperada a la classe de matriu @Packed "%.*s"
PCKD084=La classe de matriu @Packed "%.*s" no pot tenir cap camp.
PCKD083=La classe de matriu @Packed "%.*s" ha d'implementar java/io/Serializable.
PCKD082=La classe de matriu @Packed "%.*s" ha d'implementar java/lang/Cloneable.
PCKD081=A la classe de matriu @Packed "%.*s" li falta el m\u00E8tode clone().
PCKD080=A la classe de matriu @Packed "%.*s" li falta el m\u00E8tode getLength().
IREL001=
PCKD079=A la classe de matriu @Packed "%.*s" li falta el m\u00E8tode at().
IREL000=El codi AOT de %1$s.jar generat per la versi\u00F3 %2$s de la JVM no \u00E9s compatible amb la versi\u00F3 actual %3$s de la JVM.
PCKD078=A la classe de matriu @Packed "%.*s" li falta el m\u00E8tode allocate().
PCKD077=A la classe de matriu @Packed "%.*s" li falta un constructor privat.
PCKD076=Signatura incorrecta pel m\u00E8tode clone() de la classe de matriu @Packed "%.*s".
PCKD075=Signatura incorrecta pel m\u00E8tode getLength() de la classe de matriu @Packed "%.*s".
PCKD074=Signatura incorrecta pel m\u00E8tode at() de la classe de matriu @Packed "%.*s".
PCKD073=Signatura incorrecta pel m\u00E8tode allocate() de la classe de matriu @Packed "%.*s".
PCKD072=La classe de matriu @Packed "%.*s" no pot tenir m\u00E9s d'un constructor.
PCKD071=El constructor de la classe de matriu @Packed "%.*s" no ha de requerir cap argument.
PCKD070=El constructor de la classe de matriu @Packed "%.*s" ha de ser privada.
PCKD069=La classe de matriu @Packed "%.*s" ha d'ampliar PackedObject directament.
PCKD068=La classe de matriu @Packed "%.*s" ha de ser p\u00FAblica.
PCKD067=La classe de matriu @Packed "%.*s" ha de ser final.
PCKD066=La longitud de la matriu sol\u00B7licitada %1$lld (0x%2$llx) \u00E9s massa llarga.
PCKD065=La longitud de la matriu sol\u00B7licitada \u00E9s massa llarga.
PCKD064=No es pot aconseguir la capacitat de ByteBuffer directa.
PCKD063=No es pot aconseguir una adre\u00E7a de ByteBuffer directa.
PCKD062=La classe @Packed final %.*s no ha de ser buida.
PCKD061=La classe @Packed final no ha de ser buida.
PCKD060=L'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s no \u00E9s v\u00E0lida\: el valor @Length no pot ser zero
PORT046=L'executable no s'ha pogut obrir
PORT045=No s'ha pogut assignar mem\u00F2ria mentre es recuperava la informaci\u00F3 del sistema.
PORT044=No s'ha pogut assignar mem\u00F2ria mentre es recuperava la informaci\u00F3 de l'hipervisor.
PORT043=%1$d\: no s'ha pogut recuperar la informaci\u00F3 de %2$s.
PORT042=No es pot llegir /proc/sysinfo
PORT041=HYPFS no est\u00E0 muntat
PORT040=No s'ha pogut llegir HYPFS
PCKD059=La classe \u00E9s abstracta.
PCKD058=Error al camp imbricat "%2$.*1$s" a la classe %4$.*3$s. El tipus de camp ha de ser una classe de matriu empaquetada final.
PCKD057=La classe d'un camp imbricat ha de ser una classe de matriu empaquetada.
PCKD056=Error al camp imbricat "%2$.*1$s" a la classe %4$.*3$s. La classe de camp ha de ser final i @Packed.
PCKD055=La classe d'un camp imbricat ha de ser final i @Packed.
PCKD054=La classe d'element de la classe de matriu empaquetada ha de ser final i @Packed.
PCKD053=La classe d'element de la classe de matriu empaquetada %.*s ha de ser final i @Packed.
PCKD052=La classe %2$.*1$s, subclasse de %4$.*3$s, ha de ser@Packed perqu\u00E8 amplia un PackedObject.
PCKD051=La superclasse %2$.*1$s de la classe @Packed %4$.*3$s no \u00E9s v\u00E0lida. Una classe @Packed ha d'ampliar un PackedObject o una classe @Packed abstracta.
PCKD050=La superclasse %2$.*1$s de la classe @Packed %4$.*3$s ha de ser abstracta.
PORT039=Ha fallat l'actualitzaci\u00F3 d'HYPFS
PORT038=Valor mal format per a IBM_JAVA_HYPERVISOR_SETTINGS
PORT037=No est\u00E0 en execuci\u00F3 en un Hipervisor.
PORT036=Codi de retorn inesperat del servei CSRSI a z/OS
PORT035=_malloc31 no ha pogut assignar mem\u00F2ria interm\u00E8dia a z/OS
PORT034=S'ha intentat connectar la mem\u00F2ria compartida creada a la clau de protecci\u00F3 d'emmagatzematge %lu, per\u00F2 actualment en execuci\u00F3 a la clau %lu.
PORT033=No s'ha pogut detectar un Hipervisor adm\u00E8s.
PORT032=L'operaci\u00F3 relacionada amb l'Hipervisor ha fallat.
PORT031=S'ha rebut la condici\u00F3 LE %s%i, que correspon a un senyal POSIX em\u00E8s pel programari.
PORT030=El par\u00E0metre %s "%s" especifica que cal connectar l'abocament de mem\u00F2ria principal a un programa extern.  S'est\u00E0 provant de canviar el nom del nucli.%d.\n
PCKD049=La superclasse de la classe @Packed ha de ser abstracta.
PCKD048=La classe @Packed %.*s no t\u00E9 superclasses.
PCKD047=La classe @Packed no t\u00E9 superclasses.
PCKD046=La classe @Packed ha de declarar-se abstracta o final.
PCKD045=La classe @Packed %.*s ha de declarar-se abstracta o final.
PCKD044=Una classe de matriu @Packed es requereix per a aquesta operaci\u00F3.
PCKD043=La classe com.ibm.jvm.packed.PackedObject ha de ser abstracta i no @Packed.
PCKD042=
PCKD041=El tipus cast \u00E9s m\u00E9s gran que l'objecte original.
PCKD040=Les longituds de matriu s\u00F3n diferents.
PORT029=Nansa no v\u00E0lida. Nansa de fitxer\: %1$d.
PORT028=No s'ha pogut executar mmap perqu\u00E8 les opcions d'assignaci\u00F3 no s\u00F3n v\u00E0lides.
PORT027=No s'ha pogut executar mmap perqu\u00E8 hi ha un par\u00E0metre de protecci\u00F3 de mem\u00F2ria que no \u00E9s v\u00E0lid.
PORT026=El fitxer especificat \u00E9s un directori
PORT025=Tipus de bloqueig no v\u00E0lid per a l'operaci\u00F3 de bloqueig de fitxer. lockFlags\: %1$d
PORT024=IEATDUMP ha fallat perqu\u00E8 no hem pogut assignar el conjunt de dades d'abocament de mem\u00F2ria (comproveu l'espai de disc i els permisos de camp).
PORT023=IEATDUMP ha fallat perqu\u00E8 la plantilla d'abocament de mem\u00F2ria especificada per l'usuari era massa llarga. Es tornar\u00E0 a intentar l'abocament de mem\u00F2ria amb la plantilla per defecte.
PORT022=S'est\u00E0 afegint .X&DS a la plantilla d'abocament de mem\u00F2ria especificat per l'usuari per habilitar diversos abocaments de mem\u00F2ria amb diverses parts.
PORT021=Heu obert un sem\u00E0for compartit de System V obsolet\: fitxer \:%1$s semid\:%2$d
PORT020=Heu obert una mem\u00F2ria compartida de System V obsoleta\: fitxer \:%1$s shmid\:%2$d
PCKD039=L'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s no \u00E9s v\u00E0lida\: el camp no es pot declarar est\u00E0tic
PCKD038=Falta l'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s
PCKD037=No es poden crear matrius @Packed multidimensionals
PCKD036=La classe @Packed no pot tenir m\u00E8todes sincronitzats d'inst\u00E0ncia.
PCKD035=La classe @Packed %2$.*1$s no pot tenir m\u00E8todes sincronitzats d'inst\u00E0ncia %4$.*3$s
PCKD034=La classe @Packed no pot tenir camps empaquetats imbricats finals.
PCKD033=La classe @Packed %2$.*1$s no pot tenir el camp imbricat %4$.*3$s
PCKD032=La classe @Packed no pot tenir camps transitoris.
PCKD031=La classe @Packed %2$.*1$s no pot tenir el camp transitori %4$.*3$s
PCKD030=La classe @Packed no pot tenir camps vol\u00E0tils.
PORT019=No es pot crear el directori %s.  Les classes compartides s'inhabilitaran fins que es cre\u00EF aquest directori.
PORT018=L'operaci\u00F3 ha fallat\: %1$d (%2$s failed\: %3$d)
PORT017=L'operaci\u00F3 ha fallat\: %d
PORT016=Error intern %i
PORT015=No es poden resoldre les refer\u00E8ncies de biblioteca compartida\: \u00E9s possible que falti una biblioteca compartida de prerequisit
PORT014=No s'ha pogut carregar el dll perqu\u00E8 no s'ha trobat
PORT013=Error en carregar la biblioteca compartida - No s'ha trobat la taula dll
PORT012=Error en carregar la biblioteca compartida a causa del bit PACE que s'est\u00E0 definint
PORT011=No es pot assignar mem\u00F2ria mentre es prova de carregar una biblioteca compartida
PORT010=No s'ha atorgat perm\u00EDs per carregar la biblioteca compartida
CDRT002=PC amb errors\: %1$p (despla\u00E7ament %2$p), metaData \= %3$p
CDRT001=M\u00E8tode\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
CDRT000=No es pot localitzar la correlaci\u00F3 de pila JIT - avortant VM
PCKD029=La classe @Packed %2$.*1$s no pot tenir el camp vol\u00E0til %4$.*3$s
PCKD028=La classe @Packed no pot implementar la interf\u00EDcie.
PCKD027=La classe @Packed %.*s no ha d'implementar la interf\u00EDcie.
PCKD026=La classe @Packed ha de declarar-se final.
PCKD025=La classe @Packed %.*s ha de declarar-se final.
PCKD024=L'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s no \u00E9s v\u00E0lida\: el valor @Length ha de ser positiu
PCKD023=Aquesta funci\u00F3 no pot funcionar en objectes @Packed combinats.
PCKD022=L'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s no \u00E9s v\u00E0lida\: el tipus de camp ha de ser @Packed
PCKD021=L'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s no \u00E9s v\u00E0lida\: el tipus de camp ha de ser de matriu empaquetada
PCKD020=L'anotaci\u00F3 @Length a %2$.*1$s a %4$.*3$s no \u00E9s v\u00E0lida\: la classe declarant no \u00E9s @Packed
PORT009=No s'ha trobat la biblioteca compartida especificada
PORT008=El m\u00F2dul no t\u00E9 l'arquitectura correcta
PORT007=El m\u00F2dul especificat no \u00E9s cap m\u00F2dul
PORT006=El format del m\u00F2dul no \u00E9s correcte
PORT005=No s'ha pogut carregar la biblioteca compartida
PORT004=Error en la resoluci\u00F3 del s\u00EDmbol
PORT003=No s'ha pogut carregar el m\u00F2dul dependent %s
PORT002=Error desconegut en carregar la biblioteca compartida
PORT001=No s'ha pogut assignar mem\u00F2ria en provar d'escriure en un fitxer.
PORT000=
PCKD019=La classe no @Packed %.*s ja s'ha registrat anteriorment com a classe @Packed.
PCKD018=La classe @Packed %.*s ja s'ha registrat anteriorment com a classe no @Packed.
PCKD017=No es pot emmagatzemar en una matriu de tipus @Packed.
PCKD016=No es pot assignar un camp imbricat de tipus @Packed.
PCKD015=Una classe @Packed ha d'ampliar un PackedObject o una classe @Packed abstracta.
PCKD014=Les subclasses de com.ibm.jvm.packed.PackedObject han de ser @Packed.
PCKD013=Un carregador de classes que no sigui del sistema no pot carregar com.ibm.jvm.packed.PackedObject.
PCKD012=Aquesta operaci\u00F3 no \u00E9s v\u00E0lida en objectes @Packed.
PCKD011=No es pot copiar entre els objectes de diferents tipus @Packed.
PCKD010=
PCKD009=%2$.*1$s de l'anotaci\u00F3 @ImportPacked a %4$.*3$s ja s'ha registrat anteriorment com a classe no @Packed.
PCKD008=La classe no coincideix amb una anotaci\u00F3 @ImportPacked anterior.
PCKD007=No es pot crear un objecte mitjan\u00E7ant aquesta API si la classe d'objecte \u00E9s un tipus @Packed combinat
PCKD006=
PCKD005=
J2JX110=El fitxer JAR %s ja s'ha convertit
PCKD004=No \u00E9s un objecte @Packed de matriu
PCKD003=Una classe de matriu @Packed no \u00E9s v\u00E0lida per a aquesta operaci\u00F3.
PCKD002=No \u00E9s un objecte @Packed natiu
PCKD001=No \u00E9s un objecte @Packed
PCKD000=No \u00E9s una classe @Packed
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s at 0x%5$p.
SHRC098=\nEstad\u00EDstiques actuals per a la mem\u00F2ria cau "%s"\: \n
SHRC097=La mem\u00F2ria cau compartida "%s" est\u00E0 malmesa. No s'assignaran noves JVM per connectar-se a la mem\u00F2ria cau.\n \tLes JVM existents poden continuar funcionant, per\u00F2 no poden actualitzar la mem\u00F2ria cau.
SHRC096=La mem\u00F2ria cau compartida "%s" \u00E9s plena. Utilitzeu -Xscmx per definir la mida de la mem\u00F2ria cau.
SHRC095=No s'ha pogut fer una crida a markStale a elements de mem\u00F2ria cau compartida.
SHRC094=S'ha trobat un orfe per\u00F2 la ROMClass local ha passat a addROMClassToCache.
SHRC093=S'ha detectat una finalitzaci\u00F3 inesperada d'una altra JVM durant l'actualitzaci\u00F3.
SHRC092=Error ADD en llegir la mem\u00F2ria cau
J2JX109=\  -E xxx\=yyy                defineix la propietat del sistema xxx en el valor de la variable d'entorn yyy en temps d'execuci\u00F3
SHRC091=S'han llegit dades malmeses per a l'element 0x%p (dataType no v\u00E0lid).
J2JX108=\  -g[\:lines,source,vars]    genera un subconjunt (l\u00EDnies, origen i/o variables) d'informaci\u00F3 de depuraci\u00F3 de JXE
SHRC090=No s'ha pogut obtenir el mutex de mem\u00F2ria cau a l'inici de SH_CacheMap.
J2JX107=\  -g\:nosym                  incorpora informaci\u00F3 de depuraci\u00F3 dins de JXE
J2JX106=\  -g\:sym                    genera un fitxer .sym per a depuraci\u00F3, cap informaci\u00F3 de depuraci\u00F3 dins de JXE
J2JX105=\  -nog                      no genera informaci\u00F3 de depuraci\u00F3 per a JXE
J2JX104=\  -g                        igual que -g\:sym
J2JX103=No s'ha pogut compilar el m\u00E8tode\: %2$.*1$s/%4$.*3$s%6$.*5$s jitErr 0%7$x
J2JX102=No s'ha pogut compilar el m\u00E8tode natiu\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX101=No s'ha pogut compilar el m\u00E8tode abstracte\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX100=Aquesta configuraci\u00F3 no d\u00F3na suport a %s
SHRC089=No es pot crear el mutex d'actualitzaci\u00F3 a SH_CacheMap.
SHRC088=No s'ha pogut crear una mem\u00F2ria cau com a ROMImageSegment a SH_CacheMap.
SHRC087=MarkStale ha fallat durant ClasspathManager\:\:update().
SHRC086=No es pot entrar al mutex de la taula d'aleatoritzaci\u00F3 ClasspathManager.
SHRC085=ERROR\: No es pot assignar mem\u00F2ria per a la cap\u00E7alera d'element de llista vinculada.
SHRC084=No es pot assignar mem\u00F2ria per a l'element de la llista enlla\u00E7ada.
SHRC083=No es pot assignar mem\u00F2ria per a la matriu identifiedClasspaths a SH_ClasspathManagerImpl2
SHRC082=No es pot crear identifiedMutex a SH_ClasspathManagerImpl2.
SHRC081=No es pot crear cpeTableMutex a SH_ClasspathManagerImpl2.
SHRC080=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash.
SHRC079=No es pot crear una taula de hash a SH_ClasspathManagerImpl2.
SHRC078=No s'ha pogut crear l'agrupaci\u00F3 linkedListHdr a SH_ClasspathManagerImpl2.
SHRC077=No s'ha pogut crear l'agrupaci\u00F3 linkedListImpl a SH_ClasspathManagerImpl2.
SHRC076=S'est\u00E0 cercant la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d...
SHRC075=\ ha fallat.
SHRC074=\ correcte.
SHRC073=S'est\u00E0 emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s (\u00EDndex %6$d)...
VIRT001=No es pot inicialitzar l'Hipervisor.
SHRC072=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres "%s"
VIRT000=Caracter\u00EDstica de virtualitzaci\u00F3 sol\u00B7licitada.
SHRC071=L'opci\u00F3 de l\u00EDnia d'ordres "%s" exigeix una subopci\u00F3.
SHRC070=Inhabilitades les actualitzacions incrementals
SHRC069=Inhabilitada la reducci\u00F3 de contenci\u00F3 d'emmagatzematge simultani
SHRC068=S'ha inhabilitat l'emmagatzematge a la mem\u00F2ria cau local de les variables classpath.
SHRC067=Inhabilitada la comprovaci\u00F3 de la indicaci\u00F3 de l'hora
SHRC066=Blocatge de taules hash locals inhabilitat
SHRC065=No es pot assignar cap agrupaci\u00F3 a shrinit.
SHRC064=No s'ha pogut crear configMonitor a shrinit
SHRC063=No es pot assignar mem\u00F2ria per a sharedClassConfig a shrinit.
SHRC062=Error en copiar el nom d'usuari al nom de la mem\u00F2ria cau per defecte
SHRC061=El nom de la mem\u00F2ria cau no hauria de ser tenir una longitud superior a 64 car\u00E0cters. No s'ha creat la mem\u00F2ria cau.
SHRC060=No es pot assignar mem\u00F2ria per a la mem\u00F2ria interm\u00E8dia de la cadena a shrinit\:\:hookFindSharedClass.
JDTS000=Recepci\u00F3 del transport dt_socket a l'adre\u00E7a\: %d
OFFC031=Desc\u00E0rrega\: el fitxer de propietats natives local t\u00E9 un format no v\u00E0lid {%s}.
OFFC030=Desc\u00E0rrega\: no s'ha pogut trobar el fitxer de propietats natives local {%s}.
SHRC059=No es pot assignar mem\u00F2ria per a ClasspathItem a shrinit\:\:hookFindSharedClass.
SHRC058=No es pot assignar mem\u00F2ria per a ClasspathItem a shrinit\:\:hookStoreSharedClass.
SHRC057=Par\u00E0metres erronis per a l'opci\u00F3 expire
SHRC056=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres "%s"
SHRC055=Inhabilitar les actualitzacions de mem\u00F2ria cau incrementals
SHRC054=Inhabilitar l'algorisme per reduir la contenci\u00F3 d'emmagatzematge
SHRC053=Inhabilitar el blocatge de la taula d'aleatoritzaci\u00F3 local
SHRC052=Inhabilita l'emmagatzematge a la mem\u00F2ria cau de la variable classpath local
SHRC051=Desconnectar les actualitzacions din\u00E0miques
OFFC029=Desc\u00E0rrega\: no s'ha pogut crear el gestor de desc\u00E0rrega.
SHRC050=Habilitar sortida detallada
OFFC028=Desc\u00E0rrega\: no s'ha pogut iniciar el controlador de quarantena local.
OFFC027=Desc\u00E0rrega\: falta informaci\u00F3 de connexi\u00F3 per a l'a\u00EFllament remot.
OFFC026=Desc\u00E0rrega\: informaci\u00F3 de connexi\u00F3 no v\u00E0lida per a l'a\u00EFllament remot.
OFFC025=Desc\u00E0rrega\: no s'ha pogut iniciar el controlador de quarantena amb l'url\=%s.
OFFC024=Desc\u00E0rrega\: s'ha habilitat l'a\u00EFllament de JNI per al grup de biblioteques {%s}.
OFFC023=Tra\u00E7a de desc\u00E0rrega\: l'ajustament de bifurcaci\u00F3 s'est\u00E0 registrant a %s
OFFC022=S'ha instal\u00B7lat la utilitat de tra\u00E7a de desc\u00E0rrega. Utilitzeu -Xoffload\:trace\:help per con\u00E8ixer-ne l'\u00FAs.
OFFC021=\ttuningfork\=device  enviar sortida tuningfork a dispositiu
OFFC020=\txml\=filename       registrar activitat JNI a nom de fitxer
SHRC049=Modalitat de depuraci\u00F3 que comprova tots els codis de bits entrants
SHRC048=Llistar tots els elements de la mem\u00F2ria cau
SHRC047=Imprimir el resum de les estad\u00EDstiques de la mem\u00F2ria cau
SHRC046=Mostrar totes les mem\u00F2ries cau compartides i les seves estad\u00EDstiques
SHRC045=Destruir les mem\u00F2ries cau que no s'han fet servir durant <t> min.
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC043=Habilita l'\u00FAs compartit de codi de bytes modificat\n \t<modContext> \u00E9s un descriptor d'usuari que descriu el tipus de modificaci\u00F3\n \tLes JVM que utilitzen el mateix <modContext> han d'utilitzar les mateixes modificacions.
SHRC042=Destruir totes les mem\u00F2ries cau compartides
SHRC041=Destruir la mem\u00F2ria cau compartida (parm de nom d'\u00FAs o per defecte)
OFFC019=\u00DAs\: -Xoffload\:trace\:[opci\u00F3[,opci\u00F3[,...]]]
J9VM149=%s ja no s'admet. Afegiu les biblioteques o fitxers jar necessaris a la classpath.
SHRC040=Especificar nom de la mem\u00F2ria cau compartida
OFFC018=Utilitat de tra\u00E7a de desc\u00E0rrega per a J9, Versi\u00F3 %s
J9VM148=%s ja no s'admet. El mecanisme d'alteraci\u00F3 temporal endorsed-standards nom\u00E9s s'admet a trav\u00E9s dels m\u00F2duls.
OFFC017=\thelp           imprimeix aquesta pantalla
J9VM147=No es pot adjuntar el fil actual.
OFFC016=\ttax\=spin|delay   estableix l'estrat\u00E8gia de retard
J9VM146=invokeinterface del m\u00E8tode no p\u00FAblic '%4$.*3$s%6$.*5$s' in %2$.*1$s
OFFC015=\toutput\=device    sortida a fitxer, sortida est\u00E0ndard o sortida d'error
J9VM145=%s no s'admet al z/OS.
OFFC014=\tdelay\=\#[ms|us]   aplica un retard de \# mil\u00B7li/micro segons a cada crida JNI
J9VM144=massa par\u00E0metres\: 255 + 1
OFFC013=\u00DAs\: -Xoffload\:sim\:[opci\u00F3[,opci\u00F3[,...]]]
J9VM143=L'opci\u00F3 %s de l\u00EDnia d'ordres no s'admet en aquesta versi\u00F3 de l'IBM SDK.
OFFC012=Utilitat de simulador de desc\u00E0rrega per a J9, Versi\u00F3 %s
J9VM142=L'opci\u00F3 -Xrealtime de l\u00EDnia d'ordres no se suporta en aquesta versi\u00F3 de l'IBM SDK
OFFC011=Simulador de desc\u00E0rrega\: l'ajustament de bifurcaci\u00F3 no s'ha pogut inicialitzar.
J9VM141=m\u00E8todes per defecte en conflicte per '%2$.*1$s%4$.*3$s' in %6$.*5$s de classes [%7$s]
OFFC010=Unitats de temps no reconegudes -> %s
J9VM140=L'emissor no \u00E9s anotat com a @sun.reflect.CallerSensitive.
SHRC039=Imprimir l'ajuda general compartida
SHRC038=\u00DAs\:\n\njava -Xshareclasses[\:opci\u00F3,...]\n\n Les opcions v\u00E0lides que s'inclouen (amb un breu resum) s\u00F3n\:\n\n
SHRC399=Bytes de dades                          %*c\= %d
SHRC037=Inhabilitades les actualitzacions incrementals
SHRC398=Nombre de m\u00E8todes AOT                       %*c\= %d
SHRC036=Inhabilitada la reducci\u00F3 de contenci\u00F3 d'emmagatzematge simultani
SHRC397=Bytes AOT                           %*c\= %d
SHRC035=S'ha inhabilitat l'emmagatzematge a la mem\u00F2ria cau local de les variables classpath.
SHRC396=%% de classes stale                     %*c\= %d%%\n
SHRC034=Inhabilitada la comprovaci\u00F3 de la indicaci\u00F3 de l'hora
SHRC395=Nombre de classes stale                     %*c\= %d
SHRC033=Blocatge de taules hash locals inhabilitat
SHRC394=Nombre de testimonis                            %*c\= %d
SHRC032=La mem\u00F2ria cau de classes compartides a la qual us esteu connectant t\u00E9 un nivell de modificaci\u00F3 erroni.
SHRC393=Nombre d'URL                              %*c\= %d
SHRC031=La mem\u00F2ria cau de classes compartides a la qual us esteu connectant t\u00E9 una versi\u00F3 de JVM no compatible.
OFFC009=Desc\u00E0rrega\: error no recuperable. No es pot registrar cap incid\u00E8ncia
J9VM139=No s'ha pogut crear un fil\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 %4$zd (0x%5$zx)
SHRC392=Nombre de variables classpath                        %*c\= %d
SHRC030=La mem\u00F2ria cau de classes compartides a la qual us esteu connectant t\u00E9 una cap\u00E7alera no v\u00E0lida.
OFFC008=Simulador de desc\u00E0rrega\: temps de rep\u00F2s no v\u00E0lid; trieu un temps igual o superior a 1 mil\u00B7lisegon.
J9VM138=La JVM no admet l'opci\u00F3 -Xdiagnosticscollector.
SHRC391=Nombre de ROMClasses                        %*c\= %d
OFFC007=Simulador de desc\u00E0rrega\: la freq\u00FC\u00E8ncia del rellotge \u00E9s %llu tics/segons, have_nanosleep\=%d
J9VM137=La classe %2$.*1$s t\u00E9 valors per defecte en conflicte en el m\u00E8tode %4$.*3$s%6$.*5$s
SHRC390=Metadades utilitzades %%                     %*c\= %d%%
OFFC006=Simulador de desc\u00E0rrega\: s'estan registrant les crides de JNI a %s.
J9VM136=/proc/sys/kernel/core_pattern par\u00E0metre "%s" especifica una cadena de format per canviar el nom dels abocaments de mem\u00F2ria principal. Potser que la JVM no pugui ubicar abocaments de mem\u00F2ria principal ni canviar-los el nom.
OFFC005=Simulador de desc\u00E0rrega\: taxa de retard mitjan\u00E7ant rep\u00F2s.
J9VM135=/proc/sys/kernel/core_pattern par\u00E0metre "%s" especifica que cal connectar els abocaments de mem\u00F2ria principal a un programa extern. Potser que la JVM no pugui ubicar abocaments de mem\u00F2ria principal ni canviar-los el nom.
OFFC004=Simulador de desc\u00E0rrega\: taxa de retard mitjan\u00E7ant gir.
J9VM134=S'ha configurat l'opci\u00F3 fullcore del sistema en FALSE, els abocaments de mem\u00F2ria del sistema poden estar truncats.
OFFC003=Simulador de desc\u00E0rrega\: s'est\u00E0 aplicant una taxa de %d microsegons a cada crida JNI.
J9VM133=S'ha configurat l'ulimit permanent de la mida del fitxer d'abocament del nucli del sistema en %d, els abocaments de mem\u00F2ria del sistema poden estar truncats.
OFFC002=Simulador de desc\u00E0rrega\: s'est\u00E0 aplicant una taxa de %d mil\u00B7lisegons a cada crida JNI.
J9VM132=S'ha especificat un mode de paraula de bloqueig no v\u00E0lid, java/lang/Class i java/lang/String no poden tenir paraules de bloqueig quan -Xtenant est\u00E0 present\: %s
OFFC001=S'ha instal\u00B7lat la utilitat de simulaci\u00F3 de desc\u00E0rrega. Executeu -Xoffload\:sim\:help per con\u00E8ixer-ne l'\u00FAs.
J9VM131=El proc\u00E9s ha finalitzat mitjan\u00E7ant CEE3AB2() amb el fi de tasca anormal %1$u, ra\u00F3 %2$u, neteja %3$u.
OFFC000=-Xoffload\:sim\: no es reconeix l'opci\u00F3 --> '%s'
J9VM130=Execuci\u00F3 represa de l'aplicaci\u00F3 despr\u00E9s de manipular una condici\u00F3 que no es pot recuperar i que s'ha retornat a Java de manera no permesa o que s'ha recorregut (codi JIT'ed)
SHRC029=No hi ha prou mem\u00F2ria al sistema
SHRC028=Perm\u00EDs denegat
SHRC389=Bytes de metadades                      %*c\= %d
SHRC027=El nom de la mem\u00F2ria cau compartida \u00E9s massa llarg
SHRC388=Bytes de ROMClass                      %*c\= %d
SHRC026=No es pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada\: consulteu els valors de SHMMAX i SHMMIN
SHRC387=Bytes lliures                          %*c\= %d
SHRC025=error en connectar la mem\u00F2ria compartida
SHRC386=Mida de mem\u00F2ria cau                          %*c\= %d
SHRC024=error de desconnexi\u00F3 de mem\u00F2ria compartida
SHRC385=Punter d'assignaci\u00F3                  %*c\= 0x%p\n
SHRC023=La mem\u00F2ria cau no existeix
SHRC384=Adre\u00E7a final                         %*c\= 0x%p
SHRC022=Error en crear la regi\u00F3 de mem\u00F2ria compartida
SHRC383=\nAdre\u00E7a base                        %*c\= 0x%p
SHRC021=S'ha retornat un codi d'error desconegut
J9VM129=L'execuci\u00F3 repr\u00E8n de l'aplicaci\u00F3 despr\u00E9s de manipular una condici\u00F3 que no es pot recuperar i s'ha retornat a Java de manera no permesa o s'ha recorregut a Java
SHRC382=Bytes d'\u00E0rea de depuraci\u00F3 de classe LocalVariableTable %*c\= %u\n
SHRC020=S'ha produ\u00EFt un error en obrir el sem\u00E0for
J9VM128=Espai d'emmagatzematge din\u00E0mic Java
SHRC381=Bytes de classe LineNumberTable         %*c\= %u
J9VM127=La mida inicial del subassignador de 32 bits no es pot configurar en zero.
SHRC380=\u00C0rea de depuraci\u00F3 de classes %% utilitzada             %*c\= %u%%
J9VM126=La mida de la confirmaci\u00F3 del subassignador de 32 bits no es pot configurar en zero.
J9VM125=La mida de la confirmaci\u00F3 del subassignador de 32 bits \u00E9s m\u00E9s gran que la mida inicial. Mida de la confirmaci\u00F3 \= %1$u, mida inicial \= %2$u.
J9VM124=No es pot definir la classe %.*s - '%.*s' \u00E9s un paquet de sistema protegit
J9VM123=S'est\u00E0 provant d'executar en un processador no adm\u00E8s, la JVM finalitzar\u00E0.
J9VM122=NO es pot obtenir l'interfal d'adreces user32.dll necessari per a -Xprotectcontiguous.
J9VM121=-Xscmaxjitdata s'ignora si no s'ha especificat -Xshareclasses
J9VM120=-Xscminjitdata s'ignora si no s'especifica -Xshareclasses
SHRC019=la longitud de la sol\u00B7licitud \u00E9s massa petita
SHRC018=no es pot assignar la mem\u00F2ria
SHRC379=Mida d'\u00E0rea de depuraci\u00F3 de classes               %*c\= %u
SHRC017=Codi d'error\: %d
SHRC378=\nOpcions de l\u00EDnia d'ordres relacionades\: \n
SHRC016=Error de la mem\u00F2ria cau de classes compartides\:
SHRC377=El valor -Xscdmx de %u \u00E9s superior als %u bytes d'espai lliure disponible. Cal utilitzar un valor de %u bytes per a -Xscdmx.
SHRC015=Error de la mem\u00F2ria cau de classes compartides\: identificador no v\u00E0lid
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC014=L'eliminaci\u00F3 del sem\u00E0for de mem\u00F2ria cau compartida "%s" ha fallat.
SHRC375=El nom de la mem\u00F2ria cau \u00E9s massa llarga quan s'inclou el nom d'usuari. Queden %d bytes en aquesta mem\u00F2ria interm\u00E8dia i el nom d'usuari t\u00E9 %d bytes.
SHRC013=L'eliminaci\u00F3 de la mem\u00F2ria de la mem\u00F2ria cau compartida "%s" ha fallat.
SHRC374=Mem\u00F2ria cau creada amb\:
SHRC012=No es pot eliminar la mem\u00F2ria cau compartida "%s" perqu\u00E8 encara hi ha connectades a la mem\u00F2ria cau.
SHRC373=Bytes de dades JIT     \= %d
SHRC011=Error\: no es pot obrir la mem\u00F2ria cau de classes compartides
J9VM119=-Xscmaxjit s'ignora si no s'ha especificat -Xshareclasses
SHRC372=Nombre de mem\u00F2ries cau comprimides       \= %d
SHRC010=La mem\u00F2ria cau compartida "%s" s'ha destru\u00EFt.
J9VM118=-Xscminjit s'ignora si no s'especifica -Xshareclasses
SHRC371=Bytes de mem\u00F2ria cau comprimits    \= %d
J9VM117=-Xitsn s'ignora si no s'ha especificat -Xshareclasses
SHRC370=-Xnolinenumbers    \= false
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister i TraceListener ja no s'admeten; utilitzeu les noves versions a JVMRAS_VERSION_1_5
J9VM116=noLockword\:%.*s
J9RI022=La inicialitzaci\u00F3 de JVMRI no pot assignar un supervisor d'abocament de mem\u00F2ria de jvmri
J9VM115=lockword\:%.*s
J9RI021=jvmri->RunDumpRoutine no est\u00E0 suportat.
J9VM114=Mode Lockword\=%s
J9RI020=jvmri->CreateThread no pot assignar el supervisor privat
J9VM113=-----------------------------
J9VM112=Configuraci\u00F3 de Lockword
J9VM111=S'ha especificat una opci\u00F3 lockword no v\u00E0lida\: %s
J9VM110=S'ha especificat un mode lockword no v\u00E0lid\: %s
SHRC009=La mem\u00F2ria cau compartida s'ha obert\: mida de %1$s\: %2$d bytes
SHRC008=S'ha creat la mem\u00F2ria cau compartida\: mida de %1$s\: %2$d bytes
SHRC369=-Xnolinenumbers    \= true
SHRC007=No s'ha pogut eliminar la mem\u00F2ria cau de classes compartides "%s".
SHRC368=S'est\u00E0 aturant la mem\u00F2ria cau de classes compartides no habilitada per a depuraci\u00F3.
SHRC006=El nombre de mem\u00F2ries cau caducades els darrers %1$d minuts \u00E9s %2$d.
SHRC367=depuraci\u00F3 habilitada      \= false
SHRC005=No hi ha cap mem\u00F2ria cau de classes compartides disponible.
SHRC366=depuraci\u00F3 habilitada      \= true
J9RI019=jvmri->InjectOutOfMemory no est\u00E0 suportat.
SHRC004=No es pot destruir la mem\u00F2ria cau "%s".
SHRC365=Habilita l'emmagatzematge d'informaci\u00F3 de depuraci\u00F3 de classes a la classe compartida.
J9RI018=jvmri->NotifySignal que activa la senyal %d.
SHRC003=\u00FAltima hora de desconnexi\u00F3
SHRC364=La crida de SH_OSCachesysv\:\:acquireWriteLock() a j9shsem_wait al semid %d ha fallat amb l'error %d.
J9RI017=No s'ha pogut assignar l'agent d'abocament de mem\u00F2ria a jvmri->SetOutOfMemoryHook; no s'ha registrat la funci\u00F3.
SHRC002=en \u00FAs
SHRC363=No es pot assignar una API per a classes compartides a shrinit.
J9RI016=S'ha cridat jvmri->SetOutOfMemoryHook amb una crida de retorn NUL\u00B7LA; no s'ha registrat la funci\u00F3.
SHRC001=shmid del sistema operatiu
J9VM109=Sistema operatiu no adm\u00E8s (%s)\: Cal utilitzar Windows XP o posterior.
SHRC362=No es pot assignar mem\u00F2ria per a ClasspathItem.
J9RI015=jvmri->RunDumpRoutine\: el componentId es troba fora dels l\u00EDmits.
SHRC000=Mem\u00F2ria cau compartida
J9VM108=-Xlog\:info,warn,error\n
SHRC361=Error en connectar amb la mem\u00F2ria compartida durant l'obertura/creaci\u00F3
J9RI014=jvmri->RunDumpRoutine\: no es poden recuperar les dades del component.
J9VM107=-Xlog\:error,warn
SHRC360=No s'han pogut trobar les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
J9RI013=jvmri->ReleaseRasInfo\: l'estructura t\u00E9 un camp de tipus no suportat.
J9VM106=Les opcions info, warn, error, vital i config es poden combinar amb una ',', per exemple\: \n
J9RI012=S'ha cridat jvmri->ReleaseRasInfo amb una estructura RasInfo NUL\u00B7LA.
J9VM105=-Xlog\:config            Registra missatges de configuraci\u00F3 de la JVM. \n
J9RI011=L'estructura RasInfo t\u00E9 un camp de tipus no suportat.
J9VM104=-Xlog\:vital             Registra missatges vitals de la JVM. Aquesta opci\u00F3 est\u00E0 activada per defecte.
J9RI010=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
J9VM103=-Xlog\:error             Registra missatges d'error de la JVM. Aquesta opci\u00F3 est\u00E0 activada per defecte.
J9VM102=-Xlog\:warn              Registra els missatges d'advertiment de la JVM.
J9VM101=-Xlog\:info              Registra els missatges informatius de la JVM.
J9VM100=-Xlog\:all               Registra tots els missatges de la JVM.
SHRC359=S'han trobat les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC358=No s'han pogut emmagatzemar les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida.
SHRC357=S'han emmagatzemat les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida.
SHRC356=No s'ha pogut emmagatzemar el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
J9RI009=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
SHRC355=S'ha emmagatzemat el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
J9RI008=jvmri->GetRasInfo no pot obtenir components.
SHRC354=No s'ha pogut trobar el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
J9RI007=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
SHRC353=S'ha trobat el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
J9RI006=S'ha cridat jvmri->GetRasInfo amb una estructura RasInfo NUL\u00B7LA.
SHRC352=No s'ha pogut emmagatzemar la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb el testimoni %5$.*4$s.
J9RI005=El component %s de jvmri->GetComponentDataArea no t\u00E9 cap dataArea a sota d'aquesta vm.
SHRC351=S'ha emmagatzemat la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb el testimoni %5$.*4$s.
J9RI004=No s'admet jvmri->DynamicVerbosegc.
SHRC350=No s'ha pogut emmagatzemar la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s.
J9RI003=No s'ha pogut assignar l'agent d'abocament de mem\u00F2ria a jvmri->DumpRegister; no s'ha registrat la funci\u00F3.
J9RI002=S'ha cridat jvmri->DumpRegister amb una crida de retorn NUL\u00B7LA; no s'ha registrat la funci\u00F3.
J9RI001=Error intern en eliminar l'agent de buidatge a jvmri->DumpDeregister; \u00E9s possible que la funci\u00F3 d'abocament de mem\u00F2ria no s'hagi desregistrat
J9RI000=jvmri->CreateThread no pot assignar mem\u00F2ria d'arguments de fils
SHRC349=S'ha emmagatzemat la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s.
SHRC348=No s'ha pogut emmagatzemar la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s (\u00EDndex %6$d).
SHRC347=S'ha emmagatzemat la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s (\u00EDndex %6$d).
SHRC346=No s'ha pogut trobar la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb el testimoni %4$.*3$s.
SHRC345=S'ha trobat la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb el testimoni %4$.*3$s.
SHRC344=No s'ha pogut trobar la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb l'URL %4$.*3$s.
SHRC343=S'ha trobat la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb l'URL %4$.*3$s.
SHRC342=No s'ha pogut trobar la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d.
SHRC341=S'ha trobat la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d.
SHRC340=La comprovaci\u00F3 de CRC de mem\u00F2ria cau ha fallat. CRC emmagatzemat %1$x, CRC calculat %2$x
SHRC339=Missatge d'error de plataforma\: %1$s
SHRC338=Codi d'error de capa de port \= %1$d
SHRC699=No s'ha pogut restaurar la mem\u00F2ria cau compartida no persistent "%s" des de la instant\u00E0nia.
SHRC337=Missatge d'error de plataforma\: %1$s
SHRC698=La mem\u00F2ria cau compartida no persistent "%s" s'ha restaurat correctament des de la instant\u00E0nia.
SHRC336=Codi d'error de capa de port \= %1$d
SHRC697=No s'ha pogut obtenir el directori per a la mem\u00F2ria cau compartida.
SHRC335=La recuperaci\u00F3 d'errors ha fallat\: la destrucci\u00F3 de sem\u00E0for compartit ha fallat.
SHRC696=Les subopcions "%s" i "%s" no s\u00F3n compatibles. S'ha ignorat la subopci\u00F3 "%s".
SHRC334=La recuperaci\u00F3 d'errors ha fallat\: la destrucci\u00F3 de mem\u00F2ria compartida ha fallat.
J2SE000=-Djava.runtime.version=pxp6480sr2-20151023_01 (SR2)
SHRC695=Restaura una nova mem\u00F2ria cau compartida no persistent des d'una instant\u00E0nia
SHRC333=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per defecte per a la mem\u00F2ria cau
SHRC694=Destrueix totes les instant\u00E0nies de mem\u00F2ria cau compartida
SHRC332=La protecci\u00F3 de p\u00E0gines de dades s'ha habilitat correctament per a la mem\u00F2ria cau.
SHRC693=Destrueix la instant\u00E0nia d'una mem\u00F2ria cau compartida (utilitza el par\u00E0metre de nom o el valor per defecte)
SHRC331=S'ha adquirit un sem\u00E0for diferent del sem\u00E0for que s'utilitzava abans amb aquesta mem\u00F2ria cau.
SHRC692=Crea una instant\u00E0nia d'una mem\u00F2ria cau compartida no persistent existent.
SHRC330=SH_CompositeCacheImpl\:\:runExitCode no ha pogut adquirir el mutex d'\u00E0rea d'escriptura (codi de retorn %d).
SHRC691=Restringeix classpaths                  \= false
SHRC690=Restringeix classpaths                  \= true
JITM018=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %4$zu%5$s %6$s alternativament
JITM017=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %4$zu%5$s alternativament
JITM016=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %3$zu%4$s %5$s alternativament
JITM015=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %3$zu%4$s alternativament
JITM014=Els car\u00E0cters de coma addicional descoberts a l'opci\u00F3 '- Xlp' es passen per alt
JITM013=L'opci\u00F3 '%1$s' no est\u00E0 completa, s'ha d'especificar el par\u00E0metre '%2$s'.
JITM012=El valor per a '%s' no \u00E9s correcte
JITM011=El valor %s especificat \u00E9s massa llarg
JITM010=%s ha d'anar seguida d'un n\u00FAmero
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex no ha pogut adquirir el mutex de taula de cadenes (codi de retorn %d).
SHRC328=System V IPC ha notificat l'error seg\u00FCent '%s'.
SHRC689=Permet que una JVM emmagatzemi classpaths a la mem\u00F2ria cau creada amb l'opci\u00F3 "restrictClasspaths".
SHRC327=La crida de SH_OSCachesysv\:\:acquireWriteLock() a j9shsem_wait ha fallat amb l'error %d.
SHRC688=Nom\u00E9s es poden afegir classpaths si primer la JVM inicialitza la mem\u00F2ria cau.
SHRC326=No s'ha pogut publicar el bloqueig d'usuari cap\u00E7alera de mem\u00F2ria cau de classes compartides durant la inicialitzaci\u00F3. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC687=No es pot crear una nova mem\u00F2ria cau de classe compartida si s'executa amb l'opci\u00F3 -Xshareclasses\:readonly.
SHRC325=No s'ha pogut publicar el bloqueig de cap\u00E7alera de mem\u00F2ria cau de classes compartides durant la inicialitzaci\u00F3. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC686=No s'ha pogut iniciar la mem\u00F2ria cau de classe compartida. S'ha especificat continuar sense utilitzar-la com a -Xshareclasses\:nonfatal.
SHRC324=ERROR\: Error en sortir del mutex per a la cap\u00E7alera de mem\u00F2ria cau de classes compartides. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC685=S'ha produ\u00EFt un error en obrir la mem\u00F2ria compartida. No s'ha pogut bloquejar el fitxer de control.
SHRC323=ERROR\: Error en introduir el mutex per a la cap\u00E7alera de mem\u00F2ria cau de classes compartides. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC684=S'ha produ\u00EFt un error en obrir el sem\u00E0for. No s'ha pogut bloquejar el fitxer de control.
SHRC322=No s'han pogut inicialitzar els sem\u00E0fors per a la mem\u00F2ria cau de classes compartides. Advertiment\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC683=S'ha assolit el l\u00EDmit del sistema per al nombre total de fitxers oberts.
SHRC321=Recuperaci\u00F3 d'errors\: es tancaran els sem\u00E0fors de mem\u00F2ria compartida.
SHRC682=S'ha assolit el l\u00EDmit del sistema per al nombre m\u00E0xim de regions de mem\u00F2ria compartida o el l\u00EDmit per a tot el sistema de la mem\u00F2ria assignada a les regions de mem\u00F2ria compartida.
SHRC320=Recuperaci\u00F3 d'errors\: es destruiran els sem\u00E0fors de mem\u00F2ria compartida.
SHRC681=S'ha assolit el l\u00EDmit del sistema per al nombre m\u00E0xim de sem\u00E0fors o s'ha assolit el nombre m\u00E0xim de sem\u00E0fors de tot el sistema.
SHRC680=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut eliminar el fitxer de control %s del conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
JITM009=La configuraci\u00F3 del sistema no admet el par\u00E0metre '%.*s' a l'opci\u00F3 '- Xlp'
JITM008=JIT no ha pogut assignar mem\u00F2ria
JITM007=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar amb els par\u00E0metres de JVMPI o JVMTI actuals. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM006=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar amb la pol\u00EDtica de recollida de deixalles actual. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM005=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar a la versi\u00F3 de JVM actual. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM004=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar al processador actual. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM003=S'ha produ\u00EFt un error durant la inicialitzaci\u00F3 en temps d'execuci\u00F3 d'AOT. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM002=S'ha produ\u00EFt un error en emmagatzemar codi AOT a la mem\u00F2ria cau de classes compartides. \u00C9s possible que la mem\u00F2ria cau de classes compartides s'hagi malm\u00E8s. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM001=No hi ha m\u00E9s espai per a codi AOT a la mem\u00F2ria cau de classes compartides. No es generar\u00E0 codi AOT nou.
JITM000=Maquinari no adm\u00E8s [%d].
SHRC319=Recuperaci\u00F3 d'errors\: es tancar\u00E0 la mem\u00F2ria compartida.
SHRC318=Recuperaci\u00F3 d'errors\: es destruir\u00E0 la mem\u00F2ria compartida.
SHRC679=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut eliminar el fitxer de control %s del conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
SHRC317=Imprimiu el nom del fitxer de mem\u00F2ria cau de classes compartides que s'utilitzar\u00E0.
SHRC678=Missatge d'error de plataforma\: %1$s
SHRC316=No es pot serialitzar la mem\u00F2ria cau perqu\u00E8 no hi ha cap fil de VM actual.
SHRC677=Codi d'error de capa de port \= %1$d
SHRC315=No es poden inicialitzar els segments de mem\u00F2ria de classes de mem\u00F2ria cau.
SHRC676=No s'ha pogut destruir la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida.
SHRC314=No es pot assignar mem\u00F2ria per a la taula de cerca de suggeriments a SH_Manager.
SHRC675=No s'ha pogut destruir la mem\u00F2ria compartida associada a la mem\u00F2ria cau de classe compartida.
SHRC313=No s'ha pogut crear jclCacheMutex a shrinit.
SHRC674=L'usuari no t\u00E9 perm\u00EDs per destruir la mem\u00F2ria compartida amb shmid\=%d. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir la mem\u00F2ria compartida.
SHRC312=Error en alliberar el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC673=No s'ha pogut destruir el conjunt de sem\u00E0fors amb semid\=%d associat a la mem\u00F2ria cau de classe compartida.
SHRC311=Error en alliberar el bloqueig d'escriptura de connexi\u00F3 de fitxer de mem\u00F2ria cau de classes compartides
SHRC672=No s'ha pogut destruir un conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
SHRC310=No es pot localitzar la mem\u00F2ria cau persistent en un sistema de fitxers en xarxa. Seleccioneu un altre cacheDir.
SHRC671=L'usuari no t\u00E9 perm\u00EDs per destruir el conjunt de sem\u00E0fors amb semid\=%d. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir el conjunt de sem\u00E0fors.
SHRC670=Recuperaci\u00F3 d'errors\: S'est\u00E0 intentant utilitzar la mem\u00F2ria compartida en mode de nom\u00E9s lectura si existeix la regi\u00F3 de mem\u00F2ria compartida, en resposta a l'opci\u00F3 "-Xshareclasses\:nonfatal".
SHRC309=Les opcions "grow" i "readonly" no es poden utilitzar juntes.
SHRC308=No s'ha pogut serialitzar la mem\u00F2ria cau "%s". No s'han pogut actualitzar els despla\u00E7aments de classes ROM als m\u00E8todes AOT.
SHRC669=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida.
SHRC307=\tROMMETHOD\: %2$.*1$s Signatura\: %4$.*3$s Adre\u00E7a\: 0x%5$p
SHRC668=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir la mem\u00F2ria compartida.
SHRC306=\ Signatura\: %2$.*1$s Adre\u00E7a\: 0x%3$p
SHRC667=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt la mem\u00F2ria compartida amb id\=%d associada a la mem\u00F2ria cau de classe compartida.
SHRC305=No es pot assignar mem\u00F2ria per a la taula de cerca de suggeriments a SH_ClasspathManagerImpl2.
SHRC666=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt la mem\u00F2ria compartida associada a la mem\u00F2ria cau de classe compartida.
SHRC304=No s'ha pogut substituir la mem\u00F2ria cau "%s".
SHRC665=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir el conjunt de sem\u00E0fors amb semid\=%d associat a la mem\u00F2ria cau de classe compartida.
SHRC303=No s'ha pogut crear la mem\u00F2ria cau imbricada "%s".
SHRC664=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir el conjunt de sem\u00E0fors amb semid\=%d associat a la mem\u00F2ria cau de classe compartida. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir el conjunt de sem\u00E0fors.
SHRC302=No pot augmentar la mem\u00F2ria cau imbricada "%s"; no s'ha pogut assignar un bloc com a suggeriment.
SHRC663=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt un conjunt de sem\u00E0fors amb id\=%d associat a la mem\u00F2ria cau de classe compartida.
SHRC301=No pot augmentar la mem\u00F2ria cau imbricada "%s"; no s'ha pogut assignar una supermem\u00F2ria cau nova com a suggeriment.
SHRC662=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt un conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
SHRC300=Una altra VM est\u00E0 utilitzant la mem\u00F2ria cau de classes compartides; la mem\u00F2ria cau imbricada no pot augmentar.
SHRC661=La JVM no ha pogut associar l'id\=%d de mem\u00F2ria compartida amb la mem\u00F2ria cau de classes compartides.
SHRC660=La JVM no ha pogut associar l'id\=%d de conjunt de sem\u00E0fors amb la mem\u00F2ria cau de classes compartides.
SHRC659=S'ha produ\u00EFt un error en obrir la mem\u00F2ria compartida
VMUT013=El fitxer d'opcions %s no \u00E9s v\u00E0lid.
SHRC658=La JVM no ha pogut comprovar els permisos de la mem\u00F2ria cau compartida.
VMUT012=%2$.*1$s no \u00E9s una superinterf\u00EDcie de directe %4$.*3$s.
SHRC657=La JVM no permet acc\u00E9s al fitxer de mem\u00F2ria cau compartida perqu\u00E8 l'ID d'usuari del proc\u00E9s de JVM i l'ID de grup s\u00F3n diferents dels del fitxer de mem\u00F2ria cau compartida i l'ID d'usuari de proc\u00E9s de JVM no pertany al grup de propietari de fitxer de mem\u00F2ria cau compartida.
VMUT011=No s'ha pogut assignar mem\u00F2ria per la matriu d'opcions de la l\u00EDnia d'ordres
SHRC656=La JVM no est\u00E0 configurada per accedir a la mem\u00F2ria cau compartida. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess'.
VMUT010=Valor d'opci\u00F3 amb format incorrecte; l'opci\u00F3 "%1$s%3$.*2$s" cont\u00E9 car\u00E0cters finals "%4$s" que s'han ignorat
SHRC655=Es pot accedir a la mem\u00F2ria cau per a l'usuari actual \= %s
SHRC654=La JVM no permet l'acc\u00E9s la mem\u00F2ria compartida de mem\u00F2ria cau compartida creada i propietat d'un altre usuari que no es troba al grup.
SHRC653=La JVM no est\u00E0 configurada per accedir a la mem\u00F2ria associada amb mem\u00F2ria cau de classes compartides no persistent. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess' i 'readonly'.
SHRC652=La JVM no est\u00E0 configurada per accedir a la mem\u00F2ria associada amb mem\u00F2ria cau de classes compartides no persistent. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess'.
SHRC651=La JVM ha detectat que l'ID d'usuari efectiu del proc\u00E9s \u00E9s el propietari per\u00F2 no el creador de la mem\u00F2ria associada amb la mem\u00F2ria cau compartida. JVM no connectar\u00E0 amb la mem\u00F2ria cau compartida per evitar accedir col\u00B7lisions de la mem\u00F2ria cau compartida.
SHRC650=La JVM no ha pogut comprovar els permisos de la mem\u00F2ria associada amb la mem\u00F2ria cau compartida.
VMUT009=Valor amb format incorrecte per -Xservice
VMUT008=Valor amb format incorrecte per IBM_JAVA_OPTIONS
VMUT007=Valor amb format incorrecte per a JAVA_TOOL_OPTIONS
VMUT006=S'ha trobat una opci\u00F3 amb el format incorrecte %s a -Xoptionsfile
VMUT005=Opci\u00F3 massa gran\: '%s'
VMUT004=Opci\u00F3 mal formada\: '%s'
SHRC649=La JVM no permet l'acc\u00E9s al conjunt de sem\u00E0fors de mem\u00F2ria cau compartida creada i propietat d'un altre usuari que no es troba al grup.
VMUT003=No s'ha trobat el fitxer d'opcions
SHRC648=La JVM no est\u00E0 configurada per accedir a conjunt de sem\u00E0fors associat amb mem\u00F2ria cau de classes compartides no persistent. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess'.
VMUT002=(error d'acc\u00E9s)
SHRC647=La JVM ha detectat que l'ID d'usuari efectiu del proc\u00E9s \u00E9s el propietari per\u00F2 no el creador de conjunt de sem\u00E0fors associat amb la mem\u00F2ria cau compartida. JVM no connectar\u00E0 amb la mem\u00F2ria cau compartida per evitar accedir col\u00B7lisions de la mem\u00F2ria cau compartida.
VMUT001=(fil sense nom)
SHRC646=La JVM no ha pogut comprovar els permisos del conjunt de sem\u00E0fors associat amb la mem\u00F2ria cau compartida.
VMUT000=(sense mem\u00F2ria)
SHRC645=Habilita modalitat de diagn\u00F2stic mprotect
SHRC644=JVM ha adjuntat la mem\u00F2ria cau de classes compartides al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic). l'opci\u00F3 -Xshareclasses\:mprotect\=none s'ignorar\u00E0.
SHRC643=JVM ha adjuntat la mem\u00F2ria cau de classes compartides al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic). La utilitzaci\u00F3 de la mem\u00F2ria cau en aquest mode pot afectar el rendiment.
SHRC642=JVM ha creat la mem\u00F2ria cau de classes compartides al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic). La utilitzaci\u00F3 de la mem\u00F2ria cau en aquest mode pot afectar el rendiment.
SHRC641=JVM est\u00E0 intentant utilitzar la mem\u00F2ria cau compartida existent al mode de diagn\u00F2stic mprotect  (using -Xshareclasses\:mprotect\=diagnostic option), per\u00F2 la mem\u00F2ria cau no estava creant en aquest mode. En aquest cas mprotect\=diagnostic s'obvia en z/OS.
SHRC640=JVM est\u00E0 utilitzant la mem\u00F2ria cau compartida existent al mode de diagn\u00F2stic mprotect  (using -Xshareclasses\:mprotect\=diagnostic option), per\u00F2 la mem\u00F2ria cau no estava creant en aquest mode. La utilitzaci\u00F3 de la mem\u00F2ria cau en aquest mode pot afectar el rendiment.
SMAP005=
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP000=
J9GC086=No s'han pogut instanciar les metadades de refer\u00E8ncies comprimides; s'ha sol\u00B7licitat %1$zu%2$s.
SHRC639=Nom\u00E9s es poden utilitzar les opcions del programa d'utilitat de la mem\u00F2ria cau en combinaci\u00F3 amb -Xmt. Poseu altres opcions de la mem\u00F2ria cau compartida al fitxer javad.options.
J9GC085=grand\u00E0ria inicial de metadates de refer\u00E8ncies comprimides
SHRC638=La creaci\u00F3 de la mem\u00F2ria cau amb l'opci\u00F3 cacheRetransformed obliga a tenir el mode disableBCI.
J9GC084=La resoluci\u00F3 del rellotge del SO reclama no donar suport al temps de pausa de destinaci\u00F3 sol\u00B7licitat.  Sobreescriptura degut a l'opci\u00F3 de l\u00EDnia d'ordres -Xgc\:overrideHiresTimerCheck
SHRC637=La subopci\u00F3 --Xshareclasses\:cacheRetransformed no \u00E9s compatible amb un existent BCI a la mem\u00F2ria cau compartida que hi ha habilitada.
J9GC083=No s'ha pogut inicialitzar, l'opci\u00F3 d'inquilins m\u00FAltiples nom\u00E9s admet -Xgcpolicy\:balanced
SHRC636=La subopci\u00F3 "disableBCI" no \u00E9s compatible amb un existent BCI a la mem\u00F2ria cau compartida que hi ha habilitada.
J9GC082=La sol\u00B7licitud de %1$s mida de p\u00E0gina %2$zu%3$s%4$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %5$zu%6$s%7$s alternativament
SHRC635=Emmagatzemar el fitxer de classes intermedi \= true
J9GC081=Els car\u00E0cters de coma addicional descoberts a l'opci\u00F3 '- Xlp' es passen per alt
SHRC634=S'ha especificat l'opci\u00F3 "-XX\:-StoreIntermediateClassfile" i la mem\u00F2ria cau existent s'ha creat amb l'opci\u00F3 "-XX\:+StoreIntermediateClassfile".
J9GC080=La configuraci\u00F3 del sistema no admet el par\u00E0metre '%.*s' a l'opci\u00F3 '- Xlp'
SHRC633=S'ha especificat l'opci\u00F3 "-XX\:+StoreIntermediateClassfile" per\u00F2 la mem\u00F2ria cau existent no s'ha creat amb l'opci\u00F3 "-XX\:+StoreIntermediateClassfile".
SHRC632=L'espai reservat per a les dades JIT a la mem\u00F2ria cau compartida "%s" \u00E9s ple. Utilitzeu- Xscminjitdata per augmentar l'espai reservat per a les dades JIT.
SHRC631=L'espai reservat per a les dades AOT a la mem\u00F2ria cau compartida "%s" \u00E9s ple. Utilitzeu- Xscminaot per augmentar l'espai reservat per a les dades AOT.
SHRC630=L'espai est\u00E0 ple per emmagatzemar dades no AOT/no JIT, com ara classes, a la mem\u00F2ria cau compartida "%s".
J9GC079=L'opci\u00F3 '%1$s' no est\u00E0 completa, s'ha d'especificar el par\u00E0metre '%2$s'.
J9GC078='%1$s' no est\u00E0 especificat com a primer par\u00E0metre a l'opci\u00F3 '%2$s'
J9GC077=La configuraci\u00F3 del sistema no admet la mida de p\u00E0gina gran sol\u00B7licitada %1$zu%2$s %3$s
J9GC076=La configuraci\u00F3 del sistema no admet la mida de p\u00E0gina gran sol\u00B7licitada %1$zu%2$s
SHRC629=El fitxer de control de mem\u00F2ria compartida \u00E9s nom\u00E9s de lectura.
J9GC075=S'ha produ\u00EFt un error en analitzar l'opci\u00F3 '-Xlp'
SHRC628=El fitxer de control de mem\u00F2ria compartida no es pot llegir.
J9GC074=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %4$zu%5$s %6$s alternativament
SHRC627=No es pot tornar a crear cap fitxer de control de la mem\u00F2ria compartida quan s'executi en mode nom\u00E9s de lectura.
J9GC073=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %4$zu%5$s alternativament
SHRC626=No es poden obtenir les estad\u00EDstiques de la mem\u00F2ria cau compartida perqu\u00E8 no existeix cap mem\u00F2ria cau compartida v\u00E0lida.
J9GC072=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %3$zu%4$s %5$s alternativament
SHRC625=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Ha fallat la comprovaci\u00F3 de la mida de la mem\u00F2ria compartida.
J9GC071=El valor per a '%s' no \u00E9s correcte
SHRC624=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Ha fallat la comprovaci\u00F3 de l'ID d'usuari.
J9GC070=No s'ha pogut iniciar el recollidor de deixalles
SHRC623=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Ha fallat la comprovaci\u00F3 de l'ID de grup.
SHRC622=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Discrep\u00E0ncia en les claus de mem\u00F2ria compartida.
SHRC621=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Discrep\u00E0ncia en l'ID de mem\u00F2ria compartida.
SHRC620=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. S'ha trobat que el fitxer de control est\u00E0 malm\u00E8s.
J9GC069=No s'ha pogut inicialitzar el fil de finalitzaci\u00F3
J9GC068=ScopedMemory.join/joinAndEnter s'ha interromput
J9GC067=No s'ha pogut instanciar l'emmagatzematge din\u00E0mic de divisi\u00F3\: %1$s (mida nova %2$zu%3$s, mida anterior %4$zu%5$s)
J9GC066=No s'ha pogut assignar la geometria de mem\u00F2ria d'emmagatzematge din\u00E0mic de divisi\u00F3 obligat\u00F2ria.
SHRC619=El fitxer de control de sem\u00E0for \u00E9s nom\u00E9s de lectura.
J9GC065=No s'ha pogut assignar un espai nou
SHRC618=El fitxer de control de sem\u00E0for no es pot llegir.
J9GC064=No s'ha pogut assignar un espai anterior
SHRC617=S'ha produ\u00EFt un error en obrir el sem\u00E0for. No s'ha trobat el marcador de sem\u00E0fors al conjunt de sem\u00E0fors.
J9GC063=No es pot obrir el fitxer '%s' per escriure'l
SHRC616=S'ha produ\u00EFt un error en obrir el sem\u00E0for. Discrep\u00E0ncia en el nombre de sem\u00E0fors al conjunt de sem\u00E0fors.
J9GC062=El valor de %s ha de ser un quadrat
SHRC615=S'ha produ\u00EFt un error en obrir el sem\u00E0for. Discrep\u00E0ncia en la clau de sem\u00E0for.
J9GC061=Mida m\u00E0xima d'espai de mem\u00F2ria amb \u00E0mbit
SHRC614=S'ha produ\u00EFt un error en obrir el sem\u00E0for. Discrep\u00E0ncia en l'ID de sem\u00E0for.
J9GC060=Mida d'espai de mem\u00F2ria permanent
SHRC613=S'ha produ\u00EFt un error en obrir el sem\u00E0for. S'ha trobat que el fitxer de control est\u00E0 malm\u00E8s.
SHRC612=Clau d'emmagatzematge (0- 15) definida artificialment al z/OS per a la comprovaci\u00F3.
SHRC611=La subopci\u00F3 "disableBCI" s'ha especificat, per\u00F2 la mem\u00F2ria cau existent es va crear amb la subopci\u00F3 "enableBCI".
SHRC610=Inhabilitar el suport per a la instrumentaci\u00F3 de codi de byte.
J9GC059=-Xgcpolicy\:metronome no es permet sense -Xrealtime
J9GC058=No s'ha pogut assignar espai de mem\u00F2ria permanent
J9GC057=%1$s no ha de ser superior a %2$s
J9GC056=Mides de p\u00E0gina gran disponibles\:
SHRC609=Actualitzades %1$s dades adjuntes %2$s per a %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC055=Mida de p\u00E0gina gran
SHRC608=S'han trobat %1$s dades adjuntes %2$s per a %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC054=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa; s'utilitzar\u00E0 %3$zu%4$s com a alternativa.
SHRC607=Emmagatzemades %1$s dades adjuntes %2$s per a %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC053=M\u00E0xim de mem\u00F2ria
SHRC606=Afegeix consells JIT no funcionals als m\u00E8todes per a la comprovaci\u00F3; utilitzar amb -Xint i una mem\u00F2ria cau emplenada pr\u00E8viament.
J9GC052=Increment del segment de la classe ROM
SHRC605=La mida de mem\u00F2ria per a "%s" \u00E9s massa gran, o especifica unitats que no s\u00F3n 'K','M' o 'G'.
J9GC051=Increment del segment de la classe RAM
SHRC604=Reserva de <size> bytes d'espai de la mem\u00F2ria cau per a dades de classe sense processar
J9GC050=M\u00E0xim de mem\u00F2ria lleu
SHRC603=Bytes utilitzats de dades de classe sense processar  %*c\= %lu
SHRC602=\u00C0rea de dades de classe sense processar %% usat   %*c\= %lu%%
SHRC601=Mida de l'\u00E0rea de dades de classe sense processar    %*c\= %lu
SHRC600=L'\u00E0rea de dades de classe sense processar est\u00E0 malmesa perqu\u00E8 l'emmagatzematge de %u bytes superar\u00E0 l'espai lliure de l'\u00E0rea disponible ('inici d'espai lliure'\=%p, 'final d'espai lliure'\=%p).
J9GC049=Mida de conjunt recordat
J9GC048=Imcrement d'espai anterior
J9GC047=Mida d'espai anterior m\u00E0xima
J9GC046=Mida d'espai anterior inicial
J9GC045=Mida de mem\u00F2ria inicial
J9GC044=Mida d'espai nou m\u00E0xima
J9GC043=Mida d'espai nou inicial
J9GC042=La suma de %1$s i %2$s \u00E9s massa petita per a %3$s
J2JX099=Opcions incompletes a la l\u00EDnia d'ordres. La primera era\: %s
J9GC041=No es coneix el tipus fvtest\: %s
J2JX098=Argument no v\u00E0lid [%1$s] per a l'opci\u00F3\: %2$s
J9GC040=Opci\u00F3 desconeguda\: %s
J2JX097=No es reconeixen les opcions a la l\u00EDnia d'ordres. La primera era\: %s
J2JX096=No s'ha pogut trobar la funci\u00F3 j9bcv_verifyCreateStackAttributes
J2JX095=No s'ha pogut trobar la funci\u00F3 j9bcv_verifyClassStructure
J2JX094=No s'ha pogut obrir la DLL de verificador %1$s\: %2$s
J2JX093=No s'ha especificat cap fitxer de classe a la l\u00EDnia d'ordres
J2JX092=Error intern amb la VM acabada de crear
J2JX091=S'ha creat correctament la Java VM
J2JX090=S'ha intentat crear una Java VM per fer-se servir a AOT
J9GC039=%1$s s'ha deixat d'utilitzar; utilitzeu %2$s com a alternativa
J9GC038=El valor %s especificat \u00E9s massa llarg
J9GC037=%1$s no s'admet amb valors que no siguin %2$zu
J9GC036=El valor de %1$s ha de ser superior a %2$zu
J9GC035=%s ha d'anar seguida d'un n\u00FAmero
J9GC034=El valor de %1$s ha d'estar entre %2$zu i %3$zu (tots dos inclosos)
J9GC033=El valor de %1$s ha d'estar entre %2$.2f i %3$.2f (tots dos inclosos)
J9GC032=La configuraci\u00F3 del sistema no d\u00F3na suport a l'opci\u00F3 '%s'
J2JX089=Error intern\: no s'ha pogut trobar %1$s a %2$s
J9GC031=%1$s i %2$s no es poden especificar conjuntament
J2JX088=Error intern\: no s'ha pogut obrir %1$s\: %2$s
J9GC030=El valor %1$s de %2$.2f ha de ser, com a m\u00EDnim, %3$s inferior al valor %4$s de %5$.2f
J2JX087=Error intern\: no s'ha pogut determinar el nom d'executable
J2JX086=S'han escrit %1$i al fitxer de s\u00EDmbols %2$s
J2JX085=Error intern\: al crear la classe rom %d s'ha produ\u00EFt un codi d'error no suportat
J2JX084=Tancant el segment %d i iniciant un nou segment
J2JX083=Incloent %s a AOT
J2JX082=Excloent %s a AOT
J2JX081=Error\: %s
J2JX080=Error de verificaci\u00F3 al m\u00E8tode %1$i (%3$.*2$s%5$.*4$s) a PC %6$i
J9GC029=Error de l'opci\u00F3\: '%s'
J9GC028=Opci\u00F3 massa gran\: '%s'
J9GC027=Opci\u00F3 mal formada\: '%s'
J9GC026=-Xverbosegclog no ha pogut assignar estructures internes
J9GC025=Suma de %1$s i %2$s
J9GC024=La suma de %1$s i %2$s \u00E9s massa gran per a l'emmagatzematge din\u00E0mic
J9GC023=La suma de %1$s i %2$s ha de ser igual a %3$s
J9GC022=La suma de %1$s i %2$s \u00E9s massa gran per a %3$s
J2JX079=Error\: %1$s a %2$i
J9GC021=%1$s ha de ser igual a %2$s
J2JX078=Acci\u00F3 recomanada\:
J9GC020=%s massa gran per l'\u00E0rea d'emmagatzematge
J2JX077=Fitxer de classe no v\u00E0lid
J2JX076=Fitxer de classe no v\u00E0lid\: %s
J2JX075=Nom d'entrada massa llarg\: %s
J2JX074=S'ha intentat afegir una entrada duplicada a JXE\: %s
J2JX073=dir que processa el fitxer\: %s
J2JX072=No s'ha pogut obrir el directori %s
J2JX071=Processant el directori\: %s
J2JX070=augmentant l'espai a\: %i bytes
J9GC019=%1$s \u00E9s massa gran per a %2$s
J9GC018=%1$s \u00E9s massa petit per a %2$s
J9GC017=%1$s massa petit; ha de tenir, com a m\u00EDnim %2$zu %3$s bytes
J9GC016=No s'ha pogut assignar un segment de supervivent a l'espai de mem\u00F2ria per defecte
J9GC015=No s'ha pogut assignar l'espai de mem\u00F2ria per defecte
J9GC014=No s'ha pogut assignar els segments de mem\u00F2ria de classe VM
J9GC013=No s'ha pogut assignar els segments de mem\u00F2ria d'objectes VM
J9GC012=No s'ha pogut assignar els segments de mem\u00F2ria VM
J2JX069=grand\u00E0ria estimada de mem\u00F2ria\: %i bytes
J9GC011=No s'ha pogut inicialitzar l'agrupaci\u00F3 d'espais de mem\u00F2ria
J2JX068=grand\u00E0ria del fitxer\: %i bytes
J9GC010=No s'ha pogut inicialitzar la gsti\u00F3 de finalitzaci\u00F3
J2JX067=No s'ha trobat cap classe v\u00E0lida a %s
J2JX066=No s'ha pogut obrir el fitxer\: %s
J2JX065=Error en tancar el fitxer zip\: %s
J2JX064=Els valors v\u00E0lids per l'opci\u00F3 -precompileTarget s\u00F3n\:
J2JX063=Els valors per defecte s\u00F3n\:
J2JX062=classfile(s)                qualsevol nombre de fitxers que acabin amb .class, .jar, o .zip \n                             ser\u00E0 examinat i s'afegir\u00E0 a jxe\n
J2JX061=Opcions de compilaci\u00F3 abans d'hora\:\n   -[no]precompile           [no] selecciona tots els m\u00E8todes per la compilaci\u00F3 pr\u00E8via\n   -[no]precompileMethod xxx [no] selecciona els m\u00E8todes amb nom per la compilaci\u00F3 pr\u00E8via\n   -[no]compileAheadOfTime   compila el m\u00E8tode seleccionat abans d'hora\n   -precompileTarget xxx     genera jxe per l'arquitectura de destinaci\u00F3 i el sistema operatiu xxx\n   -precompileOptions xxx    passa xxx al motor de compilaci\u00F3 pr\u00E8via\n   -[no]precompileResolve    [no] prova de resoldre refer\u00E8ncies externes durant la compilaci\u00F3 pr\u00E8via\n   -[no]stripBytecode        [no] divideix el codi d'octets per a m\u00E8todes compilats AOT\n
J2JX060=\  -j2se                     utilitzeu aquesta opci\u00F3 quan utilitzeu jar2jxe en un entorn Java SE\n
J9GC009=No s'ha pogut inicialitzar el mutex per les estad\u00EDstiques GC
J9GC008=No s'ha pogut inicialitzar les extensions de m\u00F2dul
J9GC007=No s'ha pogut inicialitzar; no es pot analitzar la l\u00EDnia d'ordres
J9GC006=No s'ha pogut inicialitzar; sense mem\u00F2ria
J9GC005=No s'ha pogut inicialitzar
J9GC004=No s'ha pogut particularitzar el recollidor d'escombraries globals
J9GC003=No s'ha pogut particularitzar l'expenedor de tasques
J9GC002=No s'ha pogut instanciar l'emmagatzematge din\u00E0mic; s'ha sol\u00B7licitat %1$zu%2$s
J2JX059=\  -[no]tools                el directori tools [no] s'afegeix a la llista de directoris d'extensions
J9GC001=No s'ha pogut particularitzar l'\u00E0rea d'emmagatzematge
J2JX058=\  -padJxe                   omple jxe al final amb xxx bytes extra
J9GC000=Error intern; sense mem\u00F2ria
J2JX057=\  -[no]segmented            [no] genera m\u00FAltiples jxes segmentats\n   -maxSegmentSize xxx       grand\u00E0ria m\u00E0x. per qualsevol jxe segmentat (n\u00FAmero hex)\n   -maxSegmentSize seg\=xxx   grand\u00E0ria m\u00E0x. per un jxe segmentat espec\u00EDfic (n\u00FAmero hex)\n   -locate xxx               localitza la imatge a l'adre\u00E7a xxx (n\u00FAmero hex)\n   -locate seg\=xxx           localitza la imatge d'un segment a l'adre\u00E7a hex xxx
J2JX056=\  -fileExtension xxx        tracta els finals dels fitxers amb .xxx com fitxers .jar
J2JX055=\  -vmOption xxx             fa servir vmOption xxx quan s'executa jxe
J2JX054=\  -versionName xxx          estableix el nom de versi\u00F3 de jxe a xxx
J2JX053=\  -description xxx          estableix la descripci\u00F3 de jxe a xxx
J2JX052=\  -uuid xxx                 estableix UUID de jxe a xxx
J2JX051=\  -D xxx\=yyy                estableix la propietat del sistema xxx a yyy
J2JX050=\  -startupClass xxx         estableix la classe d'engegada a xxx\n  -noStartupClass           indica que jxe no t\u00E9 cap classe d'engegada
J2JX049=\  -srcDir xxx               inclou tots els fitxers a l'arbre de directoris xxx
J2JX048=\  -outputFormat xxx         estableix el format de sortida a xxx (c, bin o jar)
J2JX047=\  -o xxx                    estableix el nom de fitxer de sortida b\u00E0sic a xxx
J2JX046=\  -be                       genera una sortida d'endi\u00E0 gran\n   -le                       genera una sortida d'endi\u00E0 petit
J2JX045=\  -version                  imprimeix la versi\u00F3 d'aquest programa
J2JX044=\  -[no]profile              [no] genera cap fitxer .prf pel perfil
J2JX043=
J2JX042=\  -[no]verify               [no] verifica el format del fitxer de classes
J2JX041=\  -q                        modalitat sense informaci\u00F3\n   -[no]logo                 [no] imprimir el missatge de copyright \n   -verbose                  modalitat verbosa
J2JX040=\u00DAs\:\t%s [opcions] fitxers_classe\n\n[opcions]\n   -help, -?                 imprimir l'\u00FAs
VERB036=grand\u00E0ria inicial de metadates de refer\u00E8ncies comprimides
VERB035=mides de p\u00E0gina gran disponibles per a la mem\u00F2ria cau de codi JIT\:
VERB034=mida de p\u00E0gina gran per a la mem\u00F2ria cau de codi JIT
VERB033=Espai m\u00E0xim perm\u00E8s de mem\u00F2ria cau de classes compartides per a dades JIT
VERB032=Espai m\u00EDnim reservat de mem\u00F2ria cau de classes compartides per a dades JIT
VERB031=Espai reservat de mem\u00F2ria cau de classes compartida per a atributs de depuraci\u00F3 de classes
VERB030=Espai m\u00E0xim perm\u00E8s de mem\u00F2ria cau de classes compartides per a JIT
J2JX039=IBM \u00E9s una marca registrada d'IBM Corp.\nJava i totes les marques i logotips basats en Java s\u00F3n marques registrades\n o comercials de Sun Microsystems, Inc.
J2JX038=Materials sota llic\u00E8ncia - Propietat d'IBM
J2JX037=
J2JX036=Destinaci\u00F3\: %s\n
J2JX035=(c) Copyright IBM Corp. 1991, 2005  Reservats tots els drets
J2JX034=J9 Java(TM) JAR to JXE, Version %s
J2JX033=Error intern\: no s'ha pogut crear correctament la classe rom Error
J2JX032=Car\u00E0cters de cometes no equilibrades a la llista de par\u00E0metres
J2JX031=Ha finalitzat la lectura del fitxer JAR\: %s
J2JX030=Error en llegir %1$s de %2$s
VERB029=Espai m\u00EDnim reservat de mem\u00F2ria cau de classes compartides per a JIT
VERB028=Pila detallada\: No es pot imprimir la informaci\u00F3 de pila per als fils en execuci\u00F3 actuals.
VERB027=Pila detallada\: el fil en execuci\u00F3 "%2$.*1$s" utilitza %3$zd/%4$zd bytes a les piles Java/C
VERB026=Entrada de variable classpath no v\u00E0lida\: %s (no s'admet el jxe endian oposat)
VERB025=Entrada de variable classpath no v\u00E0lida\: %s (cap\u00E7alera d'imatge malmesa de jxe)
VERB024=Entrada de variable classpath no v\u00E0lida\: %s (a jxe li falta rom.classes)
VERB023=Entrada de variable classpath no v\u00E0lida\: %s (error desconegut)
VERB022=Entrada de variable classpath no v\u00E0lida\: %s (tipus de fitxer desconegut)
VERB021=Entrada de variable classpath no v\u00E0lida\: %s (tipus de fitxer no adm\u00E8s)
VERB020=Entrada de variable classpath no v\u00E0lida\: %s (el fitxer s'ha malm\u00E8s)
J2JX029=processant\: %s
J2JX028=Error en llegir l'entrada de %s
J2JX027=No s'ha pogut obrir o llegir %s
J2JX026=el segment %d no s'ha pogut encaixar dins de la grand\u00E0ria m\u00E0xima necess\u00E0ria del segment
J2JX025=S'ha intentat afegir una classe duplicada a JXE %s
J2JX024=afegit el fitxer de classe\: %s
J2JX023=s'ha intentat afegir el fitxer de classe\: %s
J2JX022=%s no \u00E9s v\u00E0lid
J2JX021=No s'ha pogut carregar %1$s\: %2$s
J2JX020=Est\u00E0 augmentant ncpRef [%1$x] de %2$u entrades a %3$u entrades
CFRE138=L'atribut Classfile fa refer\u00E8ncia a una entrada d'agrupaci\u00F3 constant no existent
CFRE137=La classe t\u00E9 m\u00E9s d'un atribut RuntimeVisibleTypeAnnotations o RuntimeInvisibleTypeAnnotations
CFRE136=modificadors no permesos per m\u00E8tode d'interf\u00EDcie
CFRE135=El nom de par\u00E0metre de m\u00E8tode no \u00E9s UTF8
CFRE134=Par\u00E0metre de m\u00E8tode t\u00E9 un senyalador no v\u00E0lid.
CFRE133=El m\u00E8tode t\u00E9 dos atributs MethodParameters
CFRE132=type_annotation target_type no reconeguts
CFRE131=L'atribut BootstrapMethods que requereix invokedynamic no apareix o \u00E9s massa petit
VERB019=Entrada de variable classpath no v\u00E0lida\: %s (la lectura del fitxer ha fallat)
CFRE130=diversos atributs BootstrapMethods
VERB018=Entrada de variable classpath no v\u00E0lida\: %s (l'E/S de fitxer ha fallat)
VERB017=Espai m\u00E0xim perm\u00E8s de mem\u00F2ria cau de classes compartides per a AOT
VERB016=Espai m\u00EDnim reservat de mem\u00F2ria cau de classes compartides per a AOT
VERB015=Mida de mem\u00F2ria cau de classes compartides
VERB014=M\u00E0xim de mem\u00F2ria
VERB013=Increment del segment de la classe ROM
VERB012=Increment del segment de la classe RAM
VERB011=Grand\u00E0ria de la pila de fils java
VERB010=Grand\u00E0ria m\u00E0xima de la pila de fils java
J2JX019=Est\u00E0 augmentant la mem\u00F2ria interm\u00E8dia [%1$x] de %2$u a %3$u
J2JX018=%s creat satisfact\u00F2riament
J2JX017=No s'han pogut escriure les dades en el fitxer\: %s
J2JX016=No s'ha pogut crear/esborrar el fitxer\: %s
J2JX015=Codi d'error desconegut\: %d
J2JX014=Error en la inicialitzaci\u00F3 a AOT
J2JX013=Error intern\: no s'ha pogut invertir l'endi\u00E0
J2JX012=L'UUID proporcionat no \u00E9s v\u00E0lid
J2JX011=Error intern\: l'entrada de ZIP no est\u00E0 tancada
J2JX010=Error intern\: error en llegir
CFRE129=Entrada d'agrupaci\u00F3 de constants no v\u00E0lida als fitxers de classes amb les versions < 51.0
CFRE128=Signatura de methodtype no v\u00E0lida
CFRE127=L'\u00EDndex de m\u00E8todes de bootstrap ha de fer refer\u00E8ncia a una entrada d'agrupaci\u00F3 de constants de MethodHandle
CFRE126=El codi de bytes d'invokedynamic ha reservat ranures no zero
CFRE125=El codi de bytes d'invokedynamic ha de fer refer\u00E8ncia a una entrada d'agrupaci\u00F3 de constants d'InvokeDynamic
CFRE124=L'etiqueta del valor de l'element d'anotaci\u00F3 no \u00E9s v\u00E0lida
CFRE123=Les constants de MethodHandle han de fer refer\u00E8ncia a un camp o a una refer\u00E8ncia de m\u00E8tode
CFRE122=La classe pot ser, com a molt, p\u00FAblica o m\u00F2dul
CFRE121=Nom de campo no perm\u00E8s
VERB009=Increment de la pila de fils java
CFRE120=Els codis d'operaci\u00F3 jsr i jsr_w no s\u00F3n v\u00E0lids als fitxers de classes amb les versions superior a la 51.0
VERB008=grand\u00E0ria inicial de la pila de fils java
VERB007=Mida de pila de fils de sistema operatiu
VERB006=No s'ha pogut inicialitzar
VERB005=Error\: falta el nom de fitxer -Xverbosegclog
VERB004=Error\: el nombre -Xverbosegclog de cicles ha de ser superior a 0
VERB003=Error\: el nombre de fitxers -Xverbosegclog ha de ser superior a 0
VERB002=Pila detallada\: l'\u00FAs de pila m\u00E0xima era de %1$zd/%2$zd bytes a piles Java/C
VERB001=
VERB000=Pila detallada\: "%2$.*1$s" ha utilitzat %3$zd/%4$zd bytes a les piles Java/C
J2JX009=Error intern\: ha fallat la cerca
J2JX008=Error intern\: sense entrades
J9VM099=-Xlog\:none              Inhabilita les opcions de registre de la JVM especificades anteriorment, incloent-hi els valors per defecte.
J2JX007=Error intern\: entrada duplicada
J9VM098=-Xlog\:help              Imprimeix l'ajuda de -Xlog de la JVM.
J2JX006=Sense mem\u00F2ria
J9VM097=\n\u00DAs\:\n
J2JX005=Error intern\: discrep\u00E0ncia de grand\u00E0ria
J9VM096=-Xscdmx s'ignora si no s'especifica -Xshareclasses
J2JX004=Error intern\: MISMATCH CRC
J9VM095=Violaci\u00F3 de restricci\u00F3 de c\u00E0rrega en resoldre el m\u00E8tode "%2$.*1$s.%4$.*3$s%6$.*5$s"\: el carregador "%8$.*7$s@%9$x" de la classe "%11$.*10$s" i el carregador "%13$.*12$s@%14$x" de la classe "%16$.*15$s" tenen diferents tipus per a la signatura de m\u00E8tode
J2JX003=Error intern\: argument de funci\u00F3 erroni
J9VM094=La "%s" encara est\u00E0 activa despr\u00E9s d'executar els lligams d'aturada.
J2JX002=S'han compilat pr\u00E8viament %1$d de %2$d m\u00E8todes per a la destinaci\u00F3 %3$s.
J9VM093=Aquesta versi\u00F3 de Java necessita una CPU que admeti extensions SSE2 o posteriors.  Vegeu la informaci\u00F3 sobre entorns admesos de la Guia de l'usuari d'IBM Java per obtenir-ne m\u00E9s detalls.
J2JX001=Recurs emmagatzemat\: %s
J9VM092=No s'admet el gir adaptatiu
J2JX000=S'ha intentat afegir el fitxer de recurs duplicat [%s], el fitxer s'ha ignorat.
J9VM091=S'admet el gir adaptatiu
TRCE019=El motor de traces no s'ha pogut inicialitzar correctament, RC \= %d
J9VM090=Resposta lenta a la consulta de xarxa (%d segons); comproveu la configuraci\u00F3 IP DNS.
TRCE018=No es pot assignar la clau d'emmagatzematge local de fils UTE
TRCE017=No es pot assignar la clau d'emmagatzematge local de fils RAS
CFRE119=Diversos atributs SourceFile
TRCE016=L'emmagatzematge per a RasGlobalStorage no est\u00E0 disponible, la tra\u00E7a no est\u00E0 habilitada
CFRE118=Bytes addicionals despr\u00E9s de l'EOF
TRCE015=S'ha produ\u00EFt un error en registrar el subscriptor d'escriptura de tra\u00E7a
CFRE117=El camp no pot ser final i vol\u00E0til
TRCE014=Ha fallat la inicialitzaci\u00F3 del motor de traces, no est\u00E0 habilitada la tra\u00E7a
CFRE116=El codi de bytes d'invoke ha de fer refer\u00E8ncia a una Methodref
TRCE013=Escriptura d'informaci\u00F3 de recompte de tra\u00E7a a %s
CFRE115=Les dimensions de matriu s\u00F3n superiors a 255
TRCE012=No es pot obrir el fitxer comptador de punt de tra\u00E7a %s, comptadors redirigits a stderr.
CFRE114=El nom de camp no \u00E9s v\u00E0lid
TRCE011=El m\u00F2dul no est\u00E0 configurat per a la tra\u00E7a\: %s
CFRE113=EOF inesperat
TRCE010=Error d'assignaci\u00F3 de mem\u00F2ria nativa, retrocedint a valors de tra\u00E7a no din\u00E0mics.
CFRE112=La VM no admet la verificaci\u00F3 din\u00E0mica
CFRE111=UTF8 amb format incorrecte
CFRE110=Constant incompatible per al camp
J9VM089=Advertiment\: no es poden verificar els par\u00E0metres de syscorepath amb sysconfig\: %s.
J9VM088=Advertiment\: syscorepath no s'ha configurat, cosa que pot impedir la generaci\u00F3 del fitxer core del sistema (si en cal un).\n\t\tConsulteu les instruccions d'instal\u00B7laci\u00F3 del WebSphere Real Time per con\u00E8ixer els par\u00E0metres de configuraci\u00F3 correctes de syscorepath.\n\t\tNOTA\: s'ha de configurar cada vegada que es reinici\u00EF la m\u00E0quina.
J9VM087=resetDumpOption exigeix %s
J9VM086=Opci\u00F3 massa gran\: '%s'
J9VM085=Opci\u00F3 mal formada\: '%s'
J9VM084=Error d'IFA\: codi de retorn inesperat %08x del servei de commutaci\u00F3 d'IFA
J9VM083=Error en commutar al processador IFA; rc\: %08x
J9VM082=No es pot commutar al processador IFA; emeteu "extattr +a lib%s.so"
J9VM081=Valor d'opci\u00F3 amb format incorrecte; l'opci\u00F3 "%1$s%3$.*2$s" cont\u00E9 car\u00E0cters finals "%4$s" que s'han ignorat
TRCE009=Error en escriure al fitxer breu
J9VM080=queryVmDump exigeix %s
TRCE008=Error en dur a terme la cerca al fitxer de tra\u00E7a\: %s
TRCE007=S'ha produ\u00EFt un error en obrir la seg\u00FCent generaci\u00F3 del fitxer de tra\u00E7a\: %s
CFRE109=Signatura de m\u00E8tode no v\u00E0lida
TRCE006=S'ha produ\u00EFt un error en escriure %d bytes al fitxer de tra\u00E7a\: %s rc\: %d
CFRE108=L'\u00EDndex de m\u00E8todes de tancament ha de fer refer\u00E8ncia a un nom i un tipus
TRCE005=Error en escriure la cap\u00E7alera al fitxer de tra\u00E7a\: %s
CFRE107=Despla\u00E7ament fora d'interval al codi de bytes de jump
TRCE004=S'ha produ\u00EFt un error en obrir el fitxer de tra\u00E7a\: %s
CFRE106=M\u00E8tode duplicat
TRCE003=S'ha produ\u00EFt un error en processar l'opci\u00F3 de tra\u00E7a, detall\: %s
CFRE105=La superclasse ha de ser una classe
TRCE002=S'ha produ\u00EFt un error en processar l'opci\u00F3 de tra\u00E7a\: -Xtrace\:%s\=%s
CFRE104=El camp pot ser, com a molt, p\u00FAblic, privat o protegit
TRCE001=S'ha produ\u00EFt un error en processar l'opci\u00F3 de tra\u00E7a\: -Xtrace\:%s
CFRE103=El m\u00E8tode abstracte no pot ser privat, est\u00E0tic, final, natiu, sincronitzat o estricte
TRCE000=Opci\u00F3 de tra\u00E7a no reconeguda\: -Xtrace\:%s
CFRE102=Signatura de camp no v\u00E0lida
CFRE101=Despla\u00E7ament fora d'interval al codi de bytes de switch
CFRE100=S'han sol\u00B7licitat massa dimensions al codi de bytes de multianewarray
J9VM079=triggerOneOffDump(%1$s) exigeix %2$s
J9VM078=Valor amb format incorrecte per a JAVA_TOOL_OPTIONS
J9VM077=Nota\: -Xdfpbd no t\u00E9 cap efecte en aquesta versi\u00F3 de Java
J9VM076=La mem\u00F2ria nativa s'ha exhaurit assignant l'entrada de llista per a un objecte finalitzable o de refer\u00E8ncia
J9VM075=Operaci\u00F3 no permesa al fil eventron
J9VM074=La classe %2$.*1$s est\u00E0 accedint de forma no permesa a la classe de %3$s %5$.*4$s
J9VM073=La classe %2$.*1$s est\u00E0 accedint de forma no permesa al membre %3$s de la classe %5$.*4$s
J9VM072=S'ha exhaurit la mem\u00F2ria nativa
J9VM071=S'ha intentat vincular de forma recursiva un m\u00E8tode natiu %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM070=La mem\u00F2ria nativa s'ha exhaurit durant la vinculaci\u00F3 del m\u00E8tode natiu %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM069=Violaci\u00F3 de restricci\u00F3 de c\u00E0rrega\: el carregador "%2$.*1$s@%3$x" ha iniciat anteriorment la c\u00E0rrega d'un tipus diferent amb el nom "%5$.*4$s" definit pel carregador "%7$.*6$s@%8$x"
J9VM068=-Xshareclasses no habilita; s'ignora l'opci\u00F3 -Xzero\:sharestring
J9VM067=-Xshareclasses no habilita; s'ignora l'opci\u00F3 -Xzero\:sharezip
J9VM066=el tipus d'argument no coincideix
J9VM065=l'objecte no \u00E9s una inst\u00E0ncia de classe de declaraci\u00F3
J9VM064=setDumpOption necessita %s
J9VM063=seekDumpAgent necessita %s
J9VM062=removeDumpAgent necessita %s
J9VM061=insertDumpAgent necessita %s
J9VM060=runNamedDump(%1$s) necessita %2$s
J9VM059=-Xscmaxaot es passa per alt si no s'especifica -Xshareclasses
J9VM058=-Xscminaot es passa per alt si no s'especifica -Xshareclasses
J9VM057=S'ha superat el l\u00EDmit de mem\u00F2ria cau de supervisi\u00F3
J9VM056=Versi\u00F3 principal
J9VM055=Error no recuperable\: versi\u00F3 principal de JXE diferent de %d
J9VM054=No s'ha pogut crear un fil\: retVal %1$zd, errno %2$zd
J9VM053=L'opci\u00F3 mal formada %s s'ha trobat a -Xoptionsfile
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] estableix la mida m\u00E0xima de la matriu en mem\u00F2ria cau JNI\n
J9VM051=\u00DAs\:\n
J9VM050=-Xjni\: opci\u00F3 no reconeguda --> '%s'
J9VM049=No s'admeten temps de retenci\u00F3 de JLM
J9VM048=S'admeten temps de retenci\u00F3 de JLM
J9VM047=JLM no adm\u00E8s
J9VM046=JLM adm\u00E8s
J9VM045=No s'admeten supervisors de sistema de tres nivells
J9VM044=S'admeten supervisors de sistema de tres nivells
J9VM043=-----------------------
J9VM042=Configuraci\u00F3 de fils
J9VM041=nombre incorrecte d'arguments
J9VM040=desbordament de pila de sistema operatiu
SHRC299=La mem\u00F2ria cau de classes compartides "%s" no s'ha creat amb l'opci\u00F3 imbricada i la mem\u00F2ria cau no pot augmentar.
SHRC298=Per executar la utilitat "%s" a la mem\u00F2ria cau de classes persistent "%s", utilitzeu la subopci\u00F3 "persistent".
SHRC297=Per utilitzar mem\u00F2ries cau de classes compartides a l'AIX, la variable d'entorn CORE_MMAP s'ha d'haver definit en "yes".
SHRC296=L'execuci\u00F3 amb l'opci\u00F3 "noCoreMmap" significar\u00E0 que \u00E9s poc probable que IBM us proporcioni assist\u00E8ncia perqu\u00E8 faltaran les dades de classe dels abocaments de mem\u00F2ria del sistema.
SHRC295=Desactiva la depend\u00E8ncia de tenir CORE_MMAP a l'AIX
SHRC294=%1$d\: 0x%2$p CHARARRAY\: a 0x%3$p.
SHRC293=No es pot assignar mem\u00F2ria per a l'agrupaci\u00F3 d'element de taula de hash a ROMClassResourceManager.
J9VM039=-Xscmx s'ignora si no s'ha especificat -Xshareclasses
SHRC292=No es pot entrar al mutex de taula de hash de ROMClassResourceManager.
J9VM038=-Xthr\: no es reconeix l'opci\u00F3 --> '%s'
SHRC291=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ROMClassResourceManager.
J9VM037=No s'ha pogut assignar el monitor
SHRC290=No s'ha pogut crear un element de taula de hash nou a ROMClassResourceManager.
J9VM036=divideix per zero
J9VM035=No es pot assignar OutOfMemoryError
J9VM034=JVMRI requereix motor de traces\: s'executa amb el senyalador -Xtrace
J9VM033=Error no recuperable\: no s'ha pogut inicialitzar %s
J9VM032=Error no recuperable\: no es pot carregar %1$s\: %2$s
J9VM031=La classe necess\u00E0ria %2$.*1$s ha d'estar al cam\u00ED d'acc\u00E9s de classes d'engegada, per\u00F2 s'ha trobat al cam\u00ED d'acc\u00E9s de classes de l'aplicaci\u00F3 a %4$.*3$s
VRFY041=invocaci\u00F3 especial d'inicialitzador incorrecte
J9VM030=S'ha utilitzat UTF8 no v\u00E0lid a la funci\u00F3 JNI
VRFY040=El verificador no pot assignar mem\u00F2ria nativa
SHRC289=No detectis quan es localitza una mem\u00F2ria cau en un sistema de fitxers en xarxa remot
SHRC288=ID de mem\u00F2ria compartida   \= %d
SHRC287=No es pot localitzar la mem\u00F2ria cau persistent en un sistema de fitxers en xarxa. Seleccioneu "nonpersistent" o un altre cacheDir.
SHRC286=La mem\u00F2ria cau de classes compartides oberta %1$s \u00E9s nom\u00E9s de lectura
SHRC285=La mem\u00F2ria cau persistent de classe compartida %1$s \u00E9s nom\u00E9s de lectura
SHRC284=No s'ha pogut crear una mem\u00F2ria cau en modalitat de nom\u00E9s lectura
SHRC283=Obre la mem\u00F2ria cau amb permisos de nom\u00E9s lectura
J9VM029=\ta (m\u00E8tode desconegut)
VRFY039=Codi de bytes desconegut
SHRC282=La mida de la p\u00E0gina del sistema operatiu \u00E9s incompatible amb aquesta mem\u00F2ria cau. S'est\u00E0 intentant tornar a crear la mem\u00F2ria cau.
J9VM028=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
VRFY038=invokespecial a destinaci\u00F3 no v\u00E0lida
SHRC281=Intentant destruir totes les mem\u00F2ries cau de cacheDir %s
J9VM027=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s)
VRFY037=Objecte desinicialitzat durant la bifurcaci\u00F3 cap enrere
SHRC280=Enumeraci\u00F3 de totes les mem\u00F2ries cau a cacheDir %s
J9VM026=\ta %2$.*1$s.%4$.*3$s (origen desconegut)
VRFY036=Subeiximent de pila
J9VM025=\ta %2$.*1$s.%4$.*3$s (m\u00E8tode nadiu)
VRFY035=Cap error
J9VM024=Excepci\u00F3 al fil "%.*s"\# START NON-TRANSLATABLE
VRFY034=PC de destinaci\u00F3 no v\u00E0lid
J9VM023=Aix\u00F2 pot indicar que JAVA_HOME \u00E9s incorrecte o que les biblioteques de classe no s'han instal\u00B7lat
VRFY033=Camp amb tipus no compatible
J9VM022=Ha fallat el mapatge de pila, resultat \= %p - s'avorta la VM
VRFY032=Receptor erroni per a <init>
J9VM021=Sense mem\u00F2ria per a la correlaci\u00F3 de piles d'int\u00E8rpret - avortant la VM
VRFY031=Intent d'iinc no enter
J9VM020=Cercat a %.*s
VRFY030=Tipus erroni a la pila
SHRC279=Re- crear la mem\u00F2ria cau compartida a l'inici
SHRC278=Tingueu en compte que la utilitat "%s" no pot funcionar en una mem\u00F2ria cau de classe incompatible "%s". Utilitzeu una JVM al nivell correcte.
SHRC277=Per executar la utilitat "%s" en una mem\u00F2ria cau compartida no persistent "%s", tamb\u00E9 heu d'utilitzar la subopci\u00F3 "nonpersistent".
SHRC276=Per executar la utilitat "%s" a la mem\u00F2ria cau de classe persistent "%s", no utilitzeu la subopci\u00F3 "nonpersistent"
SHRC275=Estableix la ubicaci\u00F3 dels fitxers de mem\u00F2ria cau de JVM
SHRC274=S'ha inhabilitat la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per a la mem\u00F2ria cau
SHRC273=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per defecte per a la mem\u00F2ria cau
J9VM019=Error no recuperable\: no es pot trobar ni inicialitzar la classe necess\u00E0ria %.*s
VRFY029=returnAddress no v\u00E0lida per a la instrucci\u00F3 ret
SHRC272=S'ha habilitat correctament tota la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per a la mem\u00F2ria cau
J9VM018=No s'ha pogut assignar mem\u00F2ria a l'agrupaci\u00F3 de taules carregades de la biblioteca compartida
VRFY028=Dimensi\u00F3 err\u00F2nia
SHRC271=Subopci\u00F3 de l'opci\u00F3 mprotect\= no reconeguda
J9VM017=No s'ha pogut assignar mem\u00F2ria per a la matriu d'opcions de la l\u00EDnia d'ordres
VRFY027=El receptor no \u00E9s compatible amb la classe declarant
SHRC270=Configura la protecci\u00F3 de p\u00E0gina de mem\u00F2ria de mem\u00F2ria cau
J9VM016=Error d'aturada a la biblioteca %1$s(%2$d)\: %3$s
VRFY026=EOF inesperat
J9VM015=Error d'inicialitzaci\u00F3 a la biblioteca %1$s(%2$d)\: %3$s
VRFY025=Acc\u00E9s erroni a les dades protegides
J9VM014=Error d'aturada a la funci\u00F3 %1$s(%2$d)\: %3$s
VRFY024=Els arguments no tenen un tipus compatible
J9VM013=Error d'inicialitzaci\u00F3 a la funci\u00F3 %1$s(%2$d)\: %3$s
VRFY023=El par\u00E0metre tableswitch no \u00E9s un enter
J9VM012=No es pot descarregar %1$s\: %2$s
VRFY022=Les subrutines s'han de tornar a fer passar per a cada jsr
J9VM011=No es pot carregar %1$s\: %2$s
VRFY021=S'ha generat un objecte no generable
J9VM010=No s'ha pogut inicialitzar %s
VRFY020=Arguments d'invocaci\u00F3 amb tipus no compatible
SHRC269=El sistema no admet la protecci\u00F3 de p\u00E0gina de mem\u00F2ria
SHRC268=[-Xshareclasses mem\u00F2ria cau d'entrades bootclasspath inhabilitada]
SHRC267=Inhabilita mem\u00F2ria cau de classes bootclasspath
SHRC266=[-Xshareclasses mem\u00F2ria cau de classes transformades de nou habilitada]
SHRC265=Classes de mem\u00F2ria cau que es tornen a transformar a trav\u00E9s de JVMTI
SHRC264=No ajustis les \u00E0rees de mem\u00F2ria cau als l\u00EDmits de la p\u00E0gina
SHRC263=Habilita p\u00E0gines detallades de CompositeCache
J9VM009=Ha fallat J9VMDllMain
VRFY019=La c\u00E0rrega de classes ha fallat
SHRC262=Bytes de dades     \= %d
J9VM008=No es troba J9VMDllMain
VRFY018=S'ha superat la pila m\u00E0xima
SHRC261=Habilita sortida detallada interna de la s\u00E8rie
J9VM007=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres\: %s
VRFY017=<init> no crida aquest <init> o s\u00FAper <init>
SHRC260=No s'ha pogut crear l'agrupaci\u00F3 a ByteDataManager
J9VM006=Opci\u00F3 de l\u00EDnia d'ordres no v\u00E0lida\: %s
VRFY016=El par\u00E0metre de codi de bytes de despla\u00E7ament no \u00E9s un enter
J9VM005=Valor no v\u00E0lid per a la variable d'entorn\: %s
VRFY015=Diversos retorns per a un sol jsr
J9VM004=No s'ha pogut carregar la biblioteca que necessitava\: %s
VRFY014=Codi de bytes de retorn incompatible amb el tipus de retorn
J9VM003=No s'ha trobat el compilador JIT "%s". Es far\u00E0 servir l'int\u00E8rpret.
VRFY013=S'ha violat una restricci\u00F3 de c\u00E0rrega de classes
J9VM002=No s'ha trobat el fitxer d'opcions
VRFY012=Forma de pila incoherent
J9VM001=Valor mal format per -Xservice
VRFY011=El par\u00E0metre lookupswitch no \u00E9s un enter
J9VM000=Valor mal format per IBM_JAVA_OPTIONS
VRFY010=Divrsos jsrs utilitzen un \u00FAnic retorn
SHRC259=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 de Manager
SHRC258=No es pot assignar mem\u00F2ria per a l'entrada de la taula d'aleatoritzaci\u00F3 a Manager
SHRC257=No es pot assignar mem\u00F2ria a l'\u00EDtem de llista enlla\u00E7at al gestor
SHRC256=La mem\u00F2ria cau compartida persistent "%1$s" s'ha eliminat
SHRC255=Error en actualitzar la data de darrera desconnexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides a la sortida de la JVM
SHRC254=Error en establir la longitud del fitxer de mem\u00F2ria cau de classes compartides
SHRC253=Error en escriure la cap\u00E7alera al fitxer de mem\u00F2ria cau de classes compartides
VRFY009=Matriu amb tipus no compatible
SHRC252=Error en cercar al fitxer de mem\u00F2ria cau de classes compartides
VRFY008=L'\u00EDndex de matriu no \u00E9s un enter
SHRC251=No suprimir autom\u00E0ticament mem\u00F2ries cau de diferents buildID
VRFY007=M\u00E8tode final alterat temporalment
SHRC250=No es pot obrir la mem\u00F2ria cau en modalitat de nom\u00E9s lectura donat que encara no s'ha inicialitzat
VRFY006=La mida de matriu nova no \u00E9s un enter
VRFY005=Local amb tipus no compatible
VRFY004=La col\u00B7locaci\u00F3 a la mateixa l\u00EDnia de jsr ha trobat massa jsrs
VRFY003=La classe no cont\u00E9 dades de preverificaci\u00F3
VRFY002=Seq\u00FC\u00E8ncia de codi de bytes no v\u00E0lida
VRFY001=%1$s; classe\=%3$.*2$s, m\u00E8tode\=%5$.*4$s%7$.*6$s
VRFY000=%1$s; classe\=%3$.*2$s, m\u00E8tode\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC249=Error\: modlevel de cap\u00E7alera de fitxer de classes compartides no \u00E9s v\u00E0lid
JNCK100=Consell de JNI a %1$s\: no es pot utilitzar la funci\u00F3 amb objectes empaquetats. Utilitzeu %2$s
SHRC248=Error\: la versi\u00F3 de cap\u00E7alera del fitxer de mem\u00F2ria cau de classes compartides no \u00E9s v\u00E0lida
SHRC247=Error\: el reclam de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides no \u00E9s v\u00E0lid.
SHRC246=S'ha connectat la mem\u00F2ria cau persistent de classes compartides %1$s
SHRC245=Error en mapar el fitxer de mem\u00F2ria cau de classes compartides
SHRC244=Error en obtenir la longitud de fitxer de mem\u00F2ria cau de classes compartides
SHRC243=Error en alliberar el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides
SHRC242=Error en actualitzar l'hora de darrera desconnexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides
SHRC241=Error\: no es pot suprimir el fitxer de mem\u00F2ria cau de classes compartides.
SHRC240=Error\: no es pot adquirir el bloqueig d'escriptura de connexi\u00F3 de fitxer de mem\u00F2ria cau de classes compartides.
EXEX026=\  -jxe <jxeFile>   col\u00B7loca el fitxer jxeFile a la variable classpath i executa la \n                    classe d'inici trobada al fitxer jxeFile.
EXEX025=\u00DAs\:\t%s [-jxe] [opcions] <fitxer_jxe> [args...]
EXEX024=El JXE %s no contenia una classe d'inici.
EXEX023=No s'han pogut inicialitzar les utilitats de JXE.
EXEX022=
EXEX021=
EXEX020=
SHRC239=Error\: no es pot adquirir el bloqueig d'escriptura de cap\u00E7alera del fitxer de mem\u00F2ria cau de classes compartides
SHRC238=Error\: la mem\u00F2ria cau de classes compartides no est\u00E0 connectada.
SHRC599=L'espai lliure de l'\u00E0rea de dades de classe sense processar est\u00E0 malmesa ('inici d'espai lliure'\=%p, 'final d'espai lliure'\=%p, 'mida lliure'\= %lu bytes)
SHRC237=S'ha obert la mem\u00F2ria cau persistent de classes compartides %1$s
SHRC598=L'\u00C0rea de dades de classe sense processar est\u00E0 malmesa perqu\u00E8 la seva mida de %lu \u00E9s superior a la mida de mem\u00F2ria cau total de %lu.
SHRC236=S'ha creat la mem\u00F2ria cau persistent de classes compartides %1$s
SHRC597=-Xshareclasses\:rcdSize\=%u bytes \u00E9s m\u00E9s gran que %u bytes d'espai lliure disponible,- Xshareclasses\:rcdSize\=%u s'utilitzar\u00E0 en el seu lloc.
SHRC235=Error en alliberar el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides
SHRC596=Fes comprovacions addicionals en emmagatzemar i assignar dades de classes fora de l\u00EDnia
SHRC234=Error en adquirir el bloqueig de lectura de connexi\u00F3 de fitxer de mem\u00F2ria cau de classes compartides
SHRC595=Les opcions de la l\u00EDnia d'ordres "%s" i "%s" s\u00F3n incompatibles
SHRC233=Error en crear la cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC594=La subopci\u00F3 Xshareclasses\:cacheRetransformed no \u00E9s compatible amb una mem\u00F2ria cau compartida creada amb la subopci\u00F3 enableBCI
SHRC232=No s'ha pogut crear una mem\u00F2ria cau en modalitat de nom\u00E9s lectura
SHRC593=BCI habilitat      \= false
SHRC231=Error en definir la longitud de fitxer de mem\u00F2ria cau de classes compartides
EXEX019=
SHRC592=BCI habilitat       \= true
SHRC230=Error en inicialitzar la cap\u00E7alera de dades de mem\u00F2ria cau compartides
EXEX018=
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
EXEX017=Error en correlacionar jxe a flash
SHRC590=La subopci\u00F3 "enableBCI" s'ha especificat, per\u00F2 la mem\u00F2ria cau existent no s'ha creat amb la subopci\u00F3 "enableBCI".
EXEX016=Par\u00E0metres jxespace no v\u00E0lids.
EXEX015=Error d'engegada de VM\: sense mem\u00F2ria
EXEX014=Executar %s -help pel seu \u00FAs
EXEX013=Error intern de VM\: no s'ha pogut crear la VM de Java
EXEX012=L'opci\u00F3 -jar no est\u00E0 disponible per aquesta biblioteca de classes
EXEX011=
EXEX010=%s requereix un par\u00E0metre
JDBG021=no es reconeix l'opci\u00F3 de depuraci\u00F3
JDBG020=no es reconeix l'opci\u00F3 de depuraci\u00F3\: '%s'
SHRC229=Error\: el fitxer de mem\u00F2ria cau de classes compartides t\u00E9 una cap\u00E7alera no v\u00E0lida.
SHRC228=Error en actualitzar l'hora de darrera connexi\u00F3 de la mem\u00F2ria cau de classes compartides
SHRC589=Crea la mem\u00F2ria cau amb suport per a la instrumentaci\u00F3 de codi de bytes.
SHRC227=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC588=Error en alliberar el bloqueig de lectura de connexi\u00F3 de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC226=Error en obrir el fitxer de mem\u00F2ria cau de classes compartides
SHRC587=S'ha produ\u00EFt un error en actualitzar l'hora de darrera desconnexi\u00F3 de la mem\u00F2ria cau de classes compartides de diversos convidats
SHRC225=Error en obtenir el cam\u00ED d'acc\u00E9s del fitxer de mem\u00F2ria cau
SHRC586=Error\: la mem\u00F2ria cau de classes compartides de diversos convidats t\u00E9 una cap\u00E7alera no v\u00E0lida
SHRC224=No queda mem\u00F2ria per a la c\u00F2pia local del nom de mem\u00F2ria cau.
SHRC585=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC223=No es poden crear/utilitzar mem\u00F2ries cau de classes compartides perqu\u00E8 no s'admet el bloqueig de fitxers.
SHRC584=Error en adquirir el bloqueig de lectura de connexi\u00F3 de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC222=Les mem\u00F2ries cau de classes compartides persistents no es poden crear/utilitzar perqu\u00E8 el mapatge de mem\u00F2ria no admet les prestacions obligat\u00F2ries.
SHRC583=S'ha produ\u00EFt un error en actualitzar "last detached" per la mem\u00F2ria cau de classes compartides de convidats
SHRC221=Missatge d'error de plataforma\: %1$s
EXEX009=\  -verify          habilita la verificaci\u00F3 de classes.\n  -X               imprimeix l'ajuda d'opcions no est\u00E0ndard.
SHRC582=Error\: no es pot suprimir la mem\u00F2ria cau de classes compartides de visitant
SHRC220=Codi d'error de capa de port \= %1$d
EXEX008=\  -verbose[\:class,gc,stack,sizes]\n                   habilita una sortida verbosa (per defecte\=classe).\n
SHRC581=Error en correlacionar un objecte compartit de diversos convidats
EXEX007=\  -jcl\:<config>[\:opcions]\n                    especifica quina biblioteca compartida de JCL s'ha de fer servir (per ex. cdc, cldc, ...).\n
SHRC580=Error en alliberar el bloqueig de lectura de connexi\u00F3 de mem\u00F2ria cau de classes compartides de diversos convidats
EXEX006=\  -debug\:<opcions> habilita la depuraci\u00F3, l'est\u00E0ndard <opcions>.\n
JDBG019=llista de reubicaci\u00F3 no ordenada %zx
EXEX005=\  -D<prop>\=<val>   estableix el valor d'una propietat del sistema.\n
JDBG018=ignorant l'opci\u00F3 de depuraci\u00F3 no reconeguda
EXEX004=\  -jxespace\:<Adre\u00E7af\u00EDsica>,<grand\u00E0ria>,<Adre\u00E7al\u00F2gica>\n                   correlaciona la regi\u00F3 de la mem\u00F2ria per jxes, (els valors estan en valor hexadecimal).\n  -jxeaddr\:<Adre\u00E7al\u00F2gica>\n                   executa jxe directament des de la mem\u00F2ria, (les adreces estan en valor hexadecimal).
JDBG017=
EXEX003=\  -jxe\:<Fitxerjxe>   executa el fitxer anomenat jxe.
JDBG016=Ha fallat la connexi\u00F3 de la jvm
EXEX002=\n[opcions]\n  -classpath <via d'acc\u00E9s>\n  -cp <via d'acc\u00E9s>       estableix la classpath a <via d'acc\u00E9s>.
JDBG015=Depurar el servidor de respostes
EXEX001=\u00DAs\:\t%s [opcions] -jxe\:<fitxer_jxe> [args...]
JDBG014=no es pot assignar l'agrupaci\u00F3 vm->debuggerClassReferences
EXEX000=\u00DAs\:\t%s [opcions] nom_classe [args...]
JDBG013=no es pot assignar l'agrupaci\u00F3 vm->debuggerReferences
JDBG012=ha fallat j9dbg_init_server
JDBG011=no es pot assignar debugServer
JDBG010=Exemple\: java -Xrunjdwp\:transport\=dt_socket,address\=localhost\:8000\n
SHRC219=[Acc\u00E9s de grup de -Xshareclasses habilitat per a mem\u00F2ries cau noves]
SHRC218=[Mem\u00F2ria cau persistent de -Xshareclasses inhabilitada]
SHRC579=Error inicialitzar la cap\u00E7alera de dades de mem\u00F2ria cau compartida de diversos convidats
SHRC217=[Mem\u00F2ria cau persistent de -Xshareclasses habilitada]
SHRC578=S'ha produ\u00EFt un error en crear cap\u00E7alera a mem\u00F2ria cau de classes compartides de visitant
SHRC216=Crea mem\u00F2ria cau no persistent de classes compartides
SHRC577=No es pot crear una mem\u00F2ria cau compartida de diversos convidats en mode nom\u00E9s de lectura
SHRC215=Crea mem\u00F2ria cau persistent de classes compartides
SHRC576=La mem\u00F2ria cau compartida de diversos convidats no es pot obrir amb acc\u00E9s nom\u00E9s de lectura perqu\u00E8 encara no s'ha inicialitzat
SHRC214=No es pot entrar al mutex de taula de hash de ByteDataManager.
SHRC575=Error en adquirir el bloqueig d'escriptura per a la cap\u00E7alera a mem\u00F2ria cau de classe compartida entre convidats
SHRC213=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ByteDataManagerImpl.
SHRC574=La mem\u00F2ria cau compartida de diversos convidats no es pot localitzar en un sistema de fitxers en xarxa. Seleccioneu "nonpersistent" o un altre cacheDir.
SHRC212=S'estan emmagatzemant les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC573=L'opci\u00F3 de l\u00EDnia d'ordres "- Xshareclasses\:%s" requereix "-Xvirt"
SHRC211=S'estan cercant les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC572=Especificaci\u00F3 de destinaci\u00F3 incorrecta. La destinaci\u00F3 especificada a la cap\u00E7alera de mem\u00F2ria cau \u00E9s\: %s, per\u00F2 s'esperava\: %s.
SHRC210=[Sortida detallada de dades de byte de -Xshareclasses habilitada]
SHRC571=S'ha connectat la mem\u00F2ria cau de diversos convidats de classes compartides %1$s
SHRC570=La mem\u00F2ria cau compartida de diversos convidats "%1$s" s'ha destru\u00EFt
JDBG009=j9methodids\=y|n                 usar els ID del m\u00E8tode j9                n\n
JDBG008=onuncaught\=y|n                  depuraci\u00F3 no captada?          n
JDBG007=onthrow\=<nom excepci\u00F3>        depuraci\u00F3 generada                  none
JDBG006=server\=y|n                      escolta pel depurador?            n
JDBG005=address\=<adre\u00E7a d'escolta/connexi\u00F3> transport espec.                  "localhost\:8888"
JDBG004=transport\=<nom>                 espec. de transport               none
JDBG003=suspend\=y|n                     espera l'engegada?                s
JDBG002=---------------------           -----------                     ------------
JDBG001=Nom i valor d'opci\u00F3             Descripci\u00F3                      Per defecte
JDBG000=-Xrunjdwp \u00FAs\: -Xrunjdwp\:[help]|[<option>\=<valor>, ...]\n
SHRC209=Habilita la sortida detallada de dades de byte
SHRC208=No es pot assignar mem\u00F2ria per a l'agrupaci\u00F3 d'element de taula de hash a CompiledMethodManagerImpl.
SHRC569=S'ha creat la mem\u00F2ria cau de diversos convidats de classes compartides %1$s
SHRC207=No es pot entrar al mutex de taula de hash de ClasspathManager.
SHRC568=Mem\u00F2ria cau de diversos convidats de classes compartides oberta %1$s
SHRC206=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a CompiledMethodManagerImpl.
SHRC567=La mem\u00F2ria cau de classes compartides obertes de diversos convidats %1$s \u00E9s nom\u00E9s de lectura
SHRC205=No s'ha pogut crear un element de taula de hash nou a CompiledMethodManagerImpl.
SHRC566=El reclam de cap\u00E7alera de mem\u00F2ria cau de classe compartides entre convidats no \u00E9s v\u00E0lid
SHRC204=No es pot crear un mutex de taula de hash al gestor de classes compartides.
SHRC565=Crea mem\u00F2ria cau de classes compartides de diversos convidats
SHRC203=No es pot crear una taula de hash al gestor de classes compartides.
SHRC564=[-Xshareclasses mem\u00F2ria cau compartida de diversos convidats habilitada]
SHRC202=No s'han pogut inicialitzar les agrupacions del gestor de classes compartides.
SHRC563=Com obrir una mem\u00F2ria cau en temps real, que no \u00E9s compatible amb aquesta JVM, utilitzeu l'opci\u00F3 -Xrealtime JVM per accedir a aquesta mem\u00F2ria cau
SHRC201=\ S'ha substitu\u00EFt correctament %2$.*1$s.
SHRC562=Lectura de dades malmeses per a la cap\u00E7alera d'entrada de mem\u00F2ria cau 0x%p (longitud d'element no v\u00E0lida de %u bytes)
SHRC200=\ S'ha trobat %2$.*1$s.
SHRC561=No s'ha pogut inicialitzar la mem\u00F2ria cau de classes compartides, no hi ha prou espai al sistema de fitxers. Bytes d'espai lliure de disc disponibles \= %lld, bytes sol\u00B7licitats \= %lld.
SHRC560=El nom de la mem\u00F2ria cau interna no \u00E9s adequat.
SHRC559=No s'ha pogut crear el directori "%s" per a la mem\u00F2ria cau de classes compartides
SHRC558=Opcions disponibles per a -Xshareclasses\:printStats\=<opcions>. Utilitzeu '+' per especificar diverses opcions. \u00C9s a dir, printstats\=aot+url \n
SHRC557=Subopci\u00F3 no reconeguda per a l'opci\u00F3 printstats\= . Utilitzeu printstats\=help per veure les opcions disponibles.
SHRC556=Imprimir el resum de les estad\u00EDstiques de la mem\u00F2ria cau. Utilitzeu printstats\=help per veure les opcions disponibles.
SHRC555=La mem\u00F2ria cau nom\u00E9s cont\u00E9 classes amb n\u00FAmeros de l\u00EDnia i classes sense n\u00FAmeros de l\u00EDnia
SHRC554=La mem\u00F2ria cau nom\u00E9s cont\u00E9 classes sense n\u00FAmeros de l\u00EDnia
SHRC553=La mem\u00F2ria cau nom\u00E9s cont\u00E9 classes amb n\u00FAmeros de l\u00EDnia
SHRC552=No es pot assignar la mida de bloc sol\u00B7licitada per a la mem\u00F2ria cau "%s". Bytes disponibles \= %d, Bytes sol\u00B7licitats \= %d
SHRC551=La mem\u00F2ria cau "%s" est\u00E0 marcada com a plena. No s'ha pogut assignar la mida de bloc \= %d.
SHRC550=Falta l'indicador execuci\u00F3 ROUND_TO_PAGE_SIZE. -Xshareclasses\:checkStringTableReset requereix que la taula de cadenes s'arrodoneixi a la mida de la p\u00E0gina.
SHRC549=-Xshareclasses\:checkStringTableReset pot donar error. La taula de cadenes no \u00E9s prou gran. Ha de ser m\u00E9s gran que la mida d'una p\u00E0gina del sistema operatiu. Mida de la taula \= %d, Mida de la p\u00E0gina \= %d
SHRC548=For\u00E7ar la comprovaci\u00F3 de reinici de la taula de cadenes quan estigui marcada com a malmesa.
SHRC547=No es pot assignar mem\u00F2ria per a la matriu de car\u00E0cters a shrinit
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC535=\t bytedata     Imprimeix tota la resta de tipus de bytedata a la mem\u00F2ria cau compartida.
SHRC534=\t jcl               Imprimeix nom\u00E9s els tipus jcl a la mem\u00F2ria cau compartida.
SHRC533=\t aotdata       Imprimeix nom\u00E9s els tipus aotdata a la mem\u00F2ria cau compartida.
SHRC532=\t aotthunk     Imprimeix nom\u00E9s els tipus aotthunk a la mem\u00F2ria cau compartida.
SHRC531=\t aotch           Imprimeix nom\u00E9s els tipus aotch a la mem\u00F2ria cau compartida.
SHRC530=\t jithint       Imprimeix nom\u00E9s els tipus jithint a la mem\u00F2ria cau compartida.
DUMP042=S'ha rebut un senyal d'avortament mentre s'executava a la pila Java. No s'han pogut executar els agents d'abocament de mem\u00F2ria de JVM.
DUMP041=\u00DAs incorrecte de -Xdump msg_filter
DUMP040=%1$s abocament de mem\u00F2ria escrit als conjunts de dades mitjan\u00E7ant la plantilla de nom %2$s
SHRC529=\t orphan         Imprimeix nom\u00E9s els tipus orphan a la mem\u00F2ria cau compartida.
SHRC528=\t extra           Imprimeix tots els tipus privats seg\u00FCents a la mem\u00F2ria cau compartida.
SHRC527=\t zipcache     Imprimeix nom\u00E9s els tipus zipcache a la mem\u00F2ria cau compartida.\n
SHRC526=\t jitprofile Imprimeix nom\u00E9s els tipus jitprofile a la mem\u00F2ria cau compartida.
SHRC525=\t aot               Imprimeix nom\u00E9s els tipus aot a la mem\u00F2ria cau compartida.
SHRC524=\t rommethod   Imprimeix nom\u00E9s els tipus rommethod a la mem\u00F2ria cau compartida.
SHRC523=\t romclass     Imprimeix nom\u00E9s els tipus romclass a la mem\u00F2ria cau compartida.
SHRC522=\t token           Imprimeix nom\u00E9s els tipus token a la mem\u00F2ria cau compartida.
DUMP039=S'est\u00E0 processant la incid\u00E8ncia d'abocament de mem\u00F2ria "%1$s", detall "%3$.*2$s" a %4$s - espereu.
SHRC521=\t url               Imprimeix nom\u00E9s els tipus url a la mem\u00F2ria cau compartida.
DUMP038=L'abocament de mem\u00F2ria breu no s'ha escrit perqu\u00E8 s'estava obtenint una tra\u00E7a al fitxer\: %1$s
SHRC520=\t classpath   Imprimeix nom\u00E9s els tipus classpath a la mem\u00F2ria cau compartida.
DUMP037=Error a l'abocament de mem\u00F2ria de %1$s\: %2$s ha fallat, codi d'error\: %3$d
DUMP036=Falta un filtre de -Xdump o el filtre no \u00E9s v\u00E0lid
DUMP035=L'usuari ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s per mitj\u00E0 de %2$s
DUMP034=L'usuari ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s amb '%2$s' per mitj\u00E0 de %3$s
DUMP033=La JVM ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s en resposta a una incid\u00E8ncia.
DUMP032=La JVM ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s amb '%2$s' en resposta a una incid\u00E8ncia.
DUMP031=El heapdump sol\u00B7licitat no s'ha generat perqu\u00E8 no s'ha sol\u00B7licitat el bloqueig exclusiu de VM. Afegeiu request\=exclusive+prepwalk+compact a l'opci\u00F3 de l\u00EDnia d'ordres -Xdump\:heap\:.
DUMP030=No es pot escriure l'abocament de mem\u00F2ria al fitxer %s\: %s
SHRC519=\t all               Imprimeix tots els tipus seg\u00FCents a la mem\u00F2ria cau compartida.
SHRC518=Opcions disponibles per a -Xshareclasses\:printAllStats\=<options>. Utilitzeu '+' per especificar diverses opcions. \u00C9s a dir, printallstats\=aot+url \n
SHRC517=Subopci\u00F3 no reconeguda per a l'opci\u00F3 printallstats\= . Utilitzeu printallstats\=help per veure les opcions disponibles.
SHRC516=Llista tots els elements de la mem\u00F2ria cau per defecte. Utilitzeu printallstats\=help per veure les opcions disponibles.
SHRC515=No s'ha pogut obtenir el directori de mem\u00F2ria cau per defecte.
SHRC514=Valor no v\u00E0lid per a l'opci\u00F3 cacheDirPerm. Ha de ser un perm\u00EDs de fitxer d'estil unix de l'interval 0700 - 0777 o 1700 - 1777 (en representaci\u00F3 octal).
SHRC513=Defineix els permisos d'estil unix per crear directoris de mem\u00F2ria cau
SHRC512=no hi ha dades a la mem\u00F2ria cau
DUMP029=La sol\u00B7licitud de prepwalk o compact abans de fer un abocament de mem\u00F2ria del sistema s'ignorar\u00E0 perqu\u00E8 no s'ha sol\u00B7licitat el bloqueig exclusiu de VM.
SHRC511=La mem\u00F2ria cau composta t\u00E9 un valor d'indicador d'inicialitzaci\u00F3 erroni. El valor de ccInitComplete \u00E9s %lu
DUMP028=El bloqueig exclusiu de VM no s'ha pogut adquirir abans de fer l'abocament de mem\u00F2ria del sistema.
SHRC510=Inhabilita la creaci\u00F3 d'abocaments de mem\u00F2ria a mem\u00F2ries cau malmeses
DUMP027=El heapdump sol\u00B7licitat no s'ha generat perqu\u00E8 un altre component cont\u00E9 el bloqueig exclusiu de VM.
DUMP026=El nom d'IEATDUMP supera la longitud m\u00E0xima permesa. S'utilitzar\u00E0 el nom per defecte.
DUMP025=Error d'IEATDUMP per al DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=S'han sol\u00B7licitat diversos heapdumps, per\u00F2 falta %%id a l'etiqueta de fitxer\: els abocaments de mem\u00F2ria se sobrescriuran.
DUMP023=La preparaci\u00F3 d'emmagatzematge din\u00E0mic sol\u00B7licitada no s'ha efectuat perqu\u00E8 no s'ha sol\u00B7licitat acc\u00E9s exclusiu o no s'ha pogut obtenir.
DUMP022=La compactaci\u00F3 d'emmagatzematge din\u00E0mic sol\u00B7licitada no s'ha efectuat perqu\u00E8 no s'ha sol\u00B7licitat acc\u00E9s exclusiu o no s'ha pogut obtenir.
DUMP021=El heapdum sol\u00B7licitat no s'ha generat perqu\u00E8 no s'ha sol\u00B7licitat acc\u00E9s exclusiu o no s'ha pogut obtenir.
DUMP020=L'abocament de mem\u00F2ria de %s s'ha escrit
SHRC509=Crea una mem\u00F2ria cau d'una generaci\u00F3 anterior a la generaci\u00F3 actual.
SHRC508=S'ha adquirit un sem\u00E0for diferent del sem\u00E0for que s'utilitzava abans amb aquesta mem\u00F2ria cau. ID de sem\u00E0for antic\=%d, ID de sem\u00E0for nou\=%d
SHRC507=Fes comprovacions addicionals en emmagatzemar i assignar dades de depuraci\u00F3 de classes
SHRC506=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 la seva mida de %lu \u00E9s superior a la mida de mem\u00F2ria cau total de %u emmagatzemada a la cap\u00E7alera de la mem\u00F2ria cau
SHRC505=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 l'espai lliure de l'adre\u00E7a superior %p menys l'espai lliure de l'adre\u00E7a inferior %p sobrepassa la mida de regi\u00F3 de depuraci\u00F3 de %lu bytes
SHRC504=L'inici de dades de la mem\u00F2ria cau \u00E9s nul. Inici de dades\: %p
SHRC503=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 l'emmagatzematge de %d bytes de la taula de nombres de l\u00EDnia i de %d bytes de la taula de variables locals donar\u00E0 lloc a %p dades de taula de nombres de l\u00EDnia de l'adre\u00E7a superior, que \u00E9s superior a les %p dades de la taula de variables locals de l'adre\u00E7a superior
SHRC502=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 les dades de taula de variables locals de l'adre\u00E7a inferior %p s\u00F3n superiors a les de l'adre\u00E7a superior %p
DUMP019=La JVM est\u00E0 sol\u00B7licitant un abocament de mem\u00F2ria de %s
SHRC501=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 les dades de taula de nombres de l\u00EDnia de l'adre\u00E7a inferior %p s\u00F3n superiors a les de l'adre\u00E7a superior %p
DUMP018=L'esdeveniment sol\u00B7licitat no est\u00E0 disponible\: executeu-lo amb l'indicador -Xdump\:dynamic
SHRC500=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 l'espai lliure de l'adre\u00E7a inferior %p \u00E9s superior a l'espai lliure de l'adre\u00E7a superior %p
DUMP017=Avortant\: No es pot comprimir el fitxer (%s)
DUMP016=Avortant\: No es pot crear el fitxer (%s)
DUMP015=Avortant\: No es pot obrir o llegir (%s)
DUMP014=Acci\u00F3 de VM no reconeguda\: ...%s
DUMP013=S'ha processat la incid\u00E8ncia d'abocament de mem\u00F2ria "%1$s", detall "%3$.*2$s".
DUMP012=Error a l'abocament de mem\u00F2ria de %1$s\: %2$s
DUMP011=L'abocament de mem\u00F2ria de %1$s ha creat el proc\u00E9s %2$d
DUMP010=L'abocament de mem\u00F2ria de %1$s s'ha escrit a %2$s
EXEL111=\  -XX\:+StoreIntermediateClassfile   emmagatzema dades de classe sense processar que s'utilitzen durant la retransformaci\u00F3
EXEL110=\  -XX\:ShareClassesDisableBCI   crea la mem\u00F2ria cau de classes compartides amb suport per a la instrumentaci\u00F3 de codi de byte
DUMP009=Abocament de mem\u00F2ria de %s no disponible
DUMP008=\u00FAs de '%s'
DUMP007=La JVM est\u00E0 sol\u00B7licitant l'abocament de mem\u00F2ria de %1$s amb '%2$s'
DUMP006=S'est\u00E0 processant la incid\u00E8ncai d'abocament de mem\u00F2ria "%1$s", detall "%3$.*2$s"; espereu, si us plau.
DUMP005=Falta una eina externa
DUMP004=Falta el nom de fitxer
DUMP003=Agent d'abocament de mem\u00F2ria no reconegut\: %s
DUMP002=Testimoni no reconegut\: %%%1$c
DUMP001=Incid\u00E8ncia d'abocament de mem\u00F2ria no reconeguda\: ...%s
DUMP000=Opci\u00F3 d'abocament de mem\u00F2ria no reconeguda\: -Xdump\:%s
TNNT004=Fitxer tenant.properties mal format (%1$s). No es pot descodificar la clau necess\u00E0ria\='%2$s' valor\='%3$s'
TNNT003=Fitxer tenant.properties mal format, (%1$s) hi falta la clau necess\u00E0ria (%2$s)
TNNT002=No s'ha pogut llegir el fitxer de propietats d'a\u00EFllament necessari (%1$s)
TNNT001=No s'ha pogut assignar mem\u00F2ria per a l'iniciador de l'inquil\u00ED
EXEL109=\  -XX\:ShareClassesEnableBCI   crea la mem\u00F2ria cau de classes compartides amb suport per a la instrumentaci\u00F3 de codi de bytes
TNNT000=Suport d'inquil\u00ED habilitat.
EXEL108=\  -Xzero\:nosharebootzip no compartir les mem\u00F2ries cau d'entrades jar bootstrap a la mem\u00F2ria cau de classes compartides
EXEL107=\  -Xscmaxjitdata<x>   estableix l'espai m\u00E0xim de mem\u00F2ria cau de classes compartida perm\u00E8s per a dades JIT en <x>
EXEL106=\  -Xscminjitdata<x>   estableix l'espai m\u00EDnim de mem\u00F2ria cau de classe compartida reservat per a dades JIT en <x>
EXEL105=\  -Xscmaxjit<x>   estableix l'espai m\u00E0xim de mem\u00F2ria cau de classes compartida perm\u00E8s per a dades JIT en <x>
EXEL104=\  -Xscminjit<x>   estableix l'espai m\u00EDnim de mem\u00F2ria cau de classe compartida reservat per a dades JIT en <x>
EXEL103=\  -Xscdmx<x>      estableix la mida de l'\u00E0rea d'atributs de depuraci\u00F3 de la mem\u00F2ria cau de classes compartides en <x>
EXEL102=\n  -Xdiagnosticscollector habilita el col\u00B7lector de diagn\u00F2stics
EXEL101=\n  -Xhealthcenter  habilita l'agent del Health Center
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj habilita el temps real lleu
CFRE099=Modificadors de m\u00E8tode no permesos
CFRE098=La signatura de variable local ha de ser una cadena
CFRE097=Entrada de classe interna duplicada a l'atribut InnerClasses
CFRE096=Destinaci\u00F3 no de instrucci\u00F3 al codi de bytes de switch
CFRE095=Les anotacions han de ser interf\u00EDcies
CFRE094=El codi de bytes d0instanceof ha de fer referneica a una classe
CFRE093=El m\u00E8tode pot ser, com a molt, p\u00FAblic, privat o protegit
CFRE092=Signatura no v\u00E0lida
CFRE091=El PC d'inici de gestor d'excepcions no \u00E9s una instrucci\u00F3
CFRE090=El codi de bytes nou no pot crear matrius
CFRE089=S'espera un nom i un tipus
CFRE088=El nom de variable local ha de ser una cadena
CFRE087=El codi de bytes de m\u00E8tode d'interf\u00EDcie ha de fer refer\u00E8ncia a una InterfaceMethodref
CFRE086=El m\u00E8tode t\u00E9 dos atributs Code
CFRE085=El nom intern ha de ser una cadena
CFRE084=Cap error
CFRE083=La classe \u00E9s abstracta i final
CFRE082=\u00C9s possible que el m\u00E8tode <init> no sigui est\u00E0tic, final, sincronitzat, natiu o abstracte
CFRE081=El fitxer d'origen ha de ser UTF8
CFRE080=La signatura de m\u00E8tode no \u00E9s v\u00E0lida
CFRE079=El PC de gestor d'excepcions no \u00E9s v\u00E0lid
CFRE078=L'\u00EDndex de classes de m\u00E8tode de tancament ha de fer refer\u00E8ncia a una classe
CFRE077=Les interf\u00EDcies han de ser abstractes
CFRE076=N\u00FAmero m\u00E0gic incorrecte
CFRE075=Signatura de variable local no v\u00E0lida
CFRE074=No s'ha especificat cap atribut Code
CFRE073=S'ha trobat l'atribut StackMap/StackMapTable fora de l'atribut Code
CFRE072=Entrades no ordenades al cody de bytes de lookupswitch
CFRE071=La matriu de codis de bytes \u00E9s buida
CFRE070=PC de n\u00FAmero de l\u00EDnia no v\u00E0lid
CFRE069=La longitud de l'atribut \u00E9s superior a les dades dels atributs
CFRE068=El nom de classe no \u00E9s v\u00E0lid
CFRE067=Etiqueta d'entrada d'agrupaci\u00F3 de constants
CFRE066=Diversos atributs InnerClasses
CFRE065=Diversos atributs de m\u00E8tode de tancament
CFRE064=El descriptor ha de ser una cadena UTF8
CFRE063=El codi de bytes d'invoke crida un m\u00E8tode no v\u00E0lid
CFRE062=Els locals m\u00E0xims s\u00F3n m\u00E9s petits que la mida dels arguments
CFRE061=El nom ha de ser una cadena UTF8
CFRE060=El PC final de gestor d'excepcions no \u00E9s una instrucci\u00F3 ni el final de la matriu de codis de bytes
CFRE059=El PC de gestor d'excepcions no \u00E9s una instrucci\u00F3
CFRE058=L'\u00EDndex de variables local est\u00E0 fora de l'interval al retorno de subrutina
CFRE057=El tipus de gestor d'excepcions ha de ser una classe
CFRE056=Recompte incorrecte d'arguments de codi de bytes d'invokeinterface
CFRE055=El PC final de gestor d'excepcions no \u00E9s v\u00E0lid
CFRE054=El codi de bytes de camp ha de fer refer\u00E8ncia a Fieldref
CFRE053=El m\u00E8tode t\u00E9 me\u00B4s de 255 ranures d'argument
CFRE052=La cadena externa ha de ser una classe
CFRE051=La constant de cadena ha de ser una cadena
CFRE050=El m\u00E8tode d'interf\u00EDcie ha de ser p\u00FAblic i abstracte
J9TI067=Cancel\u00B7la una subscripci\u00F3 als punts de rastreig de la VM
J9TI066=Crea una subscripci\u00F3 als punts de rastreig de la MV
J9TI065=La funci\u00F3 d'inicialitzaci\u00F3 de l'agent %s no s'ha trobat a la biblioteca %s
J9TI064=La funci\u00F3 d'inicialitzaci\u00F3 de l'agent %s ha fallat per a la biblioteca %s, codi de retorn %d
J9TI063=Obt\u00E9n el punter J9Method des de JMethodID
J9TI062=Obt\u00E9n el punter J9VMThread des d'un jthread
J9TI061=Cancel\u00B7la una subscripci\u00F3 amb registres de recollida de deixalles detallada
J9TI060=Crea una subscripci\u00F3 amb registres de recollida de deixalles detallada
CFRE049=El codi de bytes de checkcast ha de fer refer\u00E8ncia a una classe
CFRE048=L'\u00EDndex de variables local est\u00E0 fora de l'interval al magatzem
CFRE047=La classe d'interf\u00EDcie nom\u00E9s pot ser p\u00FAblica, abstracta o anotaci\u00F3
CFRE046=Farciment de codi de bytes de switch incorrecte
CFRE045=L'\u00EDndex d'agrupacions de constants est\u00E0 fora de l'interval
CFRE044=El codi de bytes d'invokeinterface ha reservat una ranura no zero
CFRE043=El codi de bytes no es pot eixamplar
CFRE042=La mida de la matriu de codi de bytes \u00E9s superior a 65535
CFRE041=Versi\u00F3 secund\u00E0ria err\u00F2nia
CFRE040=La longitud de l'atribut \u00E9s inferior a les dades dels atributs
J9TI059=Obt\u00E9 la quantitat de mem\u00F2ria nativa utilitzada per la JVM, desglossada en categories de mem\u00F2ria.
J9TI058=No s'han pogut definir les opcions de registre de la JVM.
J9TI057=No s'ha pogut convertir la s\u00E8rie nativa de les opcions de registre de la JVM.
J9TI056=No s'han pogut consultar les opcions de registre de la JVM.
J9TI055=No s'ha pogut assignar mem\u00F2ria interm\u00E8dia per a les opcions de registre de la JVM.
J9TI054=Sol\u00B7licita un abocament de mem\u00F2ria del Java Lock Monitor (JLM) amb un especificador de format.
J9TI053=Defineix les opcions de registre de VM.
J9TI052=Consulta les opcions de registre de VM actuals.
J9TI051=Esborra un indicador per m\u00E8tode per a la notificaci\u00F3 selectiva d'entrada i sortida
J9TI050=Obt\u00E9 un codi de hash de supervisor d'un objecte
RCMT000=Gesti\u00F3 de recursos habilitada.
CFRE039=L'\u00EDndex de variables local est\u00E0 fora de l'interval a la c\u00E0rrega
CFRE038=El m\u00E8tode t\u00E9 dos atributs Exceptions
CFRE037=Temp cont\u00E9 un tipus incorrecte
CFRE036=Destinaci\u00F3 no de instrucci\u00F3 al codi de bytes de jump
CFRE035=El codi de bytes nou ha de fer refer\u00E8ncia a una classe
CFRE034=Codi de bytes incomplet
CFRE033=L'interval del gestor d'exepcions \u00E9s buit
CFRE032=La superclasse de la interf\u00EDcie ha de ser java.lang.Object
CFRE031=L'excepci\u00F3 generada ha de ser una classe
CFRE030=Superclasse nul\u00B7la
J9TI049=Torna els noms de classe, m\u00E8tode i paquet d'un conjunt de punters de m\u00E8tode de RAM
J9TI048=Obt\u00E9 metadades de tra\u00E7a que es poden utilitzar amb el formatador per processar mem\u00F2ries interm\u00E8dies de tra\u00E7a
J9TI047=Tots els registres de tra\u00E7a en \u00FAs es desactiven i es passen als suscriptors de tra\u00E7a
J9TI046=Cancel\u00B7la una subscripci\u00F3 amb registres de tra\u00E7a externs
J9TI045=Crea una subscripci\u00F3 amb registres de tra\u00E7a externs
J9TI044=Suprimeix totes les etiquetes d'objecte.
J9TI043=Assenyala la c\u00E0rrega de classes nom\u00E9s per a les classes de matriu.
J9TI042=Assenyala les etiquetes autom\u00E0tiques per a l'objecte acabat d'assignar i la seva classe.
J9TI041=Assenyala la incid\u00E8ncia reanomenada d'objecte(s) (despla\u00E7ada o suprimida).
J9TI040=Afegeix la prestaci\u00F3 ampliada can_autotag_objects.
CFRE029=El codi de bytes de multianewarray ha de fer refer\u00E8ncia a una classe
CFRE028=El codi de bytes de ldc* ha de fer refer\u00E8ncia a una constant
CFRE027=El codi de bytes de multianewarray ha de fer refer\u00E8ncia a una classe de matriu
CFRE026=No s'ha reconegut el tipus de codi de bytes de newarray
CFRE025=El camp t\u00E9 dos atributs ConstantValue
CFRE024=El nom de classe ha de ser una cadena
CFRE023=Agrupaci\u00F3 de constants buida
CFRE022=thisClass ha de ser una classe
CFRE021=Camp duplicat
CFRE020=El PC d'inici de gestor d'excepcions no \u00E9s v\u00E0lid
J9TI039=Destrueix una mem\u00F2ria cau compartida indicada.
J9TI038=Itera les mem\u00F2ries cau compartides.
J9TI037=Obt\u00E9 la mem\u00F2ria total d'emmagatzematge din\u00E0mic.
J9TI036=Obt\u00E9 la mem\u00F2ria lliure d'emmagatzematge din\u00E0mic actual.
J9TI035=El cicle de recollida de deixalles ha finalitzat.
J9TI034=El cicle de recollida de deixalles s'ha iniciat.
J9TI033=Restableix les opcions d'abocament de mem\u00F2ria de VM.
J9TI032=Indica que un fil ha processat la incid\u00E8ncia as\u00EDncrona
J9TI031=Cancel\u00B7la la incid\u00E8ncia as\u00EDncrona en un sol fil o a tots els fils
J9TI030=Assenyala la incid\u00E8ncia as\u00EDncrona en un sol fil o a tots els fils
CFRE019=Inici de PC de variable local no v\u00E0lid
CFRE018=La classe interna ha de ser una classe
CFRE017=Diversos atributs StackMap/StackMapTable
CFRE016=L'\u00EDndex de variables local est\u00E0 fora de l'interval a l'increment
CFRE015=Les interf\u00EDcies han de ser classes
CFRE014=S'ha especificat un atribut de codi per a un m\u00E8tode natiu o abstracte
CFRE013=Longitud de PC de variable local no v\u00E0lida
CFRE012=El valor constant ha de ser un valor
CFRE011=El codi de bytes d'anewarray ha de fer refer\u00E8ncia a una classe
CFRE010=Recompte negatiu per als parells de coincid\u00E8ncia i despla\u00E7ament al codi de bytes de lookupswitch
J9TI029=Consulta la configuraci\u00F3 d'agent d'abocament de mem\u00F2ria de RAS.
J9TI028=Notifica el final d'un abocament de mem\u00F2ria de RAS.
J9TI027=Notifica l'inici d'un abocament de mem\u00F2ria de RAS.
J9TI026=Activa un abocament de mem\u00F2ria amb la configuraci\u00F3 de RAS indicada.
J9TI025=Permet la JNI directe en pres\u00E8ncia d'incid\u00E8ncies d'entrada i sortida de m\u00E8tode (cosa que pot fer que es notifiquin de forma inacurada entrades i sortides)
J9TI024=Sortida de m\u00E8tode sense el valor de retorn.
J9TI023=Obt\u00E9 la informaci\u00F3 de marc ampliada per a una llista de fils.
J9TI022=Obt\u00E9 la informaci\u00F3 de marc ampliada per a totes les traces de pila.
J9TI021=Obt\u00E9 la informaci\u00F3 de marc ampliada
J9TI020=Obt\u00E9 un fil de sistema d'operatiu d'un jthread
CFRE009=El camp d'interf\u00EDcie ha de ser est\u00E1tic p\u00FAblic i final
CFRE008=El valor alt \u00E9s m\u00E9s petit que el valor baix al codi de bytes de tableswitch
CFRE007=La signatura de camp no \u00E9s v\u00E0lida
CFRE006=Atribut StackMap/StackMapTable no v\u00E0lid
CFRE005=Interf\u00EDcie duplicada
CFRE004=Codi de bytes desconegut
JVMP000=S'ha intentat instrumentalitzar %.*s a trav\u00E9s de JVMPI i no estava autoritzat.
JNCK099=Error de JNI a %1$s\: l'argument \#%2$d necessita un tipus sense matriu
CFRE003=Versi\u00F3 principal incorrecta
JNCK098=Error de JNI a %1$s\: l'argument \#%2$d espera %3$s %4$s, l'argument real \u00E9s %5$s %6$s
CFRE002=El nom del m\u00E8tode no \u00E9s v\u00E0lid
JNCK097=\tadvice         visualitza suggeriments
CFRE001=%1$s; classe\=%3$.*2$s, despla\u00E7ament\=%4$u
JNCK096=\twarn           visualitza advertiments
CFRE000=%1$s; classe\=%3$.*2$s, m\u00E8tode\=%5$.*4$s%7$.*6$s, pc\=%8$u
JNCK095=Error de JNI al valor tornat\: el tipus de retorn \u00E9s una refer\u00E8ncia, per\u00F2 el valor (0x%1$p) no \u00E9s una refer\u00E8ncia d'objecte v\u00E0lida. El seu tipus \u00E9s\: %2$s
JNCK094=Error de JNI a %1$s\: les dades a les quals apunta l'argument \#%2$d s'han modificat durant l'execuci\u00F3 de %3$s. \u00C9s possible que un altre fil o una crida imbricada hagi modificat les dades. El resultat de %4$s pot ser incorrecte i \u00E9s possible que la VM sigui inestable.
JNCK093=Error JNI a %s\: el m\u00E8tode no \u00E9s un constructor
J9TI019=Defineix el mode de notificaci\u00F3 per a les incid\u00E8ncies ampliades, cosa que permet la selectivitat de nivell de fil
JNCK092=\tvalist         comprova la reutilitzaci\u00F3 de va_list
J9TI018=Defineix un m\u00E8tode per a la notificaci\u00F3 selectiva d'entrada i sortida.
JNCK091=S'ha detectat un suggeriment al marc de gestor d'una incid\u00E8ncia de JVMPI o JVMTI.\n
J9TI017=Controla diverses opcions de VM i compilaci\u00F3.
JNCK090=S'ha detectat un advertiment al marc de gestor d'una incid\u00E8ncia de JVMPI o JVMTI.\n
J9TI016=Permet la col\u00B7locaci\u00F3 a la mateixa l\u00EDnia en pres\u00E8ncia d'incid\u00E8ncies d'entrada i sortida de m\u00E8tode (cosa que pot fer que es notifiquin de forma inacurada entrades i sortides)
J9TI015=Sol\u00B7licita un abocament de mem\u00F2ria del Java Lock Monitor (JLM).
J9TI014=Controla el Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI013=Permet les crides de retorn per a les assignacions instrumentables (les notificades per VMObjectAlloc).
J9TI012=Afegir una opci\u00F3 -Xdump din\u00E0mica
J9TI011=Afegir una opci\u00F3 -Xtrace din\u00E0mica
J9TI010=Entrada de m\u00E8tode amb informaci\u00F3 ampliada sobre el tipus de m\u00E8tode.
JNCK089=S'ha detectat un error al marc de gestor d'una incid\u00E8ncia de JVMPI o JVMTI.\n
JNCK088=Advertiment de JNI a %1$s\: l'argument \#%2$d \u00E9s una refer\u00E8ncia feble. Una refer\u00E8ncia feble pot esdevenir nul\u00B7la en qualsevol moment. La refer\u00E8ncia s'ha de promoure amb NewLocalRef o NewGlobalRef i, tot seguit, s'ha de comparar amb NULL abans de cridar %3$s.
JNCK087=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s un java/lang/reflect/Method ni un java/lang/reflect/Constructor
JNCK086=Advertiment de JNI a %1$s\: l'argument \#%2$d no \u00E9s un a java/nio/Buffer. %3$s tornar\u00E0 un codi d'error.
JNCK085=Suggeriment detectat a JNI_OnLoad de la biblioteca %.*s\n
JNCK084=Av\u00EDs detectat a JNI_OnLoad de la biblioteca %.*s\n
JNCK083=Error detectat a JNI_OnLoad de la biblioteca %.*s\n
J9TI009=Indica el final d'una fase de compilaci\u00F3 JIT. (No hi ha la seguretat de crida de retorn)
JNCK082=Suggeriment detectat al marc m\u00E9s extrem d'un fil connectat\n
J9TI008=Indica l'inici d'una fase de compilaci\u00F3 JIT. (No hi ha la seguretat de crida de retorn)
JNCK081=Av\u00EDs detectat al marc m\u00E9s extrem d'un fil connectat\n
J9TI007=Obtenir el conjunt actual de possibilitats ampliades mitjan\u00E7ant capabilities_ptr.
JNCK080=Error detectat al marc m\u00E9s extrem d'un fil connectat\n
J9TI006=Renunciar a les possibilitats ampliades de capabilities_ptr.
J9TI005=Afegir les noves possibilitats ampliades des de capabilities_ptr.
J9TI004=Torna mitjan\u00E7ant les possibilitats capabilities_ptr ampliades disponibles en aquest moment.
J9TI003=Agent_OnLoad ha fallat per la biblioteca %s
J9TI002=Agent_OnLoad no s'ha trobat a la biblioteca %s
J9TI001=No s'ha pogut obrir la biblioteca d'agent %1$s (%2$s)
J9TI000=Sense mem\u00F2ria s'ha intentat carregar un agent de la biblioteca %s
JNCK079=S'ha detectat un suggeriment a %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK078=S'ha detectat un advertiment a %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK077=S'ha detectat un error a %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK076=Error intern de jnichk a %s\: mem\u00F2ria insuficient
JNCK075=Error de jnichk intern a %1$s\: no es reconeix el descriptor 0x%2$x
JNCK074=Suggeriment JNI a %s\: El buffer sembla no haver estat modificat. Considereu la possibilitat d'utilitzar JNI_ABORT en lloc de mode 0.
JNCK073=Suggeriment de JNI a %1$s\: s'ha especificat JNI_ABORT, per\u00F2 no es pot respectar perqu\u00E8 s'han modificat les dades.\n(CRC original\=0x%2$x, CRC nou\=0x%3$x).\nCom que %4$s ha tornat el contingut real de la matriu, els canvis no es descartaran. Probablement no \u00E9s el que voleu.
JNCK072=Suggeriment de JNI a %1$s\: s'ha especificat JNI_COMMIT, per\u00F2 s'ignorar\u00E0. \nCom que %2$s ha tornat el contingut real de la matriu, la mem\u00F2ria interm\u00E8dia no ser\u00E0 v\u00E0lida despr\u00E9s d'aquesta crida. Probablement no \u00E9s el que voleu.
JNCK071=Advertiment de JNI\: la mem\u00F2ria a 0x%1$p adquirida per %2$s no s'ha alliberat abans de tornar de la nativa. Probablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
JNCK070=Advertiment de JNI a %1$s\: les dades de la matriu original s'han modificat entre %2$s i %3$s.\n(CRC original\=0x%4$x, CRC nou\=0x%5$x).\nCom que %6$s ha tornat una c\u00F2pia del contingut de la matriu, es perdr\u00E0 el nou contingut.
JNCK069=Advertiment de JNI a %1$s\: el final est\u00E0 fora de l'interval (%2$d + %3$d > %4$d)
JNCK068=Advertiment de JNI a %1$s\: l'inici o l'\u00EDndex est\u00E0 fora de l'interval (%2$d >\= %3$d)
JNCK067=Advertiment de JNI a %1$s\: s'ha especificat una longitud de regi\u00F3 negativa (%2$d)
JNCK066=Advertiment de JNI a %1$s\: s'ha especificat un inici o un \u00EDndex negatiu (%2$d)
JNCK065=Advertiment de JNI a %1$s\: la capacitat d'agrupaci\u00F3 de marc de refer\u00E8ncia local ha augmentat autom\u00E0ticament de %2$d a %3$d. Hi ha %4$d refer\u00E8ncies en \u00FAs.\nUtilitzeu EnsureLocalCapacity o PushLocalFrame per fer que el marc augmenti expl\u00EDcitament.
JNCK064=Advertiment de JNI a %1$s\: la capacitat d'agrupaci\u00F3 de refer\u00E8ncia feble global ha augmentat autom\u00E0ticament de %2$d a %3$d.\nProbablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
JNCK063=Advertiment de JNI a %1$s\: la capacitat d'agrupaci\u00F3 de refer\u00E8ncia global ha augmentat autom\u00E0ticament de %2$d a %3$d.\nProbablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
JNCK062=Av\u00EDs JNI a %s\: no es pot cridar aquesta funci\u00F3 dins d'una secci\u00F3 cr\u00EDtica.
JNCK061=Advertiment de JNI a %1$s\: l'argument \#%2$d \u00E9s una signatura de camp amb format incorrecte ("%3$s")
JNCK060=Advertiment de JNI a %1$s\: l'argument \#%2$d \u00E9s una signatura de m\u00E8tode amb format incorrecte ("%3$s")
JNCK059=Advertiment de JNI a %1$s\: l'argument \#%2$d \u00E9s un identificador amb format incorrecte ("%3$s")
JNCK058=Advertiment de JNI a %1$s\: despr\u00E9s de cridar %2$s, cal que comproveu si hi ha excepcions amb ExceptionCheck, ExceptionClear o ExceptionOccurred abans de cridar %3$s
JNCK057=Error de JNI a %1$s\: no utilitzeu %2$s per alliberar mem\u00F2ria 0x%3$p adquirida mitjan\u00E7ant %4$s
JNCK056=Error de JNI a %1$s\: s'ha obtingut la mem\u00F2ria 0x%2$p de l'objecte 0x%3$p, alliberant-la de 0x%4$p
JNCK055=Error de JNI a %1$s\: cap funci\u00F3 de JNI no ha tornat el punter 0x%2$p, o ja s'havia alliberat.
JNCK054=Error de JNI a %1$s\: opci\u00F3 de mode no reconeguda %2$d
JNCK053=Error JNI\: la secci\u00F3 cr\u00EDtica s'ha d'alliberar abans del retorn de la funci\u00F3
JNCK052=Error de JNI a %1$s\: la classe %3$.*2$s \u00E9s obsoleta
JNCK051=Error de VM intern a %1$s\: la quantitat de bytes transferits %2$p \u00E9s inferior a la quantitat de bytes de refer\u00E8ncia de JNI %3$p
SHRC199=\ S'ha emmagatzemat correctament %2$.*1$s.
JNCK050=Error JNI a %s\: s'ha cridat PopLocalFrame sense un marc local a la pila
SHRC198=S'est\u00E0 emmagatzemant el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida...
SHRC197=S'est\u00E0 cercant el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida...
SHRC196=[Sortida detallada AOT de -Xshareclasses habilitada]
SHRC195=Habilita la sortida detallada AOT
SHRC194=\tper a ROMClass %2$.*1$s a 0x%3$p.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC192=El valor de -Xscmaxaot \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en il\u00B7limitat.
SHRC191=El valor de -Xscminaot \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en el mateix valor que -Xscmx.
SHRC190=El valor de -Xscminaot no ha de ser superior al valor de -Xscmaxaot.
