#Mon Oct 19 21:06:38 GMT-05:00 2015
JNCK049=Erro de JNI em %s\: reutiliza\u00E7\u00E3o de va_list detectada
JNCK048=Erro de JNI em %s\: Receptor n\u00E3o qualificado
JNCK047=Erro de JNI em %s\: Argumento clazz incorreto
JNCK046=Erro de JNI em %1$s\: O m\u00E9todo tem tipo de retorno incorreto ('%2$c')
JNCK045=Erro de JNI em %s\: O m\u00E9todo n\u00E3o \u00E9 est\u00E1tico
JNCK044=Erro de JNI em %s\: O m\u00E9todo \u00E9 est\u00E1tico
JNCK043=Erro de JNI em %1$s\: Argumento \#%2$d; imposs\u00EDvel localizar %3$s
JNCK042=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 uma subclasse de %3$s
JNCK041=Erro de JNI em %1$s\: O argumento \#%2$d est\u00E1 fora do intervalo para um %3$s (0x%4$x > 0x%5$x)
SHRC189=N\u00BA de M\u00E9todos AOT      \= %d
JNCK040=Erro de JNI em %1$s\: O argumento \#%2$d est\u00E1 fora do intervalo para um %3$s (0x%4$x < 0x%5$x)
SHRC188=Bytes de AOT          \= %d
SHRC187=Desativar armazenamento de dados AOT no cache compartilhado
SHRC186=\tParti\u00E7\u00E3o %.*s em ModContext %.*s
SHRC185=\tModContext %.*s
SHRC184=\tParti\u00E7\u00E3o %.*s
SHRC183=N\u00E3o \u00E9 poss\u00EDvel criar tabela hash em ScopeManagerImpl
SHRC182=N\u00E3o \u00E9 poss\u00EDvel criar monitor em ScopeManagerImpl
SHRC181=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex de tabela hash ScopeManagerImpl
SHRC180=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ScopeManagerImpl
JNCK039=Erro de JNI em %1$s\: O argumento \#%2$d \u00E9 NULL
JNCK038=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia do objeto v\u00E1lida. Seu tipo \u00E9\: %4$s\n
JNCK037=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia local. Seu tipo \u00E9\: %4$s
JNCK036=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia global fraca. Seu tipo \u00E9\: %4$s
JNCK035=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia global. Seu tipo \u00E9\: %4$s
JNCK034=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 %3$s
JNCK033=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 jarray
JNCK032=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 jobjectArray
JNCK031=Erro de JNI em %1$s\: O argumento \#%2$d \u00E9 NULL
SHRC179=O segmento ROMClass foi corrompido. Erro ao ler ROMClass em 0x%p
JNCK030=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada enquanto o GC est\u00E1 desativado (provavelmente, ela foi chamada a partir de um evento JVMPI ou JVMTI)
SHRC178=Ignorando a op\u00E7\u00E3o noIncrementalUpdates devido ao uso da op\u00E7\u00E3o singleJVM
SHRC177=N\u00E3o \u00E9 poss\u00EDvel executar o modo seguro devido ao uso da op\u00E7\u00E3o singleJVM
SHRC176=Reloca\u00E7\u00E3o invari\u00E1vel de cadeia ativada
SHRC175=Tornar a persist\u00EAncia do cache al\u00E9m das reinicializa\u00E7\u00F5es (apenas Win)
SHRC174=Ativar otimiza\u00E7\u00F5es para uso de JVM \u00FAnica
SHRC173=Configure o diret\u00F3rio para arquivos de controle de JVM (avan\u00E7ado)
SHRC172=N\u00E3o \u00E9 poss\u00EDvel criar o cache do tamanho solicitado devido a restri\u00E7\u00F5es do Sistema Operacional
SHRC171=O z/OS n\u00E3o pode criar cache do tamanho solicitado\: Verifique as configura\u00E7\u00F5es de BPXPRMxx do sistema z/OS
SHRC170=Especifique o nome do cache compartilhado\n \t(Use %%u para substituir nome do usu\u00E1rio)
JNCK029=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada dentro de uma se\u00E7\u00E3o cr\u00EDtica
JNCK028=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada quando uma exce\u00E7\u00E3o est\u00E1 pendente
ZIPS001=Imposs\u00EDvel abrir %s (Exporta\u00E7\u00E3o ausente)
JNCK027=Erro JNI em %s\: JNIEnv n\u00E3o \u00E9 o JNIEnv para o encadeamento ativo
ZIPS000=Imposs\u00EDvel abrir %1$s (%2$s)
JNCK026=Erro JNI em %s\: JNIEnv n\u00E3o parece ser um encadeamento v\u00E1lido, a mem\u00F3ria foi corrompida ou esta n\u00E3o \u00E9 uma m\u00E1quina virtual J9
JNCK025=Utilize -Xcheck\:jni\:nonfatal para continuar executando quando forem detectados erros.
JNCK024=Foi detectado erro de JNI. Interrompendo.
JNCK023=Foi detectado erro de JNI. Continuando...
JNCK022=refer\u00EAncia local liberada
JNCK021=refer\u00EAncia local em outro encadeamento
SHRC169=Altera\u00E7\u00E3o detectada em %2$.*1$s...\n \t...%3$d classes armazenadas em cache marcadas como antigas
JNCK020=refer\u00EAncia do depurador
SHRC168=Total de bytes de classe compartilhada lidos\=%1$lld. Total de bytes armazenados\=%2$d
SHRC167=Desativa o compartilhamento de classe
SHRC166=Conectado ao cache "%1$s", size\=%2$d bytes
SHRC165=[-Xshareclasses sa\u00EDda detalhada de API Auxiliar ativada]
SHRC164=[-Xshareclasses sa\u00EDda de E/S detalhada ativada]
SHRC163=[-Xshareclasses sa\u00EDda detalhada ativada]
SHRC162=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao abrir mem\u00F3ria compartilhada
SHRC161=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao criar mem\u00F3ria compartilhada
SHRC160=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao abrir o sem\u00E1foro
JNCK019=refer\u00EAncia global fraca
JNCK018=refer\u00EAncia global
JNCK017=refer\u00EAncia local
JNCK016=NULL
JNCK015=\thelp          imprimir esta tela
JNCK014=\tpedantic      executar verifica\u00E7\u00F5es mais cuidadosas, mas mais lentas
JNCK013=\tnovalist      n\u00E3o verifica reutiliza\u00E7\u00E3o va_list
JNCK012=\tnoadvice       n\u00E3o exibe orienta\u00E7\u00E3o
JNCK011=\tnowarn         n\u00E3o exibe avisos
SHRC159=Cache de classe compartilhada "%1$s" aberto
JNCK010=\tnonfatal       n\u00E3o sai quando erros s\u00E3o detectados
SHRC158=Cache de classe compartilhada "%1$s" criado
SHRC157=N\u00E3o \u00E9 poss\u00EDvel alocar %1$d bytes de mem\u00F3ria compartilhada solicitada \n \tM\u00E1ximo permitido de mem\u00F3ria compartilhada alocado com \u00EAxito (%2$d bytes) \n \t(Para aumentar a mem\u00F3ria compartilhada dispon\u00EDvel, modifique o valor SHMMAX do sistema)
SHRC156=Erro ao copiar nome do grupo para nome de cache
SHRC155=Erro ao copiar nome do usu\u00E1rio para nome de cache
SHRC154=Caractere de escape %.*s inv\u00E1lido para nome de cache
SHRC153=Especifique o nome do cache compartilhado\n \t(Use %%g para substituir nome do grupo e %%u para nome do usu\u00E1rio)
SHRC152=Sempre Iniciar a JVM Independentemente de Erros/Avisos
SHRC151=Suprimir Todas as Mensagens
SHRC150=Ativar Sa\u00EDda Detalhada da API Auxiliar
JNCK009=\tnobounds       n\u00E3o executa verifica\u00E7\u00E3o de limites em cadeias e matrizes
JNCK008=\ttrace          rastrear todas as fun\u00E7\u00F5es de JNI
JNCK007=\tverbose        rastrear determinadas fun\u00E7\u00F5es e atividades de JNI
JNCK006=\tall            verificar classes de aplicativo e de sistema
JNCK005=Uso\: -Xcheck\:jni\:[option[,option[,...]]]
JNCK004=jnichk - Utilit\u00E1rio de verifica\u00E7\u00E3o JNI para J9, Vers\u00E3o %s
JNCK003=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI\: imposs\u00EDvel alocar mem\u00F3ria local VM
JNCK002=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI\: imposs\u00EDvel registrar evento
JNCK001=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI instalado. Utilize -Xcheck\:jni\:help para uso
SHRC149=Ativar Sa\u00EDda Detalhada de Localiza\u00E7\u00E3o/Armazenamento
JNCK000=-Xcheck\:jni\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
SHRC148=Permitir acesso de grupo ao cache (usu\u00E1rio \u00E9 o padr\u00E3o)
SHRC147=O caractere %.*s n\u00E3o \u00E9 v\u00E1lido para nome de cache
SHRC146=Localizando a classe %1$s no cache compartilhado para cldr id %2$d com Token %4$.*3$s...
SHRC145=Localizando a classe %1$s no cache compartilhado para cldr id %2$d com URL %4$.*3$s...
SHRC144=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com Token %5$.*4$s...
SHRC143=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com URL %5$.*4$s...
SHRC142=\tem 0x%1$p\t\t%2$x \!\= %3$x
SHRC141=bytes incompat\u00EDveis\:
SHRC140=tamanho\:\t%1$d\t\t\t%2$d\n
SHRC139=\n\tROMClass sendo armazenado\tROMClass em cache
SHRC138=Foram localizados mais de um ROMClass \u00F3rf\u00E3os %.*s
SHRC499=Placeholder, not used
SHRC137=MODO SEGURO\: Aviso\: ROMClass %.*s n\u00E3o corresponde a ROMClass em cache
SHRC498=Placeholder, not used
SHRC136=N\u00E3o \u00E9 poss\u00EDvel criar o monitor em SH_ROMClassManagerImpl
SHRC497=Placeholder, not used
SHRC135=Falha em criar tabela hash em SH_ROMClassManagerImpl
SHRC496=Falha ao atualizar %1$s dados conectados para o endere\u00E7o 0x%2$p, motivo\: %3$s
SHRC134=Falha em criar o conjunto em SH_ROMClassManagerImpl
SHRC495=Falha ao armazenar %1$s dados conectados para o endere\u00E7o 0x%2$p, motivo\: %3$s
SHRC133=N\u00E3o \u00E9 poss\u00EDvel digitar mutex da tabela hash ROMClassManager
SHRC494=Falha ao localizar %1$s dados conectados para o endere\u00E7o 0x%2$p, motivo\: %3$s
SHRC132=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ROMClassManagerImpl
SHRC493=Falha ao localizar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\: %2$s
SHRC131=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada em ROMClassManagerImpl
SHRC492=Falha ao atualizar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\:%2$s
SHRC130=Tentativa de alocar enquanto a confirma\u00E7\u00E3o ainda est\u00E1 pendente
SHRC491=Falha ao armazenar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\: %2$s
SHRC490=Force a descoberta de um cache de classes compartilhadas danificado
SHRC129=Tentativa de configurar readerCount como -1\!
SHRC128=SH_CompositeCache\:\:exitMutex falhou com c\u00F3digo de retorno %d. Aviso\: seu cache pode estar danificado.
SHRC489=Se o cache aberto estiver marcado como danificado, acione um evento dump de cache
SHRC127=SH_CompositeCache\:\:enterMutex falhou com c\u00F3digo de retorno %d. Aviso\: seu cache pode estar danificado.
SHRC488=O total dos valores de -Xscminaot e -Xscminjitdata n\u00E3o deve ser maior do que o tamanho do cache dispon\u00EDvel
SHRC126=Foi feita solicita\u00E7\u00E3o para incluir muitos itens em ClasspathItem
SHRC487=Espa\u00E7o m\u00E1ximo para bytes de dados JIT         %*c\= %d
SHRC125=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o buffer de cadeia em SH_CacheMap
SHRC486=Espa\u00E7o reservado para bytes de dados JIT         %*c\= %d
SHRC124=O cache est\u00E1 %1$d%% cheio\n
SHRC485=Espa\u00E7o m\u00E1ximo para bytes AOT         %*c\= %d
SHRC123=%% Stale classes          \= %1$d%%\n
SHRC484=Espa\u00E7o reservado para bytes AOT         %*c\= %d
SHRC122=\# Stale classes  \= %d
SHRC483=atualiza\u00E7\u00E3o de cache com falha
SHRC121=\# Tokens         \= %d
SHRC482=endere\u00E7o n\u00E3o est\u00E1 no cache
SHRC120=\# URLs           \= %d
SHRC481=cache est\u00E1 corrompido
SHRC480=muitas atualiza\u00E7\u00F5es durante a leitura
EXEL099=\  -Xrealtime -Xnortsj           ativar realtime tempor\u00E1rio
EXEL098=\  -Xgcpolicy\:metronome          ativar realtime tempor\u00E1rio
EXEL097=\  -Xrealtime                    ativar realtime tempor\u00E1rio
EXEL096=\  -Xgcpolicy\:metronome          ativar extens\u00F5es do realtime
EXEL095=\  -Xrealtime                    ativar extens\u00F5es do realtime
EXEL094=\  -Xcompressedrefs              usar refer\u00EAncias de heap compactadas
EXEL093=As seguintes op\u00E7\u00F5es controlam a configura\u00E7\u00E3o global da VM\:
SHRC119=\# Classpaths     \= %d
EXEL092=\n  -Xdump[\:op\u00E7\u00E3o,...]  controla dumps, use -Xdump\:help para obter detalhes adicionais
SHRC118=\# ROMClasses     \= %d
EXEL091=\n  -Xcheck[\:op\u00E7\u00E3o[\:...]]  controla utiliza\u00E7\u00E3o de verifica\u00E7\u00E3o -Xcheck\:help para obter detalhes adicionais
SHRC479=aloca\u00E7\u00E3o de mem\u00F3ria de %d bytes com falha
SHRC117=%% de metadados utilizado \= %1$d%%\n
EXEL090=\  -Xscmaxaot<x>   configura espa\u00E7o m\u00E1x. reservado de cache compartilhado para dados AOT como <x>
SHRC478=tamanho dos dados %d maior do que o dispon\u00EDvel %d
SHRC116=Bytes de metadados   \= %d
SHRC477=sem espa\u00E7o em cache para %d bytes
SHRC115=bytes de ROMClass   \= %d
SHRC476=dados j\u00E1 existem
SHRC114=bytes livres       \= %d
SHRC475=n\u00E3o existem dados
SHRC113=tamanho do cache       \= %d
SHRC474=enterReadMutex com falha
SHRC112=ponteiro de aloca\u00E7\u00E3o             \= 0x%p\n
SHRC473=enterWriteMutex com falha
SHRC111=endere\u00E7o final               \= 0x%p
SHRC472=sem acesso para o recurso
SHRC110=\nendere\u00E7o base              \= 0x%p
SHRC471=Falha ao atualizar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\:%2$s
SHRC470=Atualizados %1$s dados anexados para %7$.*6$s.%3$.*2$s%5$.*4$s
EXEL089=\  -Xscminaot<x>   configura espa\u00E7o m\u00EDn. reservado de cache compartilhado para dados AOT como <x>
MECK002=Ocorreu um erro ao criar a estrutura de dados do site de chamada. As informa\u00E7\u00F5es do site de chamada n\u00E3o ser\u00E3o exibidas
EXEL088=
MECK001=Op\u00E7\u00E3o -Xcheck\:memory n\u00E3o reconhecida\: %s
EXEL087=\  -Xjni\:<op\u00E7\u00F5es>               define op\u00E7\u00F5es JNI
MECK000=Ocorreu um erro ao inicializar o utilit\u00E1rio -Xcheck\:memory
EXEL086=\n  -Xtrace[\:op\u00E7\u00E3o,...]  controle de rastreio, utilize -Xtrace\:help para obter detalhes adicionais
EXEL085=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize ent\u00E3o "-jxe <caminho>".\n
EXEL084=N\u00E3o \u00E9 poss\u00EDvel fazer uma c\u00F3pia de backup do arquivo\: %s
EXEL083=N\u00E3o foi poss\u00EDvel abrir o arquivo\: %s
SHRC109=\!STALE\!
EXEL082=\  -Xlp<x>         configura tamanho de p\u00E1gina grande como <x>
SHRC108=\t%.*s
EXEL081=vers\u00E3o de java "%1$s/%2$s"
SHRC469=Falha ao armazenar 1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\:%2$s
SHRC107=\t%.*s
EXEL080=vers\u00E3o de java "%s"
SHRC468=Armazenados %1$s dados anexados para %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC467=Falha ao localizar %1$s dados anexados para %8$.*7$s.%4$.*3$s.%6$.*5$s, motivo\:%2$s
SHRC105=%1$d\: 0x%2$p URL
SHRC466=Localizados %1$s dados anexados para %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC465=[-Xshareclasses sa\u00EDda detalhada de dados JIT ativada]
SHRC103=\tToken 0x%p
SHRC464=Ativar sa\u00EDda detalhada de dados JIT
SHRC102=\tURL 0x%p
SHRC463=O valor -Xscmaxjitdata \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado como ilimitado
SHRC101=\t\u00CDndice %1$d no caminho de classe 0x%2$p
SHRC462=O valor -Xscminjitdata \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado para ser igual ao valor -Xscmx
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s em 0x%5$p.
SHRC461=O valor -Xscminjitdata n\u00E3o deve ser maior do que o valor -Xscmaxjitdata
SHRC460=Desativar o armazenamento dos dados de JIT no cache compartilhado
EXEL079=\  -Xscmx<x>       configura o tamanho do novo cache de classe compartilhado para <x>
EXEL078=\  -Xshareclasses[\:options]  Ativa o compartilhamento de dados da classe (utilize a ajuda para obter detalhes)\n
EXEL077=\  -Xssi<x>        configura o incremento da pilha de encadeamento java para <x>
EXEL076=JIT  - %s\n
EXEL075=\  -Xquickstart    aumenta o tempo de inicializa\u00E7\u00E3o retardando otimiza\u00E7\u00F5es
EXEL074=Imposs\u00EDvel redirecionar o console para\: %1$s\:%2$d
EXEL073=Erro interno da VM\: Falha em criar Java VM
EXEL072=Erro de inicializa\u00E7\u00E3o da VM\: Sem mem\u00F3ria
EXEL071=Falha em localizar o nome de classe principal
SHRC459=Desativar o compartilhamento de classe e APIs do utilit\u00E1rio
EXEL070=A vers\u00E3o da imagem de ROM \u00E9 incorreta
SHRC458=Desativar o compartilhamento de classe sem desativar APIs do utilit\u00E1rio
SHRC457=Nome de cache inv\u00E1lido, o nome de cache "%.*s" cont\u00E9m apenas espa\u00E7o em branco ou est\u00E1 vazio
SHRC456=For\u00E7ar descoberta de uma mudan\u00E7a no ID da constru\u00E7\u00E3o VM
SHRC455=For\u00E7ar verifica\u00E7\u00E3o da tabela da sequ\u00EAncia na inicializa\u00E7\u00E3o
SHRC454=Desativar verifica\u00E7\u00E3o se o ID do sem\u00E1foro SysV atual \u00E9 o mesmo que o ID do sem\u00E1foro SysV em cache
SHRC453=Listar todos os elementos em cache, incluindo classes \u00F3rf\u00E3s
SHRC452=Desativar prote\u00E7\u00E3o da mem\u00F3ria da \u00E1rea de leitura/grava\u00E7\u00E3o (tabela da sequ\u00EAncia)
SHRC451=O campo de in\u00EDcio dos dados no cabe\u00E7alho do cache n\u00E3o \u00E9 v\u00E1lido. O endere\u00E7o de in\u00EDcio dos dados no cabe\u00E7alho do cache\: 0x%p.
SHRC450=O campo de comprimento dos dados no cabe\u00E7alho do cache n\u00E3o \u00E9 v\u00E1lido. O comprimento dos dados no cabe\u00E7alho do cache \u00E9 \: %u.
EXEL069=Falha em localizar imagem de ROM
EXEL068=Erro interno da VM\: Falha em configurar o elemento da matriz para %s
EXEL067=Erro interno da VM\: Falha em criarjava/lang/String para o argumento %s
EXEL066=Erro interno da VM\: Falha em criar matriz de byte para o argumento %s
EXEL065=Erro interno da VM\: Falha em criar matriz de argumento
EXEL064=O m\u00E9todo main deve ser declarado public, static e void.
EXEL063=A classe %s n\u00E3o implementa main()
EXEL062=Erro interno da VM\: Falta de mem\u00F3ria ao converter a cadeia em caracteres UTF para o nome de classe %s
EXEL061=Erro interno da VM\: Falha em criar java/lang/String para o nome de classe %s
SHRC449=O preenchimento \u00E9 diferente de zero. Os bytes de preenchimento no cabe\u00E7alho do cache s\u00E3o\: %u.
EXEL060=Erro interno da VM\: Falha em criar matriz de byte para o nome de classe %s
SHRC448=O campo do tamanho do cache no cabe\u00E7alho do cache n\u00E3o \u00E9 v\u00E1lido. O tamanho do cache no cabe\u00E7alho do cache \u00E9\: 0x%x.
SHRC447=Os dados de identifica\u00E7\u00E3o do cabe\u00E7alho do cache n\u00E3o s\u00E3o v\u00E1lidos. O endere\u00E7o da sequ\u00EAncia dos dados de identifica\u00E7\u00E3o no cabe\u00E7alho do cache\: 0x%p.
SHRC446=Falha ao adquirir o bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho durante a inicializa\u00E7\u00E3o do cache com o c\u00F3digo de erro\: %d.
SHRC445=O tamanho do cache \u00E9 muito pequeno para ser \u00FAtil. Tamanho do cache inv\u00E1lido\: 0x%x.
SHRC444=Leia os dados corrompidos para o cabe\u00E7alho de entrada de cache 0x%p (comprimento do item inv\u00E1lido)
SHRC443=O cache CRC est\u00E1 indicando incorretamente um cache de corrompido. Cache de CRC incorreto\: 0x%x.
SHRC442=O cache compartilhado "%s" est\u00E1 corrompido. O c\u00F3digo de distor\u00E7\u00E3o \u00E9 %d. O valor corrompido \u00E9 0x%p. Nenhum novo JVM ser\u00E1 permitido para conex\u00E3o com o cache.\n \tAs JVMs existentes podem continuar a funcionar, mas n\u00E3o podem atualizar o cache.
SHRC441=O valor do -XscmaxJIT \u00E9 maior que o valor do -Xscmx, ent\u00E3o, ele foi configurado para ilimitado
SHRC440=O valor do -XscminJIT \u00E9 maior que o valor do -Xscmx, ent\u00E3o, ele foi configurado para um valor igual ao do -Xscmx
EXEL059=Erro interno da VM\: Falha em localizar a classe java/lang/String
EXEL058=Erro interno da VM\: Sem mem\u00F3ria
EXEL057=
EXEL056=IBM \u00E9 uma marca registrada da IBM Corp.\nJava e todas as marcas baseadas em Java e logotipos s\u00E3o marcas ou marcas\nregistradas da Sun Microsystems, Inc.\n
EXEL055=Destino\: %s
EXEL054=(c) Copyright IBM Corp. 1991, %s  Todos os Direitos Reservados
EXEL053=Materiais Licenciados - Propriedade da IBM\n\nJ9 - VM para a plataforma Java(TM), Vers\u00E3o %s
EXEL052=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize o -X equivalente.
EXEL051=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize "-classpath <path>" ou "-cp <path>".
SHRC439=O valor do -XscminJIT n\u00E3o deve ser maior que o valor do -XscmaxJIT
EXEL050=\  -Xrdbginfo\:<host>\:<porta>      ativar servidor de informa\u00E7\u00F5es de depura\u00E7\u00E3o remoto
SHRC438=Desativar o armazenamento dos dados de JIT no cache compartilhado
SHRC437=Erro ao liberar a trava de leitura do cabe\u00E7alho do arquivo do cache de classe compartilhado
SHRC436=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho de arquivo do cache de classe compartilhado
SHRC435=-Xitsn%2$u usa %1$u bytes de mem\u00F3ria, que \u00E9 maior do que o tamanho do cache de classes compartilhado de %3$u bytes
SHRC434=O Value\=%d passado pela op\u00E7\u00E3o -Xitsn est\u00E1 fora do intervalo dos valores de n\u00FAmeros primos suportados pela VM. Intervalo suportado \= 0 - %u
SHRC433=\tpara ROMClass %2$.*1$s em 0x%3$p.
SHRC432=\ Assinatura\: %2$.*1$s Endere\u00E7o\: 0x%3$p
J9CL040=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a nova refer\u00EAncia global de JNI
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC430=Falha ao remover a gera\u00E7\u00E3o atual do cache de classe compartilhado"%s"
EXEL049=\  -Xdbginfo\:<symbol file path>  ativa o servidor de informa\u00E7\u00F5es de depura\u00E7\u00E3o
EXEL048=\  -Xrunjdwp\:<options>           ativa as, op\u00E7\u00F5es padr\u00E3o JDWP
EXEL047=\n  -Xdbg\:<options>               ativa o debug, op\u00E7\u00F5es padr\u00E3o JDWP
EXEL046=\  -Xlp                          ativa o suporte de p\u00E1gina grande
EXEL045=\  -Xnocompactgc                 desativa a compacta\u00E7\u00E3o
EXEL044=\  -Xcompactgc                   ativa a compacta\u00E7\u00E3o
EXEL043=\  -Xcompactexplicitgc           ativa a compacta\u00E7\u00E3o em todos os sistemas GCs
J9CL039=O registro de data e hora \u00E9 inv\u00E1lido ao recuperar informa\u00E7\u00F5es de uso da CPU da JVM.
EXEL042=\  -Xnocompactexplicitgc         desativa a compacta\u00E7\u00E3o em um sistema GC
J9CL038=Erro ao recuperar informa\u00E7\u00F5es de uso da CPU da JVM.
EXEL041=\  -Xalwaysclassgc               ativa o descarregamento de classe din\u00E2mico em todos os GCs
SHRC429=Falha ao remover a gera\u00E7\u00E3o mais antiga do cache de classe compartilhado "%s"
J9CL037=N\u00E3o \u00E9 poss\u00EDvel recuperar informa\u00E7\u00F5es de uso da CPU da JVM quando -XX\:-EnableCPUMonitor foi especificado.
EXEL040=\  -Xclassgc                     ativa o descarregamento de classe din\u00E2mico
SHRC428=Removida a gera\u00E7\u00E3o mais antiga do cache de classe compartilhado "%s"
J9CL036=carregando viola\u00E7\u00E3o de restri\u00E7\u00E3o\: %2$.*1$s n\u00E3o vis\u00EDvel a partir de %4$.*3$s
SHRC427=Modificador usado para imprimir as estat\u00EDsticas de cache detalhadas
J9CL035=M\u00E9todos de interface privada requerem invokespecial
SHRC426=\# Entradas de JCL %*c\= %d
J9CL034=%1$d\: Falha ao recuperar Informa\u00E7\u00F5es de %2$s. %3$s
SHRC425=\# Objetos Java %*c\= %d
J9CL033=N\u00E3o foi poss\u00EDvel registrar %s como a biblioteca de autoinicializa\u00E7\u00E3o. C\u00F3digo de erro \= %zu
SHRC424=\# Perfis de JIT %*c\= %d
J9CL032=%1$d\: Falha ao recuperar Informa\u00E7\u00F5es de %2$s.
SHRC423=\# Hints de JIT %*c\= %d
J9CL031=N\u00E3o foi poss\u00EDvel registrar dbgwrapper.dll como a biblioteca de autoinicializa\u00E7\u00E3o. C\u00F3digo de erro \= %zu
SHRC422=\# Thunks de AOT %*c\= %d
J9CL030=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para dado nativo do arrendat\u00E1rio
SHRC421=\# Hierarquia de Classe de AOT               %*c\= %d
SHRC420=\# Entradas de Dados de AOT %*c\= %d
EXEL039=\  -Xnoclassgc                   desativa o descarregamento de classe din\u00E2mico
EXEL038=\  -Xgcthreads<x>                configura o n\u00FAmero de encadeamentos GC
EXEL037=\nOs argumentos para as op\u00E7\u00F5es a seguir s\u00E3o expressos como n\u00FAmeros decimais.\n
EXEL036=\  -Xmaxf<x>       porcentagem m\u00E1xima de heap livre ap\u00F3s GC
EXEL035=\  -Xminf<x>       porcentagem m\u00EDnima de heap livre ap\u00F3s GC
EXEL034=Um valor 0,3 representa uma solicita\u00E7\u00E3o de 30%%\n
EXEL033=\nOs argumentos para as op\u00E7\u00F5es a seguir s\u00E3o expressos como decimal de 0 a 1.
J9CL029=Localizados caracteres com defeito/n\u00E3o mapeados
EXEL032=\  -Xmaxe<x>       configura o tamanho m\u00E1ximo para expans\u00E3o de heap para <x>
J9CL028=Erro interno ao ler o arquivo zip, C\u00F3digo de Erro %d
EXEL031=\  -Xmine<x>       configura o tamanho m\u00EDnimo para expans\u00E3o de heap para <x>
SHRC419=Bytes da classe LocalVariableTable      %*c\= %u
J9CL027=Erro de leitura do arquivo zip
EXEL030=\  -Xss<x>        configura o tamanho da pilha de encadeamento para <x>
SHRC418=Bytes de dados de byte %*c\= %d
J9CL026=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para conte\u00FAdo de postagem HTTP
SHRC417=Bytes de dados de JCL %*c\= %d
J9CL025=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para cabe\u00E7alhos de resposta de HTTP
SHRC416=Bytes de ReadWrite %*c\= %d
J9CL024=Sem mem\u00F3ria
SHRC415=Bytes de Objeto Java %*c\= %d
J9CL023=N\u00E3o h\u00E1 mem\u00F3ria suficiente dispon\u00EDvel para ler registro
SHRC414=Bytes de perfil de JIT %*c\= %d
J9CL022=N\u00E3o h\u00E1 mem\u00F3ria suficiente para listar armazenamentos de registros
SHRC413=Bytes de sugest\u00E3o de JIT %*c\= %d
J9CL021=N\u00E3o h\u00E1 mem\u00F3ria suficiente para criar a lista de \u00EDndice
SHRC412=Bytes de thunk de AOT %*c\= %d
J9CL020=N\u00E3o h\u00E1 mem\u00F3ria suficiente para ler dados do c\u00F3digo do idioma
SHRC411=Bytes de hierarquia de classes de AOT                       %*c\= %d
SHRC410=Bytes de dados de AOT %*c\= %d
EXEL029=\  -Xss<x>        configura o tamanho da pilha de encadeamento java m\u00E1ximo para <x>
EXEL028=\  -Xiss<x>        configura o tamanho da pilha de encadeamento java inicial para <x>
EXEL027=\  -Xmso<x>        configura o tamanho da pilha de encadeamento do S.O. para <x>
EXEL026=\  -Xmrx<x>         configura o tamanho m\u00E1ximo da configura\u00E7\u00E3o lembrada para <x>
EXEL025=\  -Xmr<x>         configura o tamanho da configura\u00E7\u00E3o lembrada para <x>
EXEL024=\  -Xmx<x>         configura a mem\u00F3ria m\u00E1xima para <x>
EXEL023=\  -Xms<x>           configura o tamanho de mem\u00F3ria inicial para <x>
J9CL019=N\u00E3o \u00E9 poss\u00EDvel alocar o buffer SIOCGIFCONF
EXEL022=\  -Xms<x>         configura o tamanho de espa\u00E7o antigo para <x>
J9CL018=n\u00E3o foi poss\u00EDvel alocar para entrada de fuso hor\u00E1rio
EXEL021=\  -Xmoi<x>        configura o incremento de espa\u00E7o antigo para <x>
SHRC409=Bytes de c\u00F3digo de AOT %*c\= %d
J9CL017=n\u00E3o foi poss\u00EDvel alocar para recurso de fuso hor\u00E1rio
EXEL020=\  -Xmox<x>        configura o tamanho de espa\u00E7o antigo m\u00E1ximo antigo para <x>
SHRC408=gera\u00E7\u00E3o de cache %*.c\= %d\n
J9CL016=n\u00E3o foi poss\u00EDvel criar a nova entrada de caminho da classe
SHRC407=sinalizadores de tempo de execu\u00E7\u00E3o %*.c\= 0x%.16llX
J9CL015=Falha ao criar rastreio de pilha (muito provavelmente devido \u00E0 falta de mem\u00F3ria no S.O.)
SHRC406=endere\u00E7o de in\u00EDcio dos metadados              %*c\= 0x%p
J9CL014=Argumento de linha de comandos JCL inv\u00E1lido
SHRC405=Falha ao criar um diret\u00F3rio para o cache
J9CL013=Falha em alocar o monitor do S.O.
SHRC404=Falha ao obter um diret\u00F3rio para o cache
J9CL012=
SHRC403=Bytes usados da \u00E1rea de depura\u00E7\u00E3o da classe         %*c\= %u
J9CL011=Falha em bifurcar o encadeamento do S.O.
SHRC402=Bytes de dados de JIT %*c\= %d
J9CL010=Falha em alocar JNIEnv
SHRC401=\# Caches de Zip %*c\= %d
SHRC400=Bytes de cache de Zip                     %*c\= %d
EXEL019=\  -Xmos<x>        configura o tamanho de espa\u00E7o antigo inicial para <x>
EXEL018=\  -Xmo<x>         configura o tamanho de espa\u00E7o inicial/m\u00E1ximo antigo para <x>
EXEL017=\  -Xmo<x>         configura o tamanho de espa\u00E7o antigo para <x>
EXEL016=\  -Xmnx<x>        configura o novo tamanho de espa\u00E7o m\u00E1ximo para <x>
EXEL015=\  -Xmns<x>        configura o novo tamanho de espa\u00E7o inicial para <x>
EXEL014=\  -Xmn<x>         configura o novo tamanho de espa\u00E7o inicial/m\u00E1ximo para <x>
EXEL013=\  -Xmn<x>         configura o novo tamanho de espa\u00E7o para <x>
J9CL009=Encadeamento j\u00E1 iniciado
EXEL012=\  -Xmco<x>        configura o incremento do segmento de classe de ROM para <x>
J9CL008=valor de tempo limite em nanossegundos fora do intervalo
EXEL011=\  -Xmca<x>        configura o incremento do segmento de classe de RAM para <x>
J9CL007=valor de tempo limite negativo
EXEL010=Valor com sufixo "k" (kilo) ou "m" (mega) ser\u00E3o fatorados de maneira adequada.\n
J9CL006=Nenhum dado de pr\u00E9-verifica\u00E7\u00E3o para java/lang/Object
J9CL005=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: requer VM v%1$i, encontrou-se v%2$i
J9CL004=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: esperava-se JCL v%1$i, encontrou-se v%2$i
J9CL003=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: JCL %1$x, VM %2$x
J9CL002=As classes s\u00E3o de uma biblioteca diferente de J9 ou um JXE reduzido incorretamente
SHRC755=\t invalidatedaot       Imprime apenas os tipos aot invalidados o cache compartilhado.
J9CL001=Tentar executando com -jcl\:%s
SHRC754=A recrea\u00E7\u00E3o de arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 permitida
J9CL000=Biblioteca de classes incompat\u00EDvel
SHRC753=Falha para obter o mutex de grava\u00E7\u00E3o de cache
SHRC752=Falha ao analisar a(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo
SHRC751=Falha ao analisar as especifica\u00E7\u00F5es de m\u00E9todo. N\u00E3o mais do que %d especifica\u00E7\u00F5es de m\u00E9todo s\u00E3o permitidas.
SHRC750=Nenhum m\u00E9todo AOT corresponde \u00E0(s) especifica\u00E7\u00E3o(\u00F5es)
EXEL009=\nArgumentos para as seguintes op\u00E7\u00F5es s\u00E3o expressos em bytes.
EXEL008=\  -Xfuture        ativa verifica\u00E7\u00F5es mais r\u00EDgidas, antecipando o padr\u00E3o futuro
EXEL007=\  -Xnoaot         n\u00E3o executa c\u00F3digo pr\u00E9-compilado
EXEL006=\  -Xnojit         desativa o JIT
EXEL005=\  -Xint           executa interpretado apenas (equivalente a -Xnojit -Xnoaot)
EXEL004=\n  -Xrun<library>[\:op\u00E7\u00F5es]  carregar biblioteca de agente nativo\n                            (obsoleto em favor de -agentlib)\n
EXEL003=\  -Xbootclasspath/a\:<path>  anexa <path> ao caminho de classe de autoinicializa\u00E7\u00E3o
EXEL002=\  -Xbootclasspath/p\:<path>  pr\u00E9-anexa <path> ao caminho de classe de autoinicializa\u00E7\u00E3o
EXEL001=\  -Xbootclasspath\:<path>    configura o caminho de classe de autoinicializa\u00E7\u00E3o para <path>
EXEL000=As op\u00E7\u00F5es a seguir n\u00E3o s\u00E3o op\u00E7\u00F5es padr\u00E3o e est\u00E3o sujeitas a altera\u00E7\u00F5es sem aviso pr\u00E9vio.\n
SHRC749=Falha ao localizar o(s) m\u00E9todo(s) AOT
SHRC748=Falha ao revalidar o(s) m\u00E9todo(s) AOT
SHRC747=Falha ao invalidar o(s) m\u00E9todo(s) AOT
SHRC746=Localizado(s) o(s) m\u00E9todo(s) AOT do %d acima
SHRC745=Revalidado(s) o(s) m\u00E9todo(s) AOT do %d acima
SHRC744=Invalidado(s) o(s) m\u00E9todo(s) AOT do %d acima
SHRC743=Especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo inv\u00E1lida(s) para a op\u00E7\u00E3o "%s"
SHRC742=IMPORTANTE\: \u00C9 poss\u00EDvel analisar v\u00E1rias especifica\u00E7\u00F5es de m\u00E9todo separadas por v\u00EDrgula. Em que um valor da op\u00E7\u00E3o cont\u00E9m v\u00EDrgula(s), ele deve estar entre chaves. \n\tVoc\u00EA pode precisar colocar as op\u00E7\u00F5es entre aspas para evitar que o shell intercepte e fragmente as linhas de comando separadas por v\u00EDrgula, ou seja\: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" ou\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC741=O formato de <method_specification> \u00E9 [\!]{*|[*]<packagename/classname>[*]}[.{*|[*]<methodname>[*]}][({*|[*]<parameters>[*]})], ou seja.\:\n \n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC740=Uso\: %s{<method_specification>[,<method_specification>]}
SHRC739=INVALIDADO
SHRC738=Imprima o(s) m\u00E9todo(s) AOT correspondente(s) \u00E0(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo.\n\t<method_specification> \u00E9 definido como\: [\!]{*|[*]<packagename/classname>[*]}[.{*|[*]<methodname>[*]}][({*|[*]<parameters>[*]})].
SHRC737=Revalide o(s) m\u00E9todo(s) AOT correspondente(s) \u00E0(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo.
SHRC736=Invalide o(s) m\u00E9todo(s) AOT correspondente(s) \u00E0(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo.
SHRC735=Use uma JVM %d-bit para executar a opera\u00E7\u00E3o solicitada no cache compartilhado %d-bit "%s" j\u00E1 que a JVM %d-bit n\u00E3o pode verificar se a mem\u00F3ria compartilhada foi criada pela JVM
SHRC734=Imprima o nome do arquivo da captura instant\u00E2nea de classe compartilhada que ser\u00E1 usado.
SHRC733=A JVM n\u00E3o pode armazenar caminhos de classe no cache compartilhado j\u00E1 que o cache foi criado com a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'
SHRC732=A JVM pode armazenar caminhos de classe no cache compartilhado criado com a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'
SHRC731=A JVM ignorou a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths' j\u00E1 que o cache compartilhado existente foi criado sem a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'
SHRC730=A JVM criou o cache compartilhado com a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'. Chamadas de JVM subsequente n\u00E3o poder\u00E3o armazenar caminhos de classe no cache compartilhado
SHRC729=A captura instant\u00E2nea foi criada por uma constru\u00E7\u00E3o JVM diferente e n\u00E3o corresponde \u00E0 JVM em execu\u00E7\u00E3o
SHRC728=Falha ao ler o arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC727=Ocorreu um erro ao criar o novo cache compartilhado n\u00E3o persistente
SHRC726=O cache compartilhado n\u00E3o persistente "%s" j\u00E1 existe. Ele n\u00E3o pode ser restaurado a partir da captura instant\u00E2nea.
SHRC725=O comprimento do arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s" \u00E9 inv\u00E1lido. O comprimento do arquivo \u00E9 de %lld bytes. Um arquivo da captura instant\u00E2nea v\u00E1lido \u00E9 de pelo menos %d bytes e no m\u00E1ximo %lld bytes.
SHRC724=O arquivo da captura instant\u00E2nea do cache compartilhado "%s" n\u00E3o existe
SHRC723=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es do arquivo da captura instant\u00E2nea do cache compartilhado "%s"
SHRC722=A JVM n\u00E3o permite acesso ao arquivo da captura instant\u00E2nea do cache compartilhado "%s" porque o ID do usu\u00E1rio e o ID do grupo do processo da JVM s\u00E3o diferentes do ID do usu\u00E1rio e do ID do grupo do propriet\u00E1rio do arquivo da captura instant\u00E2nea do cache compartilhado e o ID do usu\u00E1rio do processo da JVM n\u00E3o pertence ao grupo do propriet\u00E1rio do arquivo da captura instant\u00E2nea do cache compartilhado.
SHRC721=A JVM n\u00E3o est\u00E1 configurada para acessar o arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s". Para abrir o arquivo, use a subop\u00E7\u00E3o 'groupAccess'.
SHRC720=A recria\u00E7\u00E3o do arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 permitida ao criar uma captura instant\u00E2nea do cache
SHRC719=A captura instant\u00E2nea do cache compartilhado "%s" foi destru\u00EDda
SHRC718=A captura instant\u00E2nea do cache compartilhado n\u00E3o existe
SHRC717=Falha ao remover a gera\u00E7\u00E3o atual da captura instant\u00E2nea do cache compartilhado "%s"
SHRC716=Falha ao remover a gera\u00E7\u00E3o mais antiga da captura instant\u00E2nea do cache compartilhado "%s"
SHRC715=Gera\u00E7\u00E3o mais antiga da captura instant\u00E2nea do cache compartilhado removida "%s"
SHRC714=Nenhuma captura instant\u00E2nea do cache compartilhado dispon\u00EDvel
SHRC713=Falha ao obter o comprimento do arquivo da captura instant\u00E2nea do cache compartilhado "%s"
SHRC712=Tentando destruir todas as capturas instant\u00E2neas do cache compartilhado no cacheDir "%s"
SHRC711=Falha ao reposicionar a compensa\u00E7\u00E3o do descritor do arquivo no arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC710=Falha ao gravar no arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC709=A JVM est\u00E1 criando uma captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s", mas um arquivo da captura instant\u00E2nea "%s" j\u00E1 existe e ser\u00E1 sobrescrito
SHRC708=Falha ao truncar o arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente existente "%s"
SHRC707=Falha ao adquirir o mutex do cache "%s"
SHRC706=Falha ao adquirir o bloqueio do arquivo no arquivo da captura instant\u00E2nea do cache compartilhado
SHRC705=Mensagem de erro de plataforma\: %1$s
SHRC704=C\u00F3digo de erro de camada da porta \= %1$d
SHRC703=Falha ao abrir o arquivo da captura instant\u00E2nea do cache compartilhado "%s"
SHRC702=Falha ao obter um diret\u00F3rio para a captura instant\u00E2nea do cache compartilhado
SHRC701=Falha ao criar uma captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC700=A captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s" foi criada
PCKD091=A anota\u00E7\u00E3o @Unpacked no campo %2$.*1$s na classe %4$.*3$s \u00E9 inv\u00E1lida\: O campo @Unpacked n\u00E3o deve ser declarado est\u00E1tico
PCKD090=As anota\u00E7\u00F5es no campo %2$.*1$s na classe %4$.*3$s s\u00E3o inv\u00E1lidas\: A anota\u00E7\u00E3o @Length e a anota\u00E7\u00E3o @Unpacked n\u00E3o podem ser usadas juntas
PCKD089=A anota\u00E7\u00E3o @Unpacked no campo %2$.*1$s na classe %4$.*3$s \u00E9 inv\u00E1lida\: A classe declarada n\u00E3o \u00E9 @Packed
PCKD088=A anota\u00E7\u00E3o @Unpacked no campo %2$.*1$s na classe %4$.*3$s \u00E9 inv\u00E1lida\: O tipo de um campo @Unpacked deve ser uma classe @Packed
PCKD087=Suporte a objeto empacotado \u00E9 um novo aprimoramento da IBM para Java fornecido como uma\n visualiza\u00E7\u00E3o de tecnologia. O conte\u00FAdo est\u00E1 dispon\u00EDvel sujeito a uma ren\u00FAncia de responsabilidade.\n\nRen\u00FAncia de Responsabilidade\nAs interfaces de programa\u00E7\u00E3o de aplicativo e c\u00F3digo contidas neste s\u00E3o informa\u00E7\u00F5es de\n visualiza\u00E7\u00E3o de tecnologia que n\u00E3o podem ser disponibilizadas de modo geral pela IBM como ou em um produto.\nVoc\u00EA tem permiss\u00E3o para usar as informa\u00E7\u00F5es somente para uso interno para prop\u00F3sitos de avalia\u00E7\u00E3o\n e n\u00E3o para usar em um ambiente de produ\u00E7\u00E3o. A IBM fornece as\n informa\u00E7\u00F5es sem obriga\u00E7\u00E3o de suporte e "no estado em que se encontram" sem garantia de qualquer\n tipo.\n\nInforma\u00E7\u00F5es quanto a potenciais futuros produtos destinam-se a destacar nossa dire\u00E7\u00E3o de produto geral\n e n\u00E3o devem ser consideradas na tomada de decis\u00E3o de uma compra.\nAs informa\u00E7\u00F5es mencionadas quanto a potenciais futuros produtos n\u00E3o s\u00E3o um\ncompromisso, promessa ou obriga\u00E7\u00E3o legal de entregar qualquer material, c\u00F3digo ou\n funcionalidade. Informa\u00E7\u00F5es sobre potenciais futuros produtos n\u00E3o podem ser incorporadas\n em nenhum contrato. O desenvolvimento, libera\u00E7\u00E3o e sincroniza\u00E7\u00E3o de quaisquer futuros recursos ou\n funcionalidade descritos para nossos produtos permanecem sob nosso crit\u00E9rio exclusivo.\n
PCKD086=A classe de matriz @Packed "%.*s" n\u00E3o pode ter uma classe membro da matriz @Packed.
PCKD085=Implementa\u00E7\u00E3o de m\u00E9todo inesperada localizada na classe de matriz @Packed "%.*s"
PCKD084=A classe de matriz @Packed "%.*s" n\u00E3o pode ter quaisquer campos.
PCKD083=A classe de matriz @Packed "%.*s" deve implementar java/io/Serializable.
PCKD082=A classe de matriz @Packed "%.*s" deve implementar java/lang/Cloneable.
PCKD081=O m\u00E9todo clone() est\u00E1 ausente da classe de matriz @Packed "%.*s".
PCKD080=O m\u00E9todo getLength() est\u00E1 ausente da classe de matriz @Packed "%.*s".
IREL001=
PCKD079=O m\u00E9todo at() est\u00E1 ausente da classe de matriz @Packed "%.*s".
IREL000=O c\u00F3digo AOT de %1$s.jar gerado pela vers\u00E3o %2$s do JVM n\u00E3o \u00E9 compat\u00EDvel com a vers\u00E3o atual %3$s do JVM.
PCKD078=O m\u00E9todo allocate() est\u00E1 ausente da classe de matriz @Packed "%.*s".
PCKD077=Um construtor privado est\u00E1 ausente da classe de matriz @Packed "%.*s".
PCKD076=Assinatura incorreta para m\u00E9todo clone() de classe de matriz @Packed "%.*s".
PCKD075=Assinatura incorreta para m\u00E9todo getLength() de classe de matriz @Packed "%.*s".
PCKD074=Assinatura incorreta para m\u00E9todo at() de classe de matriz @Packed "%.*s".
PCKD073=Assinatura incorreta para m\u00E9todo allocate() de classe de matriz @Packed "%.*s".
PCKD072=A classe de matriz @Packed "%.*s" n\u00E3o pode ter mais de um construtor.
PCKD071=O construtor da classe de matriz @Packed "%.*s" n\u00E3o deve requerer quaisquer argumentos.
PCKD070=O construtor da classe de matriz @Packed "%.*s" deve ser privado.
PCKD069=A classe de matriz @Packed "%.*s" deve estender diretamente PackedObject.
PCKD068=A classe de matriz @Packed "%.*s" deve ser p\u00FAblica.
PCKD067=A classe de matriz @Packed "%.*s" deve ser final.
PCKD066=O comprimento da matriz solicitada %1$lld (0x%2$llx) \u00E9 muito grande.
PCKD065=O comprimento da matriz solicitada \u00E9 muito grande.
PCKD064=N\u00E3o \u00E9 poss\u00EDvel obter capacidade de ByteBuffer direto.
PCKD063=N\u00E3o \u00E9 poss\u00EDvel obter endere\u00E7o de ByteBuffer direto.
PCKD062=A classe @Packed final %.*s n\u00E3o deve estar vazia.
PCKD061=A classe @Packed final n\u00E3o deve estar vazia.
PCKD060=A anota\u00E7\u00E3o @Length em %2$.*1$s em %4$.*3$s \u00E9 inv\u00E1lida\: o valor @Length n\u00E3o deve ser zero
PORT046=N\u00E3o foi poss\u00EDvel abrir o execut\u00E1vel
PORT045=Falha ao alocar mem\u00F3ria durante a recupera\u00E7\u00E3o das informa\u00E7\u00F5es do sistema.
PORT044=Falha ao alocar mem\u00F3ria enquanto recupera informa\u00E7\u00F5es do hypervisor.
PORT043=%1$d\: Falha ao recuperar Informa\u00E7\u00F5es de %2$s.
PORT042=N\u00E3o \u00E9 poss\u00EDvel ler /proc/sysinfo
PORT041=HYPFS n\u00E3o montado
PORT040=Falha na leitura de HYPFS
PCKD059=A classe \u00E9 abstrata.
PCKD058=Erro no campo aninhado "%2$.*1$s" na classe %4$.*3$s. O tipo de campo deve ser uma classe de matriz packed final.
PCKD057=A classe de um campo aninhado deve ser uma classe de matriz packed.
PCKD056=Erro no campo aninhado "%2$.*1$s" na classe %4$.*3$s. A classe do campo deve ser final e @Packed.
PCKD055=A classe de um campo aninhado deve ser final e @Packed.
PCKD054=A classe de elemento de uma classe de matriz packed deve ser final e @Packed.
PCKD053=A classe de elemento da classe de matriz packed %.*s deve ser final e @Packed.
PCKD052=A classe %2$.*1$s, subclasse de %4$.*3$s, deve ser @Packed porque ele estende o PackedObject.
PCKD051=A superclasse %2$.*1$s da classe @Packed %4$.*3$s \u00E9 inv\u00E1lida. Uma classe @Packed deve estender PackedObject ou uma classe @Packed abstrata.
PCKD050=A superclasse %2$.*1$s da classe @Packed %4$.*3$s deve ser abstrata.
PORT039=Falha na atualiza\u00E7\u00E3o de HYPFS
PORT038=Valor malformado para IBM_JAVA_HYPERVISOR_SETTINGS
PORT037=N\u00E3o est\u00E1 sendo executado em um Hypervisor.
PORT036=C\u00F3digo de retorno inesperado de servi\u00E7o CSRSI no z/OS
PORT035=Falha de __malloc31 ao alocar buffer no z/OS
PORT034=Tentativa de anexar mem\u00F3ria compartilhada criada na chave de prote\u00E7\u00E3o de mem\u00F3ria %lu, mas executando atualmente na chave %lu.
PORT033=Falha ao detectar um Hypervisor Suportado.
PORT032=Falha na opera\u00E7\u00E3o relacionada ao Hypervisor.
PORT031=Foi recebida a condi\u00E7\u00E3o LE %s%i, que corresponde a um sinal POSIX criado pelo software
PORT030=%s configura\u00E7\u00E3o "%s" especifica que o core dump deve ser canalizado para um programa externo.  Tentando renomear core ou core.%d.\n
PCKD049=A superclasse de uma classe @Packed deve ser abstrata.
PCKD048=A classe @Packed %.*s n\u00E3o tem superclasse.
PCKD047=A classe @Packed n\u00E3o tem superclasse.
PCKD046=A classe @Packed deve ser declarada como abstrata ou final.
PCKD045=A classe @Packed %.*s deve ser declarada como abstrata ou final.
PCKD044=Uma classe de matriz packed \u00E9 necess\u00E1ria para esta opera\u00E7\u00E3o.
PCKD043=A classe com.ibm.jvm.packed.PackedObject deve ser abstrata e n\u00E3o @Packed.
PCKD042=
PCKD041=O tipo de cast \u00E9 maior que o objeto original.
PCKD040=Os comprimentos das matrizes s\u00E3o diferentes.
PORT029=Identificador inv\u00E1lido. identificador de arquivos\: %1$d.
PORT028=Falha no mmap devido \u00E0s op\u00E7\u00F5es de mapeamento inv\u00E1lidas.
PORT027=Falha no mmap devido ao par\u00E2metro de prote\u00E7\u00E3o de mem\u00F3ria inv\u00E1lido.
PORT026=O arquivo especificado \u00E9 um diret\u00F3rio.
PORT025=Tipo de trava inv\u00E1lido para a opera\u00E7\u00E3o de trava de arquivo. lockFlags\: %1$d
PORT024=IEATDUMP falhou porque n\u00E3o foi poss\u00EDvel alocar o conjunto de dados de dump (verificar permiss\u00F5es de espa\u00E7o em disco e campo).
PORT023=IEATDUMP falhou porque o modelo de dump especificado pelo usu\u00E1rio era muito longo. Tentando novamente o dump com o modelo padr\u00E3o.
PORT022=Anexando .X&DS ao modelo de dump especificado pelo usu\u00E1rio para ativar dumps multipartes.
PORT021=Voc\u00EA abriu um sem\u00E1foro compartilhado do System V antigo\: arquivo\:%1$s semid\:%2$d
PORT020=Voc\u00EA abriu uma mem\u00F3ria compartilhada do System V antiga\: arquivo\:%1$s shmid\:%2$d
PCKD039=A anota\u00E7\u00E3o @Length em %2$.*1$s em %4$.*3$s \u00E9 inv\u00E1lida\: o campo n\u00E3o deve ser declarado como est\u00E1tico
PCKD038=Anota\u00E7\u00E3o @Length ausente no %2$.*1$s em %4$.*3$s
PCKD037=n\u00E3o \u00E9 poss\u00EDvel criar a matriz @Packed multidimensional
PCKD036=A classe @Packed n\u00E3o pode ter m\u00E9todos sincronizados de inst\u00E2ncia.
PCKD035=A classe @Packed %2$.*1$s n\u00E3o pode ter m\u00E9todo sincronizado de inst\u00E2ncia %4$.*3$s
PCKD034=A classe @Packed n\u00E3o pode ter campos compactados aninhados finais.
PCKD033=A classe @Packed %2$.*1$s n\u00E3o pode ter campo aninhado%4$.*3$s
PCKD032=A classe @Packed n\u00E3o pode ter campos tempor\u00E1rios.
PCKD031=A classe @Packed %2$.*1$s n\u00E3o pode ter campo transit\u00F3rio %4$.*3$s
PCKD030=A classe @Packed n\u00E3o pode ter campos vol\u00E1teis.
PORT019=N\u00E3o \u00E9 poss\u00EDvel criar diret\u00F3rio %s.  As classes compartilhadas ser\u00E3o desativadas at\u00E9 que este diret\u00F3rio seja criado.
PORT018=Falha na Opera\u00E7\u00E3o\: %1$d (%2$s falhou\: %3$d)
PORT017=Falha na Opera\u00E7\u00E3o\: %d
PORT016=Erro Interno %i
PORT015=Imposs\u00EDvel resolver refer\u00EAncias da biblioteca compartilhada - uma biblioteca compartilhada de pr\u00E9-requisito pode estar ausente
PORT014=Falha ao carregar dll, pois n\u00E3o foi localizado
PORT013=Erro no carregamento da biblioteca compartilhada - a tabela dll n\u00E3o p\u00F4de ser localizada
PORT012=Erro no carregamento da biblioteca compartilhada devido a bits PACE sendo configurados
PORT011=Imposs\u00EDvel alocar mem\u00F3ria durante a tentativa de carregar uma biblioteca compartilhada
PORT010=A permiss\u00E3o para carregar a biblioteca compartilhada n\u00E3o foi concedida
CDRT002=PC com Falha\: %1$p (offset %2$p), metaData \= %3$p
CDRT001=M\u00E9todo\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
CDRT000=Imposs\u00EDvel localizar o mapa tempor\u00E1rio JIT - interrompendo a VM
PCKD029=A classe @Packed %2$.*1$s n\u00E3o pode ter campo vol\u00E1til %4$.*3$s
PCKD028=A classe @Packed n\u00E3o pode implementar a interface.
PCKD027=A classe @Packed %.*s n\u00E3o deve implementar a interface.
PCKD026=A classe @Packed deve ser declarada como final.
PCKD025=A classe @Packed %.*s deve ser declarada como final.
PCKD024=A anota\u00E7\u00E3o @Length em %2$.*1$s em %4$.*3$s \u00E9 inv\u00E1lida\: o valor @Length deve ser positivo
PCKD023=Esta fun\u00E7\u00E3o n\u00E3o pode operar em objetos @Packed mistos.
PCKD022=A anota\u00E7\u00E3o @Length em %2$.*1$s em %4$.*3$s \u00E9 inv\u00E1lida\: tipo de campo deve ser @Packed
PCKD021=A anota\u00E7\u00E3o @Length em %2$.*1$s em %4$.*3$s \u00E9 inv\u00E1lida\: tipo de campo deve ser matriz compacta
PCKD020=A anota\u00E7\u00E3o @Length em %2$.*1$s em %4$.*3$s \u00E9 inv\u00E1lida\: declarando que a classe n\u00E3o \u00E9 @Packed
PORT009=A biblioteca compartilhada especificada n\u00E3o foi localizada
PORT008=O m\u00F3dulo n\u00E3o \u00E9 a arquitetura correta
PORT007=O m\u00F3dulo especificado n\u00E3o \u00E9 um m\u00F3dulo
PORT006=O formato do m\u00F3dulo n\u00E3o est\u00E1 correto
PORT005=N\u00E3o foi poss\u00EDvel carregar a biblioteca compartilhada
PORT004=Falha de resolu\u00E7\u00E3o de s\u00EDmbolo
PORT003=O m\u00F3dulo dependente %s n\u00E3o p\u00F4de ser carregado
PORT002=Erro desconhecido ao carregar a biblioteca compartilhada
PORT001=Falha ao alocar mem\u00F3ria durante a tentativa de gravar em um arquivo.
PORT000=
PCKD019=A classe n\u00E3o @Packed %.*s foi registrada anteriormente como uma classe @Packed.
PCKD018=A classe @Packed %.*s foi registrada anteriormente como uma classe n\u00E3o @Packed.
PCKD017=N\u00E3o \u00E9 poss\u00EDvel armazenar em uma matriz de tipo @Packed.
PCKD016=N\u00E3o \u00E9 poss\u00EDvel designar a um campo aninhado de um tipo @Packed.
PCKD015=Uma classe @Packed deve estender PackedObject ou uma classe @Packed abstrata.
PCKD014=As subclasses de com.ibm.jvm.packed.PackedObject devem ser @Packed.
PCKD013=com.ibm.jvm.packed.PackedObject n\u00E3o pode ser carregado por um carregador de classe n\u00E3o do sistema.
PCKD012=Esta opera\u00E7\u00E3o n\u00E3o \u00E9 v\u00E1lida em objetos @Packed.
PCKD011=N\u00E3o \u00E9 poss\u00EDvel copiar entre objetos de tipos @Packed diferentes.
PCKD010=
PCKD009=%2$.*1$s na anota\u00E7\u00E3o @ImportPacked no %4$.*3$s, foi registrado anteriormente como classe n\u00E3o @Packed.
PCKD008=A classe n\u00E3o corresponde a uma anota\u00E7\u00E3o @ImportPacked anterior.
PCKD007=N\u00E3o ser\u00E1 poss\u00EDvel criar um objeto atrav\u00E9s desta API se a classe do objeto for um tipo @Packed misto
PCKD006=
PCKD005=
J2JX110=O arquivo JAR %s j\u00E1 foi convertido
PCKD004=N\u00E3o \u00E9 um objeto de matriz @Packed
PCKD003=Uma classe de matriz @Packed n\u00E3o \u00E9 v\u00E1lida para esta opera\u00E7\u00E3o.
PCKD002=N\u00E3o \u00E9 um objeto @Packed nativo
PCKD001=N\u00E3o \u00E9 um objeto @Packed
PCKD000=N\u00E3o \u00E9 uma classe @Packed
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s em 0x%5$p.
SHRC098=\nEstat\u00EDsticas atuais para o cache %s\: \n
SHRC097=O cache compartilhado "%s" est\u00E1 corrompido. Nenhum novo JVM ser\u00E1 permitido para conex\u00E3o com o cache.\n \tAs JVMs existentes podem continuar a funcionar, mas n\u00E3o podem atualizar o cache.
SHRC096=O cache compartilhado "%s" est\u00E1 completo. Utilize -Xscmx para configurar o tamanho do cache.
SHRC095=As tentativas de chamar markStale nos itens de cache compartilhados falharam
SHRC094=\u00D3rf\u00E3o localizado mas o ROMClass local foi transmitido para addROMClassToCache
SHRC093=Foi detectado um encerramento inesperado de outra JVM durante a atualiza\u00E7\u00E3o
SHRC092=Falha ADD ao ler cache
J2JX109=\  -E xxx\=yyy                configura propriedade de sistema xxx como o valor da vari\u00E1vel de ambiente yyy no tempo de execu\u00E7\u00E3o
SHRC091=Leitura de dados corrompidos para o item 0x%p (dataType inv\u00E1lido)
J2JX108=\  -g[\:lines,source,vars]    gera um subconjunto (lines, source e/ou vars) de informa\u00E7\u00F5es de depura\u00E7\u00E3o dentro do JXE
SHRC090=Falha ao obter mutex de cache na inicializa\u00E7\u00E3o de SH_CacheMap
J2JX107=\  -g\:nosym                  informa\u00E7\u00F5es de depura\u00E7\u00E3o embutidas em JXE
J2JX106=\  -g\:sym                    gera um arquivo .sym para depura\u00E7\u00E3o, nenhuma informa\u00E7\u00E3o de depura\u00E7\u00E3o dentro de JXE
J2JX105=\  -nog                      n\u00E3o gera informa\u00E7\u00F5es de depura\u00E7\u00E3o para JXE
J2JX104=\  -g                        igual a -g\:sym
J2JX103=N\u00E3o foi poss\u00EDvel compilar o m\u00E9todo\: %2$.*1$s/%4$.*3$s%6$.*5$s jitErr 0%7$x
J2JX102=N\u00E3o foi poss\u00EDvel compilar o m\u00E9todo nativo\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX101=N\u00E3o foi poss\u00EDvel compilar o m\u00E9todo abstrato\: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX100=%s n\u00E3o \u00E9 suportado nesta configura\u00E7\u00E3o
SHRC089=N\u00E3o \u00E9 poss\u00EDvel criar mutex de atualiza\u00E7\u00E3o em SH_CacheMap
SHRC088=Falha ao criar cache como ROMImageSegment em SH_CacheMap
SHRC087=MarkStale falhou durante ClasspathManager\:\:update()
SHRC086=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex da tabela hash ClasspathManager
SHRC085=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o cabe\u00E7alho do item da lista vinculada
SHRC084=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada
SHRC083=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a matriz identifiedClasspaths em SH_ClasspathManagerImpl2
SHRC082=N\u00E3o \u00E9 poss\u00EDvel criar identifiedMutex em SH_ClasspathManagerImpl2
SHRC081=N\u00E3o \u00E9 poss\u00EDvel criar cpeTableMutex em SH_ClasspathManagerImpl2
SHRC080=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a entrada da tabela hash
SHRC079=N\u00E3o \u00E9 poss\u00EDvel criar a tabela hash em SH_ClasspathManagerImpl2
SHRC078=Falha ao criar o conjunto linkedListHdr em SH_ClasspathManagerImpl2
SHRC077=Falha ao criar o conjunto linkedListImpl em SH_ClasspathManagerImpl2
SHRC076=Localizando a classe %1$s no cache compartilhado para cldr id %2$d...
SHRC075=\ Falhou.
SHRC074=\ Com \u00CAxito.
SHRC073=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com URL %5$.*4$s (\u00EDndice %6$d)...
VIRT001=N\u00E3o foi poss\u00EDvel inicializar o Hypervisor.
SHRC072=A op\u00E7\u00E3o da linha de comandos "%s" n\u00E3o \u00E9 reconhecida
VIRT000=Recurso de virtualiza\u00E7\u00E3o solicitado.
SHRC071=A op\u00E7\u00E3o da linha de comandos "%s" requer a subop\u00E7\u00E3o
SHRC070=Atualiza\u00E7\u00F5es incrementais desativadas
SHRC069=Redu\u00E7\u00E3o simult\u00E2nea de conten\u00E7\u00E3o de armazenamento desativada
SHRC068=Armazenamento em cache local de caminhos de classe desativado
SHRC067=Verifica\u00E7\u00E3o do time stamp desativada
SHRC066=Bloqueio de tabelas hash locais desativado
SHRC065=N\u00E3o \u00E9 poss\u00EDvel alocar o conjunto em shrinit
SHRC064=Falha ao criar configMonitor em shrinit
SHRC063=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para sharedClassConfig em shrinit
SHRC062=Erro ao copiar o nome do usu\u00E1rio no nome de cache padr\u00E3o
SHRC061=O nome do cache n\u00E3o deve ter mais de 64 caracteres. O cache n\u00E3o foi criado.
SHRC060=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o buffer de cadeia em shrinit\:\:hookFindSharedClass
JDTS000=Atendendo o transporte dt_socket no endere\u00E7o\: %d
OFFC031=Transfer\u00EAncia\: O arquivo de propriedades nativas local possui um formato inv\u00E1lido {%s}.
OFFC030=Transfer\u00EAncia\: N\u00E3o foi poss\u00EDvel localizar o arquivo de propriedades nativas local {%s}.
SHRC059=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem em shrinit\:\:hookFindSharedClass
SHRC058=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem em shrinit\:\:hookStoreSharedClass
SHRC057=Par\u00E2metros incorretos para op\u00E7\u00E3o de expira\u00E7\u00E3o
SHRC056=A op\u00E7\u00E3o da linha de comandos "%s" n\u00E3o \u00E9 reconhecida
SHRC055=Desativar atualiza\u00E7\u00F5es de cache incrementais
SHRC054=Desativar algoritmo para reduzir a conten\u00E7\u00E3o de armazenamento
SHRC053=Desativar bloqueio da tabela hash local
SHRC052=Desativar armazenamento em cache de caminho de classe local
SHRC051=Desativar atualiza\u00E7\u00F5es din\u00E2micas
OFFC029=Transfer\u00EAncia\: Falha ao criar o gerenciador de transfer\u00EAncia.
SHRC050=Ativar sa\u00EDda detalhada
OFFC028=Transfer\u00EAncia\: Falha ao iniciar o controlador de quarentena local.
OFFC027=Transfer\u00EAncia\: Informa\u00E7\u00F5es de conex\u00E3o ausentes para isolamento remoto.
OFFC026=Transfer\u00EAncia\: Informa\u00E7\u00F5es de conex\u00E3o inv\u00E1lidas para isolamento remoto.
OFFC025=Transfer\u00EAncia\: Falha ao iniciar controlador de quarentena com url\=%s.
OFFC024=Transfer\u00EAncia\: Isolamento de JNI ativado para o grupo de bibliotecas {%s}.
OFFC023=Rastreio de Transfer\u00EAncia\: Registro de Bifurca\u00E7\u00E3o de Ajuste em %s
OFFC022=Utilit\u00E1rio de Rastreio de Transfer\u00EAncia instalado. Utilize -Xoffload\:trace\:help para o uso
OFFC021=\ttuningfork\=device  enviar sa\u00EDda tuningfork para o dispositivo.
OFFC020=\txml\=filename       registrar atividade de JNI para nome do arquivo.
SHRC049=Modo de depura\u00E7\u00E3o que verifica todos os bytecodes de entrada
SHRC048=Listar todos os elementos em cache
SHRC047=Imprimir resumo de estat\u00EDsticas de cache
SHRC046=Exibir todos os caches compartilhados e suas estat\u00EDsticas
SHRC045=Destruir caches que n\u00E3o foram utilizados por <t> minutos
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC043=Ativar compartilhamento de bytecode modificado\n \t<modContext> \u00E9 um descritor de usu\u00E1rio que descreve o tipo de modifica\u00E7\u00E3o\n \tOs JVMs que usam o mesmo <modContext> devem usar as mesmas modifica\u00E7\u00F5es
SHRC042=Destruir todos os caches compartilhados
SHRC041=Destruir cache compartilhado (usar par\u00E2m. de nome ou padr\u00E3o)
OFFC019=Uso\: -Xoffload\:trace\:[op\u00E7\u00E3o[,op\u00E7\u00E3o[,...]]]
J9VM149=%s n\u00E3o \u00E9 mais suportado. Inclua os arquivos jar/bibliotecas necess\u00E1rios para o caminho de classe.
SHRC040=Especificar nome de cache compartilhado
OFFC018=Utilit\u00E1rio de Rastreio de Transfer\u00EAncia para J9, Vers\u00E3o %s
J9VM148=%s n\u00E3o \u00E9 mais suportado. O mecanismo de substitui\u00E7\u00E3o em padr\u00F5es endossados \u00E9 suportado apenas por meio de m\u00F3dulos.
OFFC017=\thelp          imprimir esta tela
J9VM147=N\u00E3o \u00E9 poss\u00EDvel anexar o encadeamento atual
OFFC016=\ttax\=spin|delay   configurar a estrat\u00E9gia de atraso.
J9VM146=invokeinterface de m\u00E9todo n\u00E3o publico '%4$.*3$s%6$.*5$s' in %2$.*1$s
OFFC015=\toutput\=device    sa\u00EDda para arquivo, 'stdout' ou 'stderr'
J9VM145=%s n\u00E3o \u00E9 suportado no z/OS.
OFFC014=\tdelay\=\#[ms|us]   aplicar atraso de \# milissegundos/microsegundos a cada chamada JNI
J9VM144=par\u00E2metros em excesso\: 255 + 1
OFFC013=Uso\: -Xoffload\:sim\:[op\u00E7\u00E3o[,op\u00E7\u00E3o[,...]]]
J9VM143=A op\u00E7\u00E3o da linha de comandos %s n\u00E3o \u00E9 suportada nesta vers\u00E3o do IBM SDK
OFFC012=Utilit\u00E1rio de Simulador de Transfer\u00EAncia para J9, Vers\u00E3o %s
J9VM142=A op\u00E7\u00E3o da linha de comandos -Xrealtime n\u00E3o \u00E9 suportada nesta vers\u00E3o do IBM SDK
OFFC011=Simulador de Transfer\u00EAncia\: Falha na inicializa\u00E7\u00E3o de Bifurca\u00E7\u00E3o de Ajuste.
J9VM141=m\u00E9todos padr\u00E3o em conflito para '%2$.*1$s%4$.*3$s' em %6$.*5$s a partir das classes [%7$s]
OFFC010=Unidades de tempo n\u00E3o reconhecidas -> %s
J9VM140=O respons\u00E1vel pela chamada n\u00E3o est\u00E1 anotado como @sun.reflect.CallerSensitive.
SHRC039=Imprimir ajuda compartilhada geral
SHRC038=Uso\:\n\njava -Xshareclasses[\:op\u00E7\u00E3o,...]\n\n As op\u00E7\u00F5es v\u00E1lidas inclu\u00EDdas (com um breve resumo) s\u00E3o\:\n\n
SHRC399=Bytes de dados %*c\= %d
SHRC037=Atualiza\u00E7\u00F5es incrementais desativadas
SHRC398=\# M\u00E9todos de AOT %*c\= %d
SHRC036=Redu\u00E7\u00E3o simult\u00E2nea de conten\u00E7\u00E3o de armazenamento desativada
SHRC397=Bytes de AOT %*c\= %d
SHRC035=Armazenamento em cache local de caminhos de classe desativado
SHRC396=%% Classes antigas %*c\= %d%%\n
SHRC034=Verifica\u00E7\u00E3o do time stamp desativada
SHRC395=\# Classes antigas %*c\= %d
SHRC033=Bloqueio de tabelas hash locais desativado
SHRC394=\# Tokens %*c\= %d
SHRC032=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem n\u00EDvel de modifica\u00E7\u00E3o incorreto.
SHRC393=\# URLs %*c\= %d
SHRC031=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem vers\u00E3o de JVM incompat\u00EDvel.
OFFC009=Transfer\u00EAncia\: erro irrecuper\u00E1vel, n\u00E3o \u00E9 poss\u00EDvel capturar o evento
J9VM139=Falha ao criar um encadeamento\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 %4$zd (0x%5$zx)
SHRC392=\# Classpaths %*c\= %d
SHRC030=O Cache de Classe Compartilhada que voc\u00EA est\u00E1 anexando possui um cabe\u00E7alho inv\u00E1lido.
OFFC008=Simulador de Transfer\u00EAncia\: Tempo de suspens\u00E3o inv\u00E1lido, escolha um tempo >\= 1 milissegundo.
J9VM138=A op\u00E7\u00E3o -Xdiagnosticscollector n\u00E3o \u00E9 suportada por esta JVM.
SHRC391=\# ROMClasses %*c\= %d
OFFC007=Simulador de Transfer\u00EAncia\: A frequ\u00EAncia do clock \u00E9 %llu tiques/segundo, have_nanosleep\=%d
J9VM137=A classe %2$.*1$s tem padr\u00F5es conflitantes para o m\u00E9todo %4$.*3$s%6$.*5$s
SHRC390=%% metadados usados %*c\= %d%%
OFFC006=Simulador de Transfer\u00EAncia\: Registrando chamadas JNI para %s.
J9VM136=A configura\u00E7\u00E3o /proc/sys/kernel/core_pattern "%s" especifica uma sequ\u00EAncia de formata\u00E7\u00F5es para renomear core dumps. O A JVM pode ser incapaz de localizar core dumps e renome\u00E1-los.
OFFC005=Simulador de Transfer\u00EAncia\: Taxa de atraso usando suspens\u00E3o.
J9VM135=A configura\u00E7\u00E3o de /proc/sys/kernel/core_pattern "%s" especifica que os core dumps devem ser canalizados para um programa externo. O A JVM pode ser incapaz de localizar core dumps e renome\u00E1-los.
OFFC004=Simulador de Transfer\u00EAncia\: Taxa de atraso usando rota\u00E7\u00E3o.
J9VM134=A op\u00E7\u00E3o de n\u00FAcleo completo do sistema \u00E9 configurada para FALSE, os dumps do sistema podem estar truncados.
OFFC003=Simulador de Transfer\u00EAncia\: Aplicando taxa de %d microssegundos a cada chamada JNI.
J9VM133=O tamanho bruto do n\u00FAcleo ilimitado do sistema \u00E9 configurado para %d, os dumps do sistema podem estar  truncados.
OFFC002=Simulador de Transfer\u00EAncia\: Aplicando taxa de %d milissegundos a cada chamada JNI.
J9VM132=Modo de palavra de bloqueio inv\u00E1lido especificado, java/lang/Class e java/lang/String n\u00E3o podem ter palavras de bloqueio quando o -Xtenant est\u00E1 presente\: %s
OFFC001=Utilit\u00E1rio de simulador de transfer\u00EAncia instalado. Utilize -Xoffload\:sim\:help para o uso
J9VM131=Finalizar processo usando o CEE3AB2() com encerramento de forma anormal %1$u, motivo %2$u, limpeza %3$u.
OFFC000=-Xoffload\:sim\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
J9VM130=O aplicativo voltou a operar ap\u00F3s a manipula\u00E7\u00E3o de uma condi\u00E7\u00E3o irrecuper\u00E1vel e retornou ilegalmente, ou foi chamado de volta, em Java (c\u00F3digo JIT'ed)
SHRC029=N\u00E3o h\u00E1 mem\u00F3ria suficiente no sistema
SHRC028=Permiss\u00E3o Negada
SHRC389=Bytes de metadados %*c\= %d
SHRC027=O nome do cache compartilhado \u00E9 muito longo
SHRC388=bytes de ROMClass %*c\= %d
SHRC026=N\u00E3o \u00E9 poss\u00EDvel criar cache do tamanho solicitado\: Verifique as configura\u00E7\u00F5es de SHMMAX e SHMMIN
SHRC387=bytes livres %*c\= %d
SHRC025=erro ao conectar mem\u00F3ria compartilhada
SHRC386=tamanho do cache %*c\= %d
SHRC024=erro de desconex\u00E3o de mem\u00F3ria compartilhada
SHRC385=ponteiro de aloca\u00E7\u00E3o %*c\= 0x%p\n
SHRC023=O cache n\u00E3o existe
SHRC384=endere\u00E7o final %*c\= 0x%p
SHRC022=Erro ao criar a regi\u00E3o de mem\u00F3ria compartilhada
SHRC383=\n endere\u00E7o de base %*c\= 0x%p
SHRC021=Foi retornado um c\u00F3digo de erro desconhecido
J9VM129=O aplicativo voltou a operar ap\u00F3s a manipula\u00E7\u00E3o de uma condi\u00E7\u00E3o irrecuper\u00E1vel e retornou ilegalmente, ou foi chamado de volta, em Java
SHRC382=Bytes da \u00E1rea de depura\u00E7\u00E3o da classe LocalVariableTable %*c\= %u\n
SHRC020=Ocorreu um erro ao abrir o sem\u00E1foro
J9VM128=Espa\u00E7o de heap Java
SHRC381=Bytes da classe LineNumberTable        %*c\= %u
J9VM127=O tamanho inicial do subalocador de 32 bits n\u00E3o pode ser configurado para zero.
SHRC380=\u00C1rea de depura\u00E7\u00E3o da classe %% usada             %*c\= %u%%
J9VM126=O tamanho confirmado do subalocador de 32 bits n\u00E3o pode ser configurado para zero.
J9VM125=O tamanho confirmado do subalocador de 32 bits \u00E9 maior que o tamanho inicial. Tamanho confirmado \= %1$u, tamanho inicial \= %2$u.
J9VM124=N\u00E3o \u00E9 poss\u00EDvel definir a classe %.*s - '%.*s' \u00E9 um pacote do sistema protegido
J9VM123=Tentando executar em um processador n\u00E3o suportado, JVM ser\u00E1 encerrado.
J9VM122=Falha ao obter a varia\u00E7\u00E3o de endere\u00E7os de user32.dll necess\u00E1ria para -Xprotectcontiguous.
J9VM121=-Xscmaxjitdata ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM120=-Xscminjitdata ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC019=o tamanho da solicita\u00E7\u00E3o \u00E9 muito pequeno
SHRC018=n\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria
SHRC379=Tamanho da \u00E1rea de depura\u00E7\u00E3o da classe               %*c\= %u
SHRC017=C\u00F3digo de erro\: %d
SHRC378=\n Op\u00E7\u00F5es de linha de comandos relacionadas\:\n
SHRC016=Erro do Cache de Classe Compartilhado\:
SHRC377=O valor do -Xscdmx de %u bytes \u00E9 maior que %u bytes de espa\u00E7o livre dispon\u00EDvel. Um valor de %u bytes ser\u00E1 usado para o -Xscdmx.
SHRC015=Erro do Cache de Classe Compartilhado\: Sinalizador inv\u00E1lido
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC014=A remo\u00E7\u00E3o de %s de sem\u00E1foro do cache compartilhado falhou
SHRC375=O nome do cache \u00E9 muito longo quando o nome de usu\u00E1rio est\u00E1 inclu\u00EDdo. H\u00E1 %d bytes restantes nesse buffer e seu nome de usu\u00E1rio cont\u00E9m %d bytes.
SHRC013=A remo\u00E7\u00E3o de "%s" de mem\u00F3ria do cache compartilhado falhou
SHRC374=Cache criado com\:
SHRC012=N\u00E3o \u00E9 poss\u00EDvel remover o cache compartilhado "%s", pois ainda h\u00E1 JVMs conectados ao cache
SHRC373=Bytes de dados JIT \= %d
SHRC011=Erro\: N\u00E3o \u00E9 poss\u00EDvel abrir o cache de classes compartilhado
J9VM119=-Xscmaxjit ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC372=\# caches do Zip    \= %d
SHRC010=O cache compartilhado "%s" foi destru\u00EDdo
J9VM118=-Xscminjit ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC371=Bytes do cache de Zip \= %d
J9VM117=-Xitsn ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC370=-Xnolinenumbers    \= false
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister e TraceListener n\u00E3o s\u00E3o mais suportados, usa novas vers\u00F5es em JVMRAS_VERSION_1_5
J9VM116=noLockword\:%.*s
J9RI022=O JVMRI de inicializa\u00E7\u00E3o n\u00E3o pode alocar monitor de dump jvmri
J9VM115=palavra de bloqueio\:%.*s
J9RI021=jvmri->RunDumpRoutine n\u00E3o suportado.
J9VM114=Modo de Palavra de Bloqueio\=%s
J9RI020=jvmri->CreateThread n\u00E3o consegue alocar monitor privado
J9VM113=-----------------------------
J9VM112=Configura\u00E7\u00E3o de Palavra de Bloqueio
J9VM111=Op\u00E7\u00E3o de palavra de bloqueio inv\u00E1lida especificada\:%s
J9VM110=Modo de palavra de bloqueio inv\u00E1lido especificado\:%s
SHRC009=Cache compartilhado aberto\: %1$s de tamanho\: %2$d bytes
SHRC008=Cache compartilhado criado\: %1$s de tamanho\: %2$d bytes
SHRC369=-Xnolinenumbers    \= true
SHRC007=Falha em remover o cache de classe compartilhado "%s"
SHRC368=Encerrando o cache de classes compartilhado sem depura\u00E7\u00E3o ativada.
SHRC006=O n\u00FAmero de cache expirado nos \u00FAltimos %1$d minutos \u00E9 %2$d
SHRC367=depura\u00E7\u00E3o ativada  \= false
SHRC005=N\u00E3o existem caches de classe de compartilhamento
SHRC366=depura\u00E7\u00E3o ativada  \= true
J9RI019=jvmri->InjectOutOfMemory n\u00E3o suportado.
SHRC004=N\u00E3o \u00E9 poss\u00EDvel destruir o cache %s
SHRC365=Ativa o armazenamento de informa\u00E7\u00F5es sobre depura\u00E7\u00E3o de classe na classe compartilhada.
J9RI018=jvmri->NotifySignal emitindo o sinal %d.
SHRC003=\u00FAltima desconex\u00E3o
SHRC364=A chamada de SH_OSCachesysv\:\:acquireWriteLock() para j9shsem_wait em semid %d falhou com o erro %d.
J9RI017=N\u00E3o \u00E9 poss\u00EDvel alocar agente de dump em jvmri->SetOutOfMemoryHook, fun\u00E7\u00E3o n\u00E3o registrada.
SHRC002=em uso
SHRC363=N\u00E3o \u00E9 poss\u00EDvel alocar api para classes compartilhadas em shrinit
J9RI016=jvmri->SetOutOfMemoryHook foi chamado com retorno de chamada nulo, fun\u00E7\u00E3o n\u00E3o registrada.
SHRC001=OS shmid
J9VM109=Sistema operacional n\u00E3o suportado (%s)\: o Windows XP ou mais recente \u00E9 necess\u00E1rio.
SHRC362=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem
J9RI015=jvmri->RunDumpRoutine\: componentId est\u00E1 fora dos limites.
SHRC000=Cache Compartilhado
J9VM108=-Xlog\:info,warn,error\n
SHRC361=Erro ao conectar-se \u00E0 mem\u00F3ria compartilhada durante abertura/cria\u00E7\u00E3o
J9RI014=jvmri->RunDumpRoutine\: imposs\u00EDvel recuperar dados do componente.
J9VM107=-Xlog\:error,warn
SHRC360=Falha ao localizar os dados de bytes para a chave %.*s no cache compartilhado...
J9RI013=jvmri->ReleaseRasInfo\: a estrutura tem campo de tipo n\u00E3o suportado.
J9VM106=As op\u00E7\u00F5es de info, warn, error, vital e config podem ser combinadas com uma ",", por exemplo\:\n
J9RI012=jvmri->ReleaseRasInfo foi chamado com a estrutura RasInfo nula.
J9VM105=-Xlog\:config            Registrar as mensagens de configura\u00E7\u00E3o da JVM.\n
J9RI011=A estrutura RasInfo tem campo de tipo n\u00E3o suportado.
J9VM104=-Xlog\:vital             Registrar as mensagens vitais da JVM. Este \u00E9 ligado por padr\u00E3o.
J9RI010=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
J9VM103=-Xlog\:error             Registrar as mensagens de erro da JVM. Este \u00E9 ligado por padr\u00E3o.
J9VM102=-Xlog\:warn              Registrar as mensagens de aviso da JVM.
J9VM101=-Xlog\:info              Registrar todas as mensagens informativas da JVM.
J9VM100=-Xlog\:all               Registrar todas as mensagens da JVM.
SHRC359=Dados de bytes para a chave %.*s localizados no cache compartilhado...
SHRC358=Falha ao armazenar os dados de bytes para a chave %.*s no cache compartilhado.
SHRC357=Os dados de bytes para a chave %.*s foram armazenados no cache compartilhado.
SHRC356=Falha ao armazenar o c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado.
J9RI009=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
SHRC355=O c\u00F3digo AOT para ROMMethod 0x%1$p foi armazenado no cache compartilhado.
J9RI008=jvmri->GetRasInfo n\u00E3o consegue obter componentes.
SHRC354=Falha ao localizar o c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado.
J9RI007=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
SHRC353=O c\u00F3digo AOT para ROMMethod 0x%1$p foi localizado no cache compartilhado.
J9RI006=jvmri->GetRasInfo foi chamado com a estrutura RasInfo nula.
SHRC352=Falha ao armazenar a classe %2$.*1$s no cache compartilhado para o ID de carregador de classes %3$d com Token %5$.*4$s.
J9RI005=O componente %s de jvmri->GetComponentDataArea n\u00E3o tem dataArea nesta vm.
SHRC351=A classe %2$.*1$s foi armazenada no cache compartilhado para o ID de carregador de classes %3$d com Token %5$.*4$s.
J9RI004=jvmri->DynamicVerbosegc n\u00E3o suportado.
SHRC350=Falha ao armazenar a classe %2$.*1$s no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s.
J9RI003=N\u00E3o \u00E9 poss\u00EDvel alocar agente de dump em jvmri->DumpRegister, fun\u00E7\u00E3o n\u00E3o registrada.
J9RI002=jvmri->DumpRegister foi chamado com retorno de chamada nulo, fun\u00E7\u00E3o n\u00E3o registrada.
J9RI001=Erro interno ao remover o agente de dump em jvmri->DumpDeregister, fun\u00E7\u00E3o pode n\u00E3o ter registro removido.
J9RI000=jvmri->CreateThread n\u00E3o pode alocar mem\u00F3ria de argumentos de encadeamento
SHRC349=A classe %2$.*1$s foi armazenada no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s.
SHRC348=Falha ao armazenar a classe %2$.*1$s no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s (\u00EDndice %6$d).
SHRC347=A classe %2$.*1$s foi armazenada no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s (\u00EDndice %6$d).
SHRC346=Falha ao localizar a classe %1$s no cache compartilhado para o ID de carregador de classes %2$d com Token %4$.*3$s.
SHRC345=A classe %1$s foi localizada no cache compartilhado para o ID de carregador de classes %2$d com Token %4$.*3$s.
SHRC344=Falha ao localizar a classe %1$s no cache compartilhado para o ID de carregador de classes %2$d com URL %4$.*3$s.
SHRC343=A classe %1$s foi localizada no cache compartilhado para o ID de carregador de classes %2$d com URL %4$.*3$s.
SHRC342=Falha ao localizar a classe %1$s no cache compartilhado para o ID de carregador de classes %2$d.
SHRC341=A classe %1$s foi localizada no cache compartilhado para o ID de carregador de classes %2$d.
SHRC340=A verifica\u00E7\u00E3o de CRC de Cache Compartilhado falhou. CRC armazenado %1$x, CRC calculado %2$x
SHRC339=Mensagem de erro de plataforma\: %1$s
SHRC338=C\u00F3digo de erro de camada da porta \= %1$d
SHRC699=Falha ao restaurar o cache compartilhado n\u00E3o persistente "%s" a partir da captura instant\u00E2nea
SHRC337=Mensagem de erro de plataforma\: %1$s
SHRC698=O cache compartilhado n\u00E3o persistente "%s" foi restaurado com sucesso a partir da captura instant\u00E2nea
SHRC336=C\u00F3digo de erro de camada da porta \= %1$d
SHRC697=Falha ao obter um diret\u00F3rio para o cache compartilhado
SHRC335=Falha na recupera\u00E7\u00E3o de erro\: A destrui\u00E7\u00E3o do sem\u00E1foro compartilhado falhou.
SHRC696=As subop\u00E7\u00F5es "%s" e "%s" s\u00E3o incompat\u00EDveis. A subop\u00E7\u00E3o "%s" \u00E9 ignorada
SHRC334=Falha na recupera\u00E7\u00E3o de erro\: A destrui\u00E7\u00E3o da mem\u00F3ria compartilhada falhou.
J2SE000=-Djava.runtime.version=pxp6480sr2-20151023_01 (SR2)
SHRC695=Restaurar um novo cache compartilhado n\u00E3o persistente a partir de uma captura instant\u00E2nea
SHRC333=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria padr\u00E3o ativada com \u00EAxito para o cache
SHRC694=Destruir todas as capturas instant\u00E2neas do cache compartilhado
SHRC332=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria de dados ativada com \u00EAxito para o cache
SHRC693=Destruir a captura instant\u00E2nea de um cache compartilhado (usar par\u00E2metro de nome ou padr\u00E3o)
SHRC331=Adquirido um sem\u00E1foro diferente daquele usado anteriormente com este cache.
SHRC692=Criar captura instant\u00E2nea de um cache compartilhado n\u00E3o persistente existente
SHRC330=SH_CompositeCacheImpl\:\:runExitCode falhou ao adquirir o mutex de \u00E1rea de grava\u00E7\u00E3o (c\u00F3digo de retorno %d).
SHRC691=Restringir Caminhos de classe                  \= false
SHRC690=Restringir Caminhos de classe \= true
JITM018=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %4$zu%5$s %6$s no lugar
JITM017=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %4$zu%5$s no lugar
JITM016=O tamanho de p\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %3$zu%4$s %5$s no lugar
JITM015=O tamanho de p\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %3$zu%4$s no lugar
JITM014=Caracteres extras de v\u00EDrgula foram descobertos na op\u00E7\u00E3o '-Xlp' - ignorado
JITM013=A op\u00E7\u00E3o '%1$s' n\u00E3o est\u00E1 completa, deve especificar o par\u00E2metro '%2$s'.
JITM012=O valor para '%s' n\u00E3o est\u00E1 correto
JITM011=O valor de %s especificado \u00E9 muito grande
JITM010=%s deve ser seguido por um n\u00FAmero
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex falhou ao adquirir o mutex de tabela da cadeia (c\u00F3digo de retorno %d).
SHRC328=O IPC do System V relatou o seguinte erro '%s'
SHRC689=Permite que uma JVM armazene caminhos de classe no cache criado com a op\u00E7\u00E3o "restrictClasspaths".
SHRC327=A chamada de SH_OSCachesysv\:\:acquireWriteLock() para j9shsem_wait falhou com o erro %d.
SHRC688=Caminhos de classe podem ser inclu\u00EDdos apenas pela primeira JVM inicializando o cache.
SHRC326=Falha ao postar o usu\u00E1rio do cache de classes compartilhado, o bloqueio falhou durante a inicializa\u00E7\u00E3o. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC687=Um novo cache de classe compartilhada n\u00E3o pode ser criado ao executar com a op\u00E7\u00E3o -Xshareclasses\:readonly
SHRC325=Falha ao postar o cabe\u00E7alho do cache de classes compartilhado, o bloqueio falhou durante a inicializa\u00E7\u00E3o. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC686=Falha ao inicializar o cache de classe compartilhada. Continuar sem us\u00E1-lo como -Xshareclasses\:nonfatal \u00E9 especificado
SHRC324=ERRO\: Falha ao sair do mutex para o cabe\u00E7alho do cache de classe compartilhada. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC685=Ocorreu um erro ao abrir a mem\u00F3ria compartilhada. O arquivo de controle n\u00E3o p\u00F4de ser bloqueado.
SHRC323=ERRO\: Falha ao inserir o mutex para o cabe\u00E7alho do cache de classe compartilhada. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC684=Ocorreu um erro ao abrir o sem\u00E1foro. O arquivo de controle n\u00E3o p\u00F4de ser bloqueado.
SHRC322=Falha ao inicializar sem\u00E1foros para o cache de classe compartilhado. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC683=O limite do sistema no n\u00FAmero total de arquivos abertos foi atingido.
SHRC321=Recupera\u00E7\u00E3o de erro\: fechando sem\u00E1foros de mem\u00F3ria compartilhada.
SHRC682=O limite do sistema para o n\u00FAmero m\u00E1ximo de regi\u00F5es da mem\u00F3ria compartilhada ou o limite do sistema inteiro na mem\u00F3ria alocada para regi\u00F5es de mem\u00F3ria compartilhada foi atingido.
SHRC320=Recupera\u00E7\u00E3o de erro\: destruindo sem\u00E1foros de mem\u00F3ria compartilhada.
SHRC681=O limite do sistema para o n\u00FAmero m\u00E1ximo de sem\u00E1foros ou do n\u00FAmero m\u00E1ximo em todo o sistema de sem\u00E1foros foi atingido.
SHRC680=Recupera\u00E7\u00E3o de erro com falha\: Falha ao remover o arquivo de controle de configura\u00E7\u00E3o de sem\u00E1foro %s associado ao cache de classe compartilhada.
JITM009=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o par\u00E2metro '%.*s' na op\u00E7\u00E3o '-Xlp'
JITM008=O JIT falhou ao alocar mem\u00F3ria
JITM007=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado com as configura\u00E7\u00F5es atuais de JVMPI ou JVMTI. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM006=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado com a pol\u00EDtica de coleta de lixo atual. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM005=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado no release atual da JVM. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM004=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado no processador atual. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM003=Falha durante a inicializa\u00E7\u00E3o do tempo de execu\u00E7\u00E3o de AOT. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM002=Falha ao armazenar c\u00F3digo AOT no cache de classe compartilhado. O cache de classe compartilhado pode estar danificado. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM001=N\u00E3o h\u00E1 mais espa\u00E7o para o c\u00F3digo AOT no cache de classe compartilhado. O novo c\u00F3digo AOT n\u00E3o ser\u00E1 gerado.
JITM000=hardware N\u00E3o Suportado [%d].
SHRC319=Recupera\u00E7\u00E3o de erro\: fechando a mem\u00F3ria compartilhada.
SHRC318=Recupera\u00E7\u00E3o de erro\: destruindo a mem\u00F3ria compartilhada.
SHRC679=Recupera\u00E7\u00E3o de erro com falha\: Falha ao remover o arquivo de controle de configura\u00E7\u00E3o de sem\u00E1foro %s associado ao cache de classe compartilhada.
SHRC317=Imprima o nome do arquivo de cache de classe compartilhado que ser\u00E1 usado.
SHRC678=Mensagem de erro de plataforma\: %1$s
SHRC316=N\u00E3o \u00E9 poss\u00EDvel serializar o cache porque n\u00E3o h\u00E1 nenhum encadeamento de VM atual.
SHRC677=C\u00F3digo de erro de camada da porta \= %1$d
SHRC315=N\u00E3o \u00E9 poss\u00EDvel inicializar segmentos de mem\u00F3ria de classe cachelet
SHRC676=Falha ao destruir a mem\u00F3ria compartilhada com shmid\=%d associado ao cache de classe compartilhada.
SHRC314=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a tabela de consulta de sugest\u00F5es em SH_Manager
SHRC675=Falha ao destruir a mem\u00F3ria compartilhada associada ao cache de classe compartilhada.
SHRC313=Falha ao criar jclCacheMutex em shrinit
SHRC674=O usu\u00E1rio n\u00E3o tem permiss\u00E3o para destruir a mem\u00F3ria compartilhada com shmid\=%d. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos podem destruir a mem\u00F3ria compartilhada.
SHRC312=Erro ao liberar o bloqueio de grava\u00E7\u00E3o de cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC673=Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associada ao cache de classe compartilhada.
SHRC311=Erro ao liberar o bloqueio de grava\u00E7\u00E3o de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC672=Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro associada ao cache de classe compartilhada.
SHRC310=O cache persistente n\u00E3o pode estar localizado em um sistema de arquivos de rede. Selecione um cacheDir diferente.
SHRC671=O usu\u00E1rio n\u00E3o tem permiss\u00E3o para destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos pode destruir a configura\u00E7\u00E3o de sem\u00E1foro.
SHRC670=Recupera\u00E7\u00E3o de erro\: tentando usar o cache compartilhado no modo somente leitura se existir a regi\u00E3o de mem\u00F3ria compartilhadas, em resposta \u00E0 op\u00E7\u00E3o "-Xshareclasses\:nonfatal".
SHRC309=As op\u00E7\u00F5es "grow" e "readonly" n\u00E3o podem ser usadas juntas.
SHRC308=Falha ao serializar o cache "%s". Falha ao atualizar os deslocamentos de Classe ROM em m\u00E9todos AOT.
SHRC669=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a mem\u00F3ria compartilhada com shmid\=%d associada com o cache de classe compartilhada.
SHRC307=\tROMMETHOD\: %2$.*1$s Assinatura\: %4$.*3$s Endere\u00E7o\: 0x%5$p
SHRC668=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a mem\u00F3ria compartilhada com shmid\=%d associada com o cache de classe compartilhada. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos podem destruir a mem\u00F3ria compartilhada.
SHRC306=\ Assinatura\: %2$.*1$s Endere\u00E7o\: 0x%3$p
SHRC667=Recupera\u00E7\u00E3o de erro\: mem\u00F3ria compartilhada destru\u00EDda com id\=%d associado ao cache de classe compartilhada.
SHRC305=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a tabela de consulta de sugest\u00F5es em SH_ClasspathManagerImpl2
SHRC666=Recupera\u00E7\u00E3o de erro\: mem\u00F3ria compartilhada destru\u00EDda associada ao cache de classe compartilhada.
SHRC304=Falha ao substituir o cache "%s"
SHRC665=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associado com o cache de classe compartilhada.
SHRC303=Falha ao criar o cache aninhado "%s"
SHRC664=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associado com o cache de classe compartilhada. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos pode destruir a configura\u00E7\u00E3o de sem\u00E1foro.
SHRC302=N\u00E3o \u00E9 poss\u00EDvel aumentar o cache aninhado "%s", falha ao alocar o bloco para sugest\u00F5es
SHRC663=Recupera\u00E7\u00E3o de erro\: configura\u00E7\u00E3o de sem\u00E1foro destru\u00EDda com o id\=%d associada ao cache de classe compartilhada.
SHRC301=N\u00E3o \u00E9 poss\u00EDvel aumentar o cache aninhado "%s", falha ao alocar o novo supercache para sugest\u00F5es
SHRC662=Recupera\u00E7\u00E3o de erro\: configura\u00E7\u00E3o de sem\u00E1foro destru\u00EDda associada ao cache de classe compartilhada.
SHRC300=O cache de classe compartilhado est\u00E1 em uso por uma outra vm, n\u00E3o poss\u00EDvel aumentar o cache aninhado
SHRC661=A JVM falhou ao associar a mem\u00F3ria compartilhada id\=%d com o cache de classe compartilhada.
SHRC660=A JVM falhou ao associar a configura\u00E7\u00E3o de sem\u00E1foro id\=%d com o cache de classe compartilhada.
SHRC659=Ocorreu um erro ao abrir a mem\u00F3ria compartilhada
VMUT013=Arquivo de op\u00E7\u00F5es %s inv\u00E1lido
SHRC658=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es do arquivo de cache compartilhado.
VMUT012=%2$.*1$s n\u00E3o \u00E9 uma superinterface direta de %4$.*3$s.
SHRC657=A JVM n\u00E3o permite acesso ao arquivo de cache compartilhado porque o ID do usu\u00E1rio e o ID do grupo do processo da JVM s\u00E3o diferentes do ID do usu\u00E1rio e do ID do grupo do propriet\u00E1rio do arquivo de cache compartilhado e o ID do usu\u00E1rio do processo da JVM n\u00E3o pertence ao grupo do propriet\u00E1rio do arquivo de cache compartilhado.
VMUT011=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para a matriz de op\u00E7\u00F5es da linha de comandos
SHRC656=A JVM n\u00E3o est\u00E1 configurada para acessar o arquivo de cache compartilhado. Para se conectar ao cache de classe compartilhada, use a subop\u00E7\u00E3o 'groupAccess'.
VMUT010=Valor da op\u00E7\u00E3o malformado, a op\u00E7\u00E3o "%1$s%3$.*2$s" cont\u00E9m os caracteres \u00E0 direita "%4$s" que foram ignorados
SHRC655=O cache est\u00E1 acess\u00EDvel ao usu\u00E1rio atual \= %s
SHRC654=A JVM n\u00E3o permite acesso \u00E0 regi\u00E3o de mem\u00F3ria compartilhada do cache compartilhado criado e pertencente a outro usu\u00E1rio que n\u00E3o est\u00E1 em seu grupo.
SHRC653=A JVM n\u00E3o est\u00E1 configurada para acessar a mem\u00F3ria compartilhada associada ao cache de classe compartilhada n\u00E3o persistente existente. Para se conectar ao cache de classe compartilhada n\u00E3o persistente, use as subop\u00E7\u00F5es 'groupAccess' e 'readonly'.
SHRC652=A JVM n\u00E3o est\u00E1 configurada para acessar a mem\u00F3ria compartilhada associada ao cache de classe compartilhada n\u00E3o persistente existente. Para se conectar ao cache de classe compartilhada n\u00E3o persistente, use a subop\u00E7\u00E3o 'groupAccess'.
SHRC651=A JVM detectou que o ID de usu\u00E1rio efetivo do processo \u00E9 o propriet\u00E1rio, mas n\u00E3o o criador da mem\u00F3ria compartilhada associada ao cache compartilhado. A JVM n\u00E3o ser\u00E1 conectada ao cache compartilhado para evitar acesso ao cache compartilhado n\u00E3o desejado.
SHRC650=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es da mem\u00F3ria compartilhada associada ao cache compartilhado.
VMUT009=Valor malformado para -Xservice
VMUT008=Valor malformado para IBM_JAVA_OPTIONS
VMUT007=Valor malformado para JAVA_TOOL_OPTIONS
VMUT006=Op\u00E7\u00E3o malformada %s localizada em -Xoptionsfile
VMUT005=Op\u00E7\u00E3o muito grande\: '%s'
VMUT004=Op\u00E7\u00E3o malformada\: '%s'
SHRC649=A JVM n\u00E3o permite acesso \u00E0 configura\u00E7\u00E3o de sem\u00E1foro do cache compartilhado criada e pertencente a outro usu\u00E1rio que n\u00E3o est\u00E1 em seu grupo.
VMUT003=Arquivo de op\u00E7\u00F5es n\u00E3o localizado
SHRC648=A JVM n\u00E3o est\u00E1 configurada para acessar a configura\u00E7\u00E3o de sem\u00E1foro associada ao cache de classe compartilhada n\u00E3o persistente existente. Para se conectar ao cache de classe compartilhada n\u00E3o persistente, use a subop\u00E7\u00E3o 'groupAccess'.
VMUT002=(erro de acesso)
SHRC647=A JVM detectou que o ID de usu\u00E1rio efetivo do processo \u00E9 o propriet\u00E1rio, mas n\u00E3o o criador da configura\u00E7\u00E3o de sem\u00E1foro associado ao cache compartilhado. A JVM n\u00E3o ser\u00E1 conectada ao cache compartilhado para evitar acesso ao cache compartilhado n\u00E3o desejado.
VMUT001=(encadeamento sem nome)
SHRC646=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es da configura\u00E7\u00E3o de sem\u00E1foro associada ao cache compartilhado.
VMUT000=(sem mem\u00F3ria)
SHRC645=Ativar o modo de diagn\u00F3stico mprotect
SHRC644=A JVM foi conectada ao cache de classe compartilhada criado no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic). A op\u00E7\u00E3o -Xshareclasses\:mprotect\=none ser\u00E1 ignorada.
SHRC643=A JVM foi conectada ao cache de classe compartilhada criado no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic). Usar o cache nesse modo pode afetar o desempenho.
SHRC642=A JVM criou o cache de classe compartilhada no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic). Usar o cache nesse modo pode afetar o desempenho.
SHRC641=A JVM est\u00E1 tentando usar o cache de classe compartilhada existente no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic), mas o cache n\u00E3o estava criando nesse modo. Nesse caso, a op\u00E7\u00E3o mprotect\=diagnostic ser\u00E1 ignorada no z/OS.
SHRC640=A JVM est\u00E1 usando o cache de classe compartilhada existente no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic), mas o cache n\u00E3o estava criando nesse modo. Usar o cache nesse modo pode afetar o desempenho.
SMAP005=
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP000=
J9GC086=Falha ao instanciar metadados de refer\u00EAncia compactados; %1$zu%2$s solicitado
SHRC639=Op\u00E7\u00F5es de utilit\u00E1rios de cache compartilhado apenas podem ser usadas em combina\u00E7\u00E3o com -Xmt. Coloque outras op\u00E7\u00F5es de cache compartilhado no arquivo javad.options.
J9GC085=tamanho inicial dos metadados de refer\u00EAncias compactadas
SHRC638=A cria\u00E7\u00E3o de cache com a op\u00E7\u00E3o cacheRetransformed for\u00E7a o modo disableBCI.
J9GC084=A resolu\u00E7\u00E3o de clock do S.O. indica n\u00E3o suportar o tempo de pausa do destino solicitado.  Substituindo devido \u00E0 op\u00E7\u00E3o da linha de comandos -Xgc\:overrideHiresTimerCheck
SHRC637=A subop\u00E7\u00E3o-Xshareclasses\:cacheRetransformed \u00E9 incompat\u00EDvel com um BCI existente com cache compartilhado habilitado.
J9GC083=Falha ao inicializar, a ocupa\u00E7\u00E3o variada suporta apenas -Xgcpolicy\:balanced
SHRC636=A subop\u00E7\u00E3o "disableBCI" \u00E9 incompat\u00EDvel com o BCI existente com cache compartilhado habilitado.
J9GC082=A solicita\u00E7\u00E3o para %1$s tamanho de p\u00E1gina %2$zu%3$s%4$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %5$zu%6$s%7$s no lugar
SHRC635=Arquivo de classe intermedi\u00E1rio de armazenamento \= true
J9GC081=Caracteres extras de v\u00EDrgula foram descobertos na op\u00E7\u00E3o '-Xlp' - ignorado
SHRC634=A op\u00E7\u00E3o "-XX\:-StoreIntermediateClassfile" foi especificada, mas o cache existente foi criado com a op\u00E7\u00E3o "-XX\:+StoreIntermediateClassfile".
J9GC080=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o par\u00E2metro '%.*s' na op\u00E7\u00E3o '-Xlp'
SHRC633=A op\u00E7\u00E3o "-XX\:+StoreIntermediateClassfile" foi especificada, mas o cache existente n\u00E3o foi criado com a op\u00E7\u00E3o"-XX\:+StoreIntermediateClassfile".
SHRC632=O espa\u00E7o reservado para dados JIT no cache compartilhado "%s" est\u00E1 completo. Use -Xscminjitdata para aumentar o espa\u00E7o reservado para dados JIT.
SHRC631=O espa\u00E7o reservado para dados AOT no cache compartilhado "%s" est\u00E1 completo. Use -Xscminaot para aumentar o espa\u00E7o reservado para dados AOT.
SHRC630=O espa\u00E7o est\u00E1 completo para armazenar dados n\u00E3o AOT/n\u00E3o JIT, como classes, no cache compartilhado "%s".
J9GC079=A op\u00E7\u00E3o '%1$s' n\u00E3o est\u00E1 completa, deve especificar o par\u00E2metro '%2$s'.
J9GC078='%1$s' n\u00E3o est\u00E1 especificado como o primeiro par\u00E2metro na op\u00E7\u00E3o '%2$s'
J9GC077=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o tamanho de p\u00E1gina grande %1$zu%2$s %3$s solicitado
J9GC076=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o tamanho de p\u00E1gina grande %1$zu%2$s solicitado
SHRC629=O arquivo de controle de mem\u00F3ria compartilhada \u00E9 somente leitura.
J9GC075=Ocorreu um erro ao analisar a op\u00E7\u00E3o '-Xlp'
SHRC628=O arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 leg\u00EDvel.
J9GC074=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %4$zu%5$s %6$s no lugar
SHRC627=A recria\u00E7\u00E3o do arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 permitida quando estiver executando em modo de somente leitura.
J9GC073=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %4$zu%5$s no lugar
SHRC626=As estat\u00EDsticas do cache compartilhado n\u00E3o podem ser obtidas j\u00E1 que um cache compartilhado v\u00E1lido n\u00E3o existe.
J9GC072=O tamanho de p\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %3$zu%4$s %5$s no lugar
SHRC625=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Falha na verifica\u00E7\u00E3o do tamanho da mem\u00F3ria compartilhada.
J9GC071=O valor para '%s' n\u00E3o est\u00E1 correto
SHRC624=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Falha na verifica\u00E7\u00E3o do ID do usu\u00E1rio.
J9GC070=Falha ao inicializar o Coletor de Lixo
SHRC623=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Falha na verifica\u00E7\u00E3o do ID do grupo.
SHRC622=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Incompatibilidade na chave da mem\u00F3ria compartilhada.
SHRC621=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Incompatibilidade no ID da mem\u00F3ria compartilhada.
SHRC620=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. O arquivo de controle foi considerado corrompido.
J9GC069=Falha ao inicializar encadeamento de finaliza\u00E7\u00E3o
J9GC068=ScopedMemory.join/joinAndEnter interrompido
J9GC067=Falha ao instanciar o heap dividido\: %1$s (novo tamanho %2$zu%3$s, tamanho antigo %4$zu%5$s)
J9GC066=A geometria de mem\u00F3ria de heap dividida necess\u00E1ria n\u00E3o p\u00F4de ser alocada
SHRC619=O arquivo de controle do sem\u00E1foro \u00E9 somente leitura.
J9GC065=Falha ao alocar novo espa\u00E7o
SHRC618=O arquivo de controle do sem\u00E1foro n\u00E3o \u00E9 leg\u00EDvel.
J9GC064=Falha ao alocar espa\u00E7o antigo
SHRC617=Ocorreu um erro ao abrir o sem\u00E1foro. Marcador de sem\u00E1foro n\u00E3o localizado na configura\u00E7\u00E3o de sem\u00E1foro.
J9GC063=N\u00E3o foi poss\u00EDvel abrir nome do arquivo '%s' para grava\u00E7\u00E3o
SHRC616=Ocorreu um erro ao abrir o sem\u00E1foro. Incompatibilidade no n\u00FAmero de sem\u00E1foros na configura\u00E7\u00E3o de sem\u00E1foro.
J9GC062=O valor %s deve ser uma pot\u00EAncia de dois
SHRC615=Ocorreu um erro ao abrir o sem\u00E1foro. Incompatibilidade na chave do sem\u00E1foro.
J9GC061=tamanho m\u00E1ximo de espa\u00E7o de mem\u00F3ria com escopo definido
SHRC614=Ocorreu um erro ao abrir o sem\u00E1foro. Incompatibilidade no ID do sem\u00E1foro.
J9GC060=tamanho de espa\u00E7o de mem\u00F3ria permanente
SHRC613=Ocorreu um erro ao abrir o sem\u00E1foro. O arquivo de controle foi considerado corrompido.
SHRC612=Configurar artificialmente a chave de armazenamento (0-15) no z/OS para teste.
SHRC611=A subop\u00E7\u00E3o "disableBCI" foi especificada, mas o cache existente foi criado com a subop\u00E7\u00E3o "enableBCI".
SHRC610=Desativar o suporte para instrumenta\u00E7\u00E3o de bytecode.
J9GC059="A pol\u00EDtica metron\u00F4mica n\u00E3o \u00E9 permitida sem -Xrealtime"
J9GC058=Falha ao alocar espa\u00E7o de mem\u00F3ria permanente
J9GC057=%1$s n\u00E3o pode ser maior do que %2$s
J9GC056=tamanhos de p\u00E1ginas grandes dispon\u00EDveis\:
SHRC609=Atualizados %1$s dados anexados %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC055=tamanho de p\u00E1gina grande
SHRC608=Localizados %1$s dados anexados %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC054=O Tamanho de P\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado, utilizando ent\u00E3o %3$zu%4$s.
SHRC607=Armazenados %1$s dados anexados %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC053=m\u00E1ximo de mem\u00F3ria
SHRC606=Incluir sugest\u00F5es JIT n\u00E3o funcionais nos m\u00E9todos para teste; usar com -Xint e um cache pr\u00E9-preenchido.
J9GC052=incremento do segmento de classe ROM
SHRC605=O tamanho da mem\u00F3ria para "%s" \u00E9 muito grande, ou especifica unidades diferentes de 'K','M' ou 'G'.
J9GC051=incremento do segmento de classe RAM
SHRC604=Reservar <tamanho> bytes de espa\u00E7o de cache para dados brutos de classe
J9GC050=m\u00E1ximo de mem\u00F3ria virtual
SHRC603=Bytes usados de dados brutos de classe           %*c\= %lu
SHRC602=\u00C1rea de dados brutos de classe %% usada          %*c\= %lu%%
SHRC601=Tamanho da \u00E1rea de dados brutos de classe            %*c\= %lu
SHRC600=A \u00E1rea de dados brutos de classe est\u00E1 corrompida porque armazenar %u bytes exceder\u00E1 o espa\u00E7o livre da \u00E1rea dispon\u00EDvel ('in\u00EDcio do espa\u00E7o livre'\=%p, 'fim do espa\u00E7o livre'\=%p).
J9GC049=tamanho configurado lembrado
J9GC048=incremento de espa\u00E7o antigo
J9GC047=tamanho m\u00E1ximo de espa\u00E7o antigo
J9GC046=tamanho de espa\u00E7o inicial antigo
J9GC045=tamanho de mem\u00F3ria inicial
J9GC044=tamanho m\u00E1ximo de espa\u00E7o novo
J9GC043=tamanho de novo espa\u00E7o inicial
J9GC042=A soma de %1$s e %2$s \u00E9 muito pequena para %3$s
J2JX099=Op\u00E7\u00E3o(\u00F5es) incompleta(s) na linha de comandos. Primeiro era\: %s
J9GC041=Tipo fvtest desconhecido\: %s
J2JX098=Argumento inv\u00E1lido [%1$s] para a op\u00E7\u00E3o\: %2$s
J9GC040=Op\u00E7\u00E3o desconhecida\: %s
J2JX097=Op\u00E7\u00E3o(\u00F5es) n\u00E3o reconhecida(s) na linha de comandos. Primeiro era\: %s
J2JX096=Falha em localizar a fun\u00E7\u00E3o j9bcv_verifyCreateStackAttributes
J2JX095=Falha em localizar a fun\u00E7\u00E3o j9bcv_verifyClassStructure
J2JX094=Falha em abrir a DLL do verificador %1$s\: %2$s
J2JX093=Nenhum arquivo de classe especificado na linha de comandos
J2JX092=Erro interno com VM rec\u00E9m criada
J2JX091=Criou o Java VM com \u00EAxito
J2JX090=Tentando criar um Java VM para usar com AOT
J9GC039=*** %1$s reprovado\: utilize %2$s no lugar ***
J9GC038=O valor de %s especificado \u00E9 muito grande
J9GC037=%1$s n\u00E3o suportado com valores diferentes de %2$zu
J9GC036=O valor de %1$s deve ser superior a %2$zu
J9GC035=%s deve ser seguido por um n\u00FAmero
J9GC034=O valor de %1$s deve estar entre %2$zu e %3$zu (inclusive)
J9GC033=O valor de %1$s deve estar entre %2$.2f e %3$.2f (inclusive)
J9GC032=A configura\u00E7\u00E3o do sistema n\u00E3o suporta a op\u00E7\u00E3o '%s'
J2JX089=Erro Interno\: n\u00E3o foi poss\u00EDvel localizar %1$s em %2$s
J9GC031=Erro de op\u00E7\u00E3o\: '%1$s' e '%2$s' n\u00E3o podem ser ambos especificados
J2JX088=Erro Interno\: falha ao abrir %1$s\: %2$s
J9GC030=O valor de %1$s de %2$.2f deve ser, pelo menos, %3$s menor que o valor de %4$s de %5$.2f
J2JX087=Erro Interno\: n\u00E3o foi poss\u00EDvel determinar o nome do execut\u00E1vel
J2JX086=Foram gravados %1$i bytes para simbolizar o arquivo %2$s
J2JX085=Erro Interno\: c\u00F3digo de erro n\u00E3o suportado de cria\u00E7\u00E3o de classe rom %d
J2JX084=Fechando o segmento %d e iniciando um novo segmento
J2JX083=Incluindo %s em AOT
J2JX082=Excluindo %s de AOT
J2JX081=Erro\: %s
J2JX080=Erro de verifica\u00E7\u00E3o no m\u00E9todo %1$i (%3$.*2$s%5$.*4$s) em PC %6$i
J9GC029=Erro de op\u00E7\u00E3o\: '%s'
J9GC028=Op\u00E7\u00E3o muito grande\: '%s'
J9GC027=Op\u00E7\u00E3o malformada\: '%s'
J9GC026=-Xverbosegclog falhou na aloca\u00E7\u00E3o de estruturas internas
J9GC025=Soma de %1$s e %2$s
J9GC024=A soma de %1$s e %2$s \u00E9 muito grande para heap
J9GC023=A soma de %1$s e %2$s deve ser igual a %3$s
J9GC022=A soma de %1$s e %2$s \u00E9 muito grande para %3$s
J2JX079=Erro\: %1$s em %2$i
J9GC021=%1$s deve ser igual a %2$s
J2JX078=A\u00E7\u00E3o recomendada\:
J9GC020=%s muito grande para heap
J2JX077=Arquivo de classe inv\u00E1lido
J2JX076=Arquivo de classe inv\u00E1lido\: %s
J2JX075=Nome da entrada muito longo\: %s
J2JX074=Tentativa de incluir entrada duplicada em JXE\: %s
J2JX073=arquivo de processamento de diret\u00F3rio\: %s
J2JX072=N\u00E3o foi poss\u00EDvel abrir o diret\u00F3rio %s
J2JX071=Diret\u00F3rio de processamento\: %s
J2JX070=aumento de espa\u00E7o para\: %i bytes
J9GC019=%1$s muito grande para %2$s
J9GC018=%1$s muito pequeno para %2$s
J9GC017=%1$s muito pequeno, deve ser pelo menos %2$zu %3$sbytes
J9GC016=Falha em alocar segmento subsistente no espa\u00E7o de mem\u00F3ria padr\u00E3o
J9GC015=Falha em alocar espa\u00E7o de mem\u00F3ria padr\u00E3o
J9GC014=Falha em alocar segmentos de mem\u00F3ria da classe VM
J9GC013=Falha em alocar segmentos de mem\u00F3ria de objeto VM
J9GC012=Falha em alocar segmentos de mem\u00F3ria VM
J2JX069=tamanho estimado de mem\u00F3ria\: %i bytes
J9GC011=Falha em inicializar o conjunto de espa\u00E7os de mem\u00F3ria
J2JX068=tamanho do arquivo\: %i bytes
J9GC010=Falha em inicializar o gerenciamento do finalizador
J2JX067=Nenhuma classe v\u00E1lida localizada em %s
J2JX066=N\u00E3o foi poss\u00EDvel abrir o arquivo\: %s
J2JX065=Erro ao fechar o arquivo zip\: %s
J2JX064=Os valores v\u00E1lidos para a op\u00E7\u00E3o -precompileTarget s\u00E3o\:
J2JX063=Os padr\u00F5es s\u00E3o\:
J2JX062=classfile(s)                qualquer n\u00FAmero de arquivos que terminem com .class, .jar ou .zip\n                             ser\u00E3o examinados e inclu\u00EDdos no jxe\n
J2JX061=Op\u00E7\u00F5es de compila\u00E7\u00E3o antecipadas\:\n   -[no]precompile           [n\u00E3o] marca todos os m\u00E9todos para pr\u00E9-compila\u00E7\u00E3o\n   -[no]precompileMethod xxx [n\u00E3o] marca m\u00E9todos nomeados para pr\u00E9-compila\u00E7\u00E3o\n   -[no]compileAheadOfTime   compila m\u00E9todo marcado antecipadamente\n   -precompileTarget xxx     gera jxe para arquitetura de destino e S.O. xxx\n   -precompileOptions xxx    transmite xxx para o mecanismo de pr\u00E9-compila\u00E7\u00E3o\n   -[no]precompileResolve    [n\u00E3o] tenta resolver refer\u00EAncias externas durante a pr\u00E9-compila\u00E7\u00E3o\n   -[no]stripBytecode        [n\u00E3o] extrai bytecode para m\u00E9todos compilados aot\n
J2JX060=\  -j2se                     use essa op\u00E7\u00E3o quando usar jar2jxe em um ambiente Java SE\n
J9GC009=Falha em inicializar o mutex para estat\u00EDsticas de GC
J9GC008=Falha em inicializar extens\u00F5es do m\u00F3dulo
J9GC007=Falha em inicializar, n\u00E3o foi poss\u00EDvel analisar a linha de comandos
J9GC006=Falha em inicializar, sem mem\u00F3ria
J9GC005=Falha em inicializar
J9GC004=Falha em instanciar o coletor de lixo global
J9GC003=Falha em instanciar o dispatcher de tarefas
J9GC002=Falha em instanciar heap. %1$zu%2$s solicitado
J2JX059=\  -[no]tools                o diret\u00F3rio de ferramentas [n\u00E3o] est\u00E1 inclu\u00EDdo na lista de diret\u00F3rio de extens\u00E3o
J9GC001=Falha em instanciar heap
J2JX058=\  -padJxe                   preenche o jxe no final com xxx bytes extras
J9GC000=Erro Interno, Sem Mem\u00F3ria
J2JX057=\  -[no]segmented            [n\u00E3o] gera v\u00E1rios jxes segmentados\n   -maxSegmentSize xxx       tamanho m\u00E1x. para qualquer jxe segmentado (n\u00FAmero hexadecimal)\n   -maxSegmentSize seg\=xxx   tamanho m\u00E1x. para jxe segmentado espec\u00EDfico (n\u00FAmero hexadecimal)\n   -locate xxx               localiza a imagem para o endere\u00E7o xxx (n\u00FAmero hexadecimal)\n   -locate seg\=xxx           localiza a imagem de um segmento para o endere\u00E7o hexadecimal xxx J9NLS_J2J_USAGE_19\=
J2JX056=\  -fileExtension xxx        trata arquivos que terminam com .xxx como arquivos .jar
J2JX055=\  -vmOption xxx             utiliza um vmOption xxx ao executar o jxe
J2JX054=\  -versionName xxx          configura o nome de vers\u00E3o do jxe para xxx
J2JX053=\  -description xxx          configura a descri\u00E7\u00E3o do jxe para xxx
J2JX052=\  -uuid xxx                 configura o UUID do jxe para xxx
J2JX051=\  -D xxx\=yyy                configura a propriedade de sistema xxx para yyy
J2JX050=\  -startupClass xxx        configura a classe de inicializa\u00E7\u00E3o para xxx\n -noStartupClass           indica que o jxe n\u00E3o tem uma classe de inicializa\u00E7\u00E3o
J2JX049=\  -srcDir xxx              inclui todos os arquivos na \u00E1rvore de diret\u00F3rios xxx
J2JX048=\  -outputFormat xxx         configura o formato de sa\u00EDda para xxx (c, bin ou jar)
J2JX047=\  -o xxx                    configura nome de arquivo da sa\u00EDda base para xxx
J2JX046=\  -be                       gera sa\u00EDda de big-endian\n   -le                       gera sa\u00EDda de little-endian
J2JX045=\  -version                  imprime a vers\u00E3o deste programa
J2JX044=\  -[no]profile              [n\u00E3o] gera um arquivo .prf para tra\u00E7ado de perfil
J2JX043=
J2JX042=\  -[no]verify               [n\u00E3o] verifica o formato do arquivo de classe
J2JX041=\  -q                        modo silencioso\n   -[no]logo                 [n\u00E3o] imprime mensagem de direitos autorais\n   -verbose                  modo detalhado
J2JX040=Uso\:\t%s [op\u00E7\u00F5es] classfile(s)\n\n[op\u00E7\u00F5es]\n   -help, -?                 imprimir uso
VERB036=tamanho inicial dos metadados de refer\u00EAncias compactadadas
VERB035=tamanhos de p\u00E1ginas grandes dispon\u00EDveis para cache de c\u00F3digo JIT\:
VERB034=tamanho de p\u00E1gina grande para cache de c\u00F3digo JIT
VERB033=espa\u00E7o m\u00E1ximo de cache de classe compartilhado reservado para dados JIT
VERB032=espa\u00E7o m\u00EDnimo de cache de classe compartilhado reservado para dados JIT
VERB031=espa\u00E7o de cache de classe compartilhado reservado para atributos de depura\u00E7\u00E3o de classe
VERB030=espa\u00E7o m\u00E1ximo de cache de classe compartilhado reservado para JIT
J2JX039=IBM \u00E9 uma marca registrada da IBM Corp.\nJava e todas as marcas e logotipos baseados em Java s\u00E3o marcas ou marcas\nregistradas da Sun Microsystems, Inc.
J2JX038=Materiais Licenciados - Propriedade da IBM
J2JX037=
J2JX036=Destino\: %s\n
J2JX035=(c) Copyright IBM Corp. 1991, 2005  Todos os Direitos Reservados
J2JX034=J9 Java(TM) JAR para JXE, Vers\u00E3o %s
J2JX033=Erro Interno\: falha na constru\u00E7\u00E3o adequada da classe Error'd rom
J2JX032=Aspas faltando na lista de par\u00E2metros
J2JX031=leitura conclu\u00EDda do arquivo JAR\: %s
J2JX030=Erro ao ler %1$s de %2$s
VERB029=espa\u00E7o m\u00EDnimo de cache de classe compartilhado reservado para JIT
VERB028=Pilha detalhada\: Imposs\u00EDvel imprimir a informa\u00E7\u00E3o de pilha dos encadeamentos atualmente em execu\u00E7\u00E3o
VERB027=Pilha detalhada\: O encadeamento em execu\u00E7\u00E3o "%2$.*1$s" est\u00E1 usando %3$zd/%4$zd bytes nas pilhas Java/C
VERB026=Entrada de caminho de classe inv\u00E1lida\: %s (jxe endian oposto n\u00E3o suportado)
VERB025=Entrada de caminho de classe inv\u00E1lida\: %s (cabe\u00E7alho de imagem de jxe corrompida)
VERB024=Entrada de caminho de classe inv\u00E1lida\: %s (jxe n\u00E3o cont\u00E9m rom.classes)
VERB023=Entrada de caminho de classe inv\u00E1lida\: %s (erro desconhecido)
VERB022=Entrada de caminho de classe inv\u00E1lida\: %s (tipo de arquivo desconhecido)
VERB021=Entrada de caminho de classe inv\u00E1lida\: %s (tipo de arquivo n\u00E3o suportado)
VERB020=Entrada de caminho de classe inv\u00E1lida\: %s (arquivo corrompido)
J2JX029=processando\: %s
J2JX028=Erro ao ler a entrada de %s
J2JX027=N\u00E3o foi poss\u00EDvel abrir ou ler %s
J2JX026=o segmento %d n\u00E3o p\u00F4de ser ajustado dentro do tamanho m\u00E1ximo de segmento necess\u00E1rio
J2JX025=Tentativa de incluir classe duplicada em JXE %s
J2JX024=arquivo de classe inclu\u00EDdo\: %s
J2JX023=tentando incluir arquivo de classe\: %s
J2JX022=%s \u00E9 inv\u00E1lido
J2JX021=N\u00E3o foi poss\u00EDvel carregar %1$s\: %2$s
J2JX020=aumento no ncpRef [%1$x] de %2$u para %3$u entradas
CFRE138=O atributo Classfile refere-se a uma entrada do conjunto de constantes n\u00E3o existente
CFRE137=A classe possui mais de um atributo RuntimeVisibleTypeAnnotations ou RuntimeInvisibleTypeAnnotations
CFRE136=modificadores ilegais para o m\u00E9todo de interface
CFRE135=O nome do par\u00E2metro de m\u00E9todo n\u00E3o \u00E9 UTF8
CFRE134=O par\u00E2metro de m\u00E9todo possui uma sinaliza\u00E7\u00E3o inv\u00E1lida.
CFRE133=O m\u00E9todo possui dois atributos MethodParameters
CFRE132=type_annotation target_type n\u00E3o reconhecido
CFRE131=o atributo BootstrapMethods requerido por invokedynamic est\u00E1 ausente ou \u00E9 muito pequeno
VERB019=Entrada de caminho de classe inv\u00E1lida\: %s (falha na leitura do arquivo)
CFRE130=v\u00E1rios atributos BootstrapMethods
VERB018=Entrada de caminho de classe inv\u00E1lida\: %s (falha de E/S do arquivo)
VERB017=espa\u00E7o m\u00E1x. reservado do cache compartilhado para AOT
VERB016=espa\u00E7o m\u00EDn. reservado do cache compartilhado para AOT
VERB015=tamanho do cache de classe compartilhado
VERB014=m\u00E1ximo de mem\u00F3ria
VERB013=incremento do segmento de classe ROM
VERB012=incremento do segmento de classe RAM
VERB011=tamanho da pilha de encadeamento java
VERB010=tamanho m\u00E1ximo da pilha de encadeamento java
J2JX019=aumento no buffer [%1$x] de %2$u para %3$u
J2JX018=%s criado com \u00EAxito
J2JX017=Falha em gravar dados no arquivo\: %s
J2JX016=Falha em criar/limpar o arquivo\: %s
J2JX015=C\u00F3digo de erro desconhecido\: %d
J2JX014=Falha na inicializa\u00E7\u00E3o do AOT
J2JX013=Erro Interno\: Falha na invers\u00E3o do endian
J2JX012=O UUID fornecido \u00E9 inv\u00E1lido
J2JX011=Erro Interno\: Entrada ZIP n\u00E3o fechada
J2JX010=Erro Interno\: falha na leitura
CFRE129=Os c\u00F3digos de opera\u00E7\u00E3o constant e entry_w n\u00E3o s\u00E3o v\u00E1lidos nos arquivos de classe com vers\u00F5es <\= 51.0
CFRE128=assinatura de m\u00E9todo inv\u00E1lida
CFRE127=o \u00EDndice do m\u00E9todo de autoinicializa\u00E7\u00E3o deve se referir a uma entrada do conjunto de constantes MethodHandle
CFRE126=o bytecode invokeinterface reservou o slots diferente de zero
CFRE125=invokedynamic bytecode deve referenciar uma entrada de conjunto de constantes InvokeDynamic
CFRE124=a tag do valor de elemento da anota\u00E7\u00E3o \u00E9 inv\u00E1lida
CFRE123=As constantes de MethodHandle devem se referir a um campo ou refer\u00EAncia de m\u00E9todo
CFRE122=a classe pode ser no m\u00E1ximo uma destas\: p\u00FAblica ou m\u00F3dulo
CFRE121=nome de campo ilegal
VERB009=incremento da pilha de encadeamento java
CFRE120=Os c\u00F3digos de opera\u00E7\u00E3o jsr e jsr_w n\u00E3o s\u00E3o v\u00E1lidos nos arquivos de classe com vers\u00F5es >\= 51.0
VERB008=tamanho inicial da pilha de encadeamento java
VERB007=tamanho da pilha de encadeamento do sistema operacional
VERB006=Falha em inicializar
VERB005=Erro\: est\u00E1 faltando o nome do arquivo -Xverbosegclog
VERB004=Erro\: o n\u00FAmero de ciclos -Xverbosegclog deve ser maior que 0
VERB003=Erro\: o n\u00FAmero de arquivos -Xverbosegclog deve ser maior que 0
VERB002=Pilha detalhada\: a utiliza\u00E7\u00E3o m\u00E1xima da pilha foi de %1$zd/%2$zd bytes em pilhas Java/C
VERB001=
VERB000=Pilha detalhada\: "%2$.*1$s" utilizou %3$zd/%4$zd bytes em pilhas Java/C
J2JX009=Erro Interno\: falha na busca
J2JX008=Erro Interno\: nenhuma entrada
J9VM099=-Xlog\:none              Desativar as op\u00E7\u00F5es de log da JVM anteriormente especificadas, incluindo os padr\u00F5es.
J2JX007=Erro Interno\: Entrada Duplicada
J9VM098=-Xlog\:help              Imprimir ajuda da -Xlog da JVM.
J2JX006=Sem mem\u00F3ria
J9VM097=\n Uso\:\n
J2JX005=Erro Interno\: incompatibilidade de tamanho
J9VM096=-Xscdmx ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J2JX004=Erro Interno\: CRC MISMATCH
J9VM095=viola\u00E7\u00E3o de restri\u00E7\u00E3o de carregamento ao resolver o m\u00E9todo "%2$.*1$s.%4$.*3$s%6$.*5$s" \: o utilit\u00E1rio de carga "%8$.*7$s@%9$x" da classe "%11$.*10$s" e o utilit\u00E1rio de carga "%13$.*12$s@%14$x" da classe "%16$.*15$s" possuem tipos diferentes para a assinatura de m\u00E9todo
J2JX003=Erro Interno\: argumento de fun\u00E7\u00E3o inv\u00E1lido
J9VM094=O encadeamento "%s" ainda est\u00E1 ativo ap\u00F3s a execu\u00E7\u00E3o dos ganchos de encerramento.
J2JX002=%1$d de %2$d m\u00E9todo(s) pr\u00E9-compilado(s) para o destino %3$s.
J9VM093=Esta vers\u00E3o do Java requer uma CPU que suporte SSE2 ou extens\u00F5es posteriores.  Consulte as informa\u00E7\u00F5es sobre 'Supported Environments' no IBM Java User Guide para obter mais detalhes.
J2JX001=Recurso armazenado\: %s
J9VM092=Rota\u00E7\u00E3o adapt\u00E1vel n\u00E3o suportada
J2JX000=Tentativa de incluir o arquivo de recursos duplicado [%s], arquivo ignorado.
J9VM091=Rota\u00E7\u00E3o adapt\u00E1vel suportada
TRCE019=Falha na inicializa\u00E7\u00E3o adequada do mecanismo de rastreio, RC \= %d
J9VM090=Resposta lenta \u00E0 consulta de rede (%d segundos), verifique a configura\u00E7\u00E3o de DNS de IP
TRCE018=N\u00E3o foi poss\u00EDvel alocar chave de armazenamento local de encadeamento UTE
TRCE017=N\u00E3o foi poss\u00EDvel alocar chave de armazenamento local de encadeamento RAS
CFRE119=atributos SourceFile m\u00FAltiplos
TRCE016=Armazenamento para RasGlobalStorage n\u00E3o dispon\u00EDvel, rastreio n\u00E3o ativado
CFRE118=bytes extras ap\u00F3s EOF
TRCE015=Erro ao registrar assinante de grava\u00E7\u00E3o de rastreio
CFRE117=o campo n\u00E3o pode ser final e vol\u00E1til
TRCE014=Falha na inicializa\u00E7\u00E3o do mecanismo de rastreio, rastreio n\u00E3o ativado
CFRE116=o bytecode invoke deve referenciar um Methodref
TRCE013=Gravando informa\u00E7\u00F5es de contagem de rastreio em %s
CFRE115=dimens\u00F5es da matriz > 255
TRCE012=N\u00E3o foi poss\u00EDvel abrir arquivo contador de ponto de rastreio %s, contadores redirecionados para stderr.
CFRE114=o nome de campo \u00E9 inv\u00E1lido
TRCE011=M\u00F3dulo n\u00E3o configurado para rastreio\: %s
CFRE113=EOF inesperado
TRCE010=Falha de aloca\u00E7\u00E3o de mem\u00F3ria nativa, voltando para configura\u00E7\u00F5es de rastreio n\u00E3o din\u00E2micas.
CFRE112=o VM n\u00E3o suporta verifica\u00E7\u00E3o din\u00E2mica
CFRE111=UTF8 malformado
CFRE110=constante incompat\u00EDvel para campo
J9VM089=Aviso\: n\u00E3o \u00E9 poss\u00EDvel verificar as configura\u00E7\u00F5es de syscorepath usando o sysconfig\: %s.
J9VM088=Aviso\: syscorepath n\u00E3o foi configurado, o que pode impedir a gera\u00E7\u00E3o do arquivo principal do sistema (se algum for necess\u00E1rio).\n\t\tConsulte as instru\u00E7\u00F5es de instala\u00E7\u00E3o do WebSphere Real Time para as defini\u00E7\u00F5es de configura\u00E7\u00E3o adequadas de syscorepath.\n\t\tNOTA\: O syscorepath deve ser configurado cada vez que a m\u00E1quina \u00E9 reiniciada.
J9VM087=resetDumpOption requer %s
J9VM086=Op\u00E7\u00E3o muito grande\: '%s'
J9VM085=Op\u00E7\u00E3o malformada\: '%s'
J9VM084=Erro de IFA\: c\u00F3digo de retorno inesperado %08x do servi\u00E7o de comutador IFA
J9VM083=Erro ao alternar para o processador IFA, rc\: %08x
J9VM082=N\u00E3o \u00E9 poss\u00EDvel alternar para o processador IFA - emita "extattr +a lib%s.so"
J9VM081=Valor da op\u00E7\u00E3o malformado, a op\u00E7\u00E3o "%1$s%3$.*2$s" cont\u00E9m os caracteres \u00E0 direita "%4$s" que foram ignorados
TRCE009=Erro ao gravar no arquivo snap
J9VM080=queryVmDump requer %s
TRCE008=Erro ao executar busca no arquivo de rastreio\: %s
TRCE007=Erro ao abrir pr\u00F3xima gera\u00E7\u00E3o do arquivo de rastreio\: %s
CFRE109=assinatura de m\u00E9todo inv\u00E1lida
TRCE006=Erro ao gravar %d bytes no arquivo de rastreio\: %s rc\: %d
CFRE108=o \u00EDndice de m\u00E9todo do m\u00E9todo de inclus\u00E3o deve referir-se a um nome e tipo
TRCE005=Erro ao gravar cabe\u00E7alho no arquivo de rastreio\: %s
CFRE107=deslocamento fora do intervalo no bytecode jump
TRCE004=Erro ao abrir arquivo de rastreio\: %s
CFRE106=m\u00E9todo duplicado
TRCE003=Erro ao processar op\u00E7\u00E3o de rastreio, detalhe\: %s
CFRE105=superClass deve ser uma classe
TRCE002=Erro ao processar op\u00E7\u00E3o de rastreio\: -Xtrace\:%s\=%s
CFRE104=o campo pode ser no m\u00E1ximo um entre p\u00FAblico privado ou protegido
TRCE001=Erro ao processar op\u00E7\u00E3o de rastreio\: -Xtrace\:%s
CFRE103=o m\u00E9todo abstrato n\u00E3o pode ser privado, est\u00E1tico, final, nativo, sincronizado ou restrito
TRCE000=Op\u00E7\u00E3o de rastreio n\u00E3o reconhecida\: -Xtrace\:%s
CFRE102=assinatura de campo inv\u00E1lida
CFRE101=deslocamento fora do intervalo no bytecode switch
CFRE100=foram solicitadas excessivas dimens\u00F5es no bytecode multianewarray
J9VM079=triggerOneOffDump(%1$s) requer %2$s
J9VM078=Valor malformado para JAVA_TOOL_OPTIONS
J9VM077=Nota\: -Xdfpbd n\u00E3o tem efeito neste release do Java
J9VM076=mem\u00F3ria nativa esgotada ao alocar entrada da lista para objeto finaliz\u00E1vel ou de refer\u00EAncia
J9VM075=opera\u00E7\u00E3o ilegal no encadeamento eventron
J9VM074=Classe %2$.*1$s acessando ilegalmente classe %3$s %5$.*4$s
J9VM073=Classe %2$.*1$s acessando ilegalmente o membro %3$s da classe %5$.*4$s
J9VM072=mem\u00F3ria nativa esgotada
J9VM071=tentativa de ligar recursivamente o m\u00E9todo nativo %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM070=mem\u00F3ria nativa esgotada durante a liga\u00E7\u00E3o do m\u00E9todo nativo %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM069=carregando a viola\u00E7\u00E3o de restri\u00E7\u00E3o\: o utilit\u00E1rio de carga "%2$.*1$s@%3$x" iniciou anteriormente o carregamento de um tipo diferente com o nome "%5$.*4$s" definido pelo utilit\u00E1rio de carga "%7$.*6$s@%8$x"
J9VM068=-Xshareclasses n\u00E3o ativado, op\u00E7\u00E3o -Xzero\:sharestring ignorada
J9VM067=-Xshareclasses n\u00E3o ativado, op\u00E7\u00E3o -Xzero\:sharezip ignorada
J9VM066=incompatibilidade de tipo de argumento
J9VM065=o objeto n\u00E3o \u00E9 uma inst\u00E2ncia da classe de declara\u00E7\u00E3o
J9VM064=setDumpOption requer %s
J9VM063=seekDumpAgent requer %s
J9VM062=removeDumpAgent requer %s
J9VM061=insertDumpAgent requer %s
J9VM060=runNamedDump(%1$s) requer %2$s
J9VM059=-Xscmaxaot ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM058=-Xscminaot ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM057=Limite do cache de monitor excedido
J9VM056=Vers\u00E3o principal
J9VM055=Erro irrecuper\u00E1vel\: A vers\u00E3o Principal de JXE \u00E9 diferente de %d
J9VM054=Falha ao criar um encadeamento\: retVal %1$zd, errno %2$zd
J9VM053=Op\u00E7\u00E3o malformada %s localizada em -Xoptionsfile
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] configurou o tamanho m\u00E1ximo da matriz em cache JNI\n
J9VM051=Uso\:\n
J9VM050=-Xjni\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
J9VM049=Tempos de suspens\u00E3o de JLM n\u00E3o suportados
J9VM048=Tempos de suspens\u00E3o de JLM suportados
J9VM047=JLM n\u00E3o suportado
J9VM046=JLM suportado
J9VM045=Monitores de sistema de tr\u00EAs camadas n\u00E3o suportados
J9VM044=Monitores de sistema de tr\u00EAs camadas suportados
J9VM043=-----------------------
J9VM042=Configura\u00E7\u00E3o de Encadeamento
J9VM041=n\u00FAmero incorreto de argumentos
J9VM040=estouro de pilha do sistema operacional
SHRC299=O cache de classe compartilhado "%s" n\u00E3o foi criado com a op\u00E7\u00E3o aninhada, n\u00E3o \u00E9 poss\u00EDvel aumentar o cache
SHRC298=Para executar o utilit\u00E1rio "%s" no cache de classe persistente "%s", use a subop\u00E7\u00E3o "persistent"
SHRC297=Para usar caches de classe compartilhados persistentes no AIX,a vari\u00E1vel de ambiente CORE_MMAP deve ser configurada como "yes"
SHRC296=Executar com a op\u00E7\u00E3o "noCoreMmap" significa que \u00E9 pouco prov\u00E1vel que a IBM ajude com quaisquer travamentos, uma vez que os dados de classe estar\u00E3o ausentes de dumps do sistema
SHRC295=Desativar depend\u00EAncia de ter CORE_MMAP no AIX
SHRC294=%1$d\: 0x%2$p CHARARRAY\: em 0x%3$p.
SHRC293=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para conjunto de itens de hashtable em ROMClassResourceManager
J9VM039=-Xscmx ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC292=N\u00E3o \u00E9 poss\u00EDvel inserir mutex de hashtable ROMClassResourceManager
J9VM038=-Xthr\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
SHRC291=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de hashtable em ROMClassResourceManager
J9VM037=Falha em alocar o monitor
SHRC290=Falha ao criar novo item de hashtable em ROMClassResourceManager
J9VM036=dividir por zero
J9VM035=Imposs\u00EDvel alocar OutOfMemoryError
J9VM034=JVMRI requer um mecanismo de rastreio\: execute com o sinalizador -Xtrace
J9VM033=Erro irrecuper\u00E1vel\: falha em inicializar %s
J9VM032=Erro irrecuper\u00E1vel\: n\u00E3o \u00E9 poss\u00EDvel carregar %1$s\: %2$s
J9VM031=A classe requerida %2$.*1$s deveria estar no caminho de classe de inicializa\u00E7\u00E3o, mas foi localizada no caminho de classe do aplicativo em %4$.*3$s
VRFY041=invokespecial de inicializador errado
J9VM030=UTF8 inv\u00E1lido utilizado na fun\u00E7\u00E3o JNI
VRFY040=verificador n\u00E3o conseguiu alocar mem\u00F3ria nativa
SHRC289=N\u00E3o detectar quando um cache est\u00E1 localizado em um sistema de arquivos de rede remota
SHRC288=ID de mem\u00F3ria compartilhada   \= %d
SHRC287=O cache persistente n\u00E3o pode estar localizado em um sistema de arquivos de rede. Selecione "nonpersistent" ou um cacheDir diferente.
SHRC286=Aberto cache de classe compartilhado %1$s no modo de leitura
SHRC285=Aberto cache persistente de classes compartilhado %1$s no modo de leitura
SHRC284=N\u00E3o \u00E9 poss\u00EDvel criar monitor no modo de leitura
SHRC283=Abra o cache com permiss\u00F5es de leitura
J9VM029=\tem (M\u00E9todo Desconhecido)
VRFY039=bytecode desconhecido
SHRC282=O tamanho da p\u00E1gina do sistema operacional \u00E9 incompat\u00EDvel com este cache. Tentando recriar o cache.
J9VM028=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
VRFY038=invokespecial em destino inv\u00E1lido
SHRC281=Tentando destruir todos os caches em cacheDir %s
J9VM027=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s)
VRFY037=objeto n\u00E3o inicializado durante ramifica\u00E7\u00E3o de retrocesso
SHRC280=Listando todos os caches em cacheDir %s
J9VM026=\tem %2$.*1$s.%4$.*3$s (Origem Desconhecida)
VRFY036=underflow de pilha
J9VM025=\tem %2$.*1$s.%4$.*3$s (M\u00E9todo Nativo)
VRFY035=sem erro
J9VM024=Exce\u00E7\u00E3o no encadeamento "%.*s"
VRFY034=PC de destino inv\u00E1lido
J9VM023=Isto pode indicar que JAVA_HOME est\u00E1 incorreto ou que as bibliotecas de classes n\u00E3o est\u00E3o instaladas
VRFY033=campo de tipo n\u00E3o compat\u00EDvel
J9VM022=Falha no mapa tempor\u00E1rio, resultado \= %p - interrompendo a VM
VRFY032=receptor inv\u00E1lido para <init>
J9VM021=Sem mem\u00F3ria para mapa tempor\u00E1rio do interpretador - interrompendo a VM
VRFY031=tentativa para iinc n\u00E3o inteiro
J9VM020=Procurado em %.*s
VRFY030=tipo inv\u00E1lido na pilha
SHRC279=Recriar cache compartilhado na inicializa\u00E7\u00E3o
SHRC278=Observe que o utilit\u00E1rio "%s" n\u00E3o pode operar no cache de classes incompat\u00EDvel "%s". Utilize uma JVM do n\u00EDvel correto.
SHRC277=Para executar o utilit\u00E1rio "%s" em um cache compartilhado n\u00E3o persistente "%s", tamb\u00E9m \u00E9 necess\u00E1rio usar a subop\u00E7\u00E3o "nonpersistent"
SHRC276=Para executar o utilit\u00E1rio "%s" no cache de classes persistente "%s", n\u00E3o utilize a subop\u00E7\u00E3o "nonpersistent"
SHRC275=Configurar o local dos arquivos de cache da JVM
SHRC274=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria desativada para o cache
SHRC273=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria padr\u00E3o ativada com \u00EAxito para o cache
J9VM019=Erro irrecuper\u00E1vel\: n\u00E3o \u00E9 poss\u00EDvel localizar e inicializar a classe obrigat\u00F3ria %.*s
VRFY029=returnAddress inv\u00E1lido para instru\u00E7\u00E3o ret
SHRC272=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria completa ativada com \u00EAxito para o cache
J9VM018=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o conjunto de tabelas de carregamento da biblioteca compartilhada
VRFY028=dimens\u00E3o inv\u00E1lida
SHRC271=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o mprotect\=
J9VM017=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para a matriz de op\u00E7\u00F5es da linha de comandos
VRFY027=o receptor \u00E9 incompat\u00EDvel com classe de declara\u00E7\u00E3o
SHRC270=Configurar prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria cache
J9VM016=Erro de encerramento para a biblioteca %1$s(%2$d)\: %3$s
VRFY026=EOF inesperado
J9VM015=Erro de inicializa\u00E7\u00E3o para a biblioteca %1$s(%2$d)\: %3$s
VRFY025=acesso inv\u00E1lido a dados protegidos
J9VM014=Erro de encerramento na fun\u00E7\u00E3o %1$s(%2$d)\: %3$s
VRFY024=os argumentos n\u00E3o s\u00E3o de tipo compat\u00EDvel
J9VM013=Erro de inicializa\u00E7\u00E3o na fun\u00E7\u00E3o %1$s(%2$d)\: %3$s
VRFY023=par\u00E2metro tableswitch n\u00E3o inteiro
J9VM012=N\u00E3o \u00E9 poss\u00EDvel descarregar %1$s\: %2$s
VRFY022=as sub-rotinas devem ser percorridas novamente para cada jsr
J9VM011=N\u00E3o \u00E9 poss\u00EDvel carregar %1$s\: %2$s
VRFY021=emitido objeto que n\u00E3o pode ser emitido
J9VM010=Falha em inicializar %s
VRFY020=argumentos de chamada de tipo n\u00E3o compat\u00EDvel
SHRC269=O sistema n\u00E3o suporta prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria
SHRC268=[-Xshareclasses armazenamento em cache de entradas do caminho de classe de inicializa\u00E7\u00E3o desativado]
SHRC267=Desativar armazenamento em cache de classes do caminho de classe de inicializa\u00E7\u00E3o
SHRC266=[-Xshareclasses armazenamento em cache de classes retransformadas ativado]
SHRC265=Classes de cache que s\u00E3o retransformadas atrav\u00E9s de JVMTI
SHRC264=N\u00E3o aproximar \u00E1reas de cache de limites da p\u00E1gina
SHRC263=Ativar p\u00E1ginas detalhadas de CompositeCache
J9VM009=J9VMDllMain falhou
VRFY019=falha de carregamento de classe
SHRC262=Bytes de dados         \= %d
J9VM008=J9VMDllMain n\u00E3o localizado
VRFY018=pilha m\u00E1x. excedida
SHRC261=Ativar sa\u00EDda detalhada interna de cadeia
J9VM007=Op\u00E7\u00E3o de linha de comandos n\u00E3o reconhecida\: %s
VRFY017=<init> n\u00E3o chama este <init> ou super <init>
SHRC260=Falha ao criar conjunto em ByteDataManager
J9VM006=Op\u00E7\u00E3o de linha de comandos inv\u00E1lida\: %s
VRFY016=par\u00E2metro de bytecode shift n\u00E3o inteiro
J9VM005=Valor inv\u00E1lido para a vari\u00E1vel de ambiente\: %s
VRFY015=v\u00E1rios retornos para um \u00FAnico jsr
J9VM004=N\u00E3o \u00E9 poss\u00EDvel carregar a biblioteca requerida por\: %s
VRFY014=bytecode return incompat\u00EDvel com tipo de retorno
J9VM003=O compilador JIT "%s" n\u00E3o foi localizado. Ser\u00E1 utilizado o interpretador.
VRFY013=restri\u00E7\u00E3o de carregamento de classe violado
J9VM002=Arquivo de op\u00E7\u00F5es n\u00E3o localizado
VRFY012=formato de pilha inconsistente
J9VM001=Valor malformado para -Xservice
VRFY011=par\u00E2metro lookupswitch n\u00E3o inteiro
J9VM000=Valor malformado para IBM_JAVA_OPTIONS
VRFY010=v\u00E1rios jsrs utilizam um \u00FAnico retorno
SHRC259=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex da tabela hash do Gerenciador
SHRC258=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash no Gerenciador
SHRC257=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada no Gerenciador
SHRC256=O cache compartilhado persistente "%1$s" foi destru\u00EDdo
SHRC255=Erro ao atualizar arquivo de cache de classe compartilhado desde a \u00FAltima desconex\u00E3o na sa\u00EDda da JVM
SHRC254=Erro ao configurar comprimento do arquivo de cache de classe compartilhado
SHRC253=Erro ao gravar no arquivo de cache de classe compartilhado
VRFY009=matriz de tipo n\u00E3o compat\u00EDvel
SHRC252=Erro ao buscar no arquivo de cache de classe compartilhado
VRFY008=\u00EDndice de matriz n\u00E3o inteiro
SHRC251=N\u00E3o excluir automaticamente caches de diferentes buildIDs
VRFY007=m\u00E9todo final substitu\u00EDdo
SHRC250=O cache n\u00E3o pode ser aberto como de leitura uma vez que ele ainda n\u00E3o foi inicializado
VRFY006=tamanho de nova matriz n\u00E3o inteiro
VRFY005=tipo local n\u00E3o compat\u00EDvel
VRFY004=jsr em seq\u00FC\u00EAncia encontrou excessivos jsrs
VRFY003=a classe n\u00E3o cont\u00E9m dados de pr\u00E9-verifica\u00E7\u00E3o
VRFY002=seq\u00FC\u00EAncia de bytecode inv\u00E1lida
VRFY001=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s
VRFY000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC249=Erro\: o modlevel do cabe\u00E7alho do arquivo de cache de classe compartilhado \u00E9 inv\u00E1lido
JNCK100=Aviso JNI em %1$s\: esta fun\u00E7\u00E3o n\u00E3o pode ser usada com objetos empacotados. Em vez disso, use %2$s.
SHRC248=Erro\: a vers\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado \u00E9 inv\u00E1lida
SHRC247=Erro\: os dados de identifica\u00E7\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado s\u00E3o inv\u00E1lidos
SHRC246=%1$s
SHRC245=Erro ao mapear o arquivo de cache de classe compartilhado
SHRC244=Erro ao obter comprimento do arquivo de cache de classe compartilhado
SHRC243=Erro ao liberar o bloqueio de leitura de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC242=Erro ao atualizar o arquivo de cache de classe compartilhado desde a \u00FAltima desconex\u00E3o
SHRC241=Erro\: n\u00E3o \u00E9 poss\u00EDvel excluir o arquivo de cache de classe compartilhado
SHRC240=Erro\: n\u00E3o \u00E9 poss\u00EDvel adquirir bloqueio de grava\u00E7\u00E3o de conex\u00E3o do arquivo de cache de classe compartilhado
EXEX026=\  -jxe <arquivo jxe>   coloca o arquivo jxe no caminho de classe e executa a classe\n                    de inicializa\u00E7\u00E3o localizada no arquivo jxe.
EXEX025=Uso\:\t%s [-jxe] [op\u00E7\u00F5es] <arquivo jxe> [args...]
EXEX024=O JXE %s n\u00E3o continha uma classe de inicializa\u00E7\u00E3o.
EXEX023=N\u00E3o foi poss\u00EDvel inicializar utilit\u00E1rios JXE.
EXEX022=
EXEX021=
EXEX020=
SHRC239=Erro\: n\u00E3o \u00E9 poss\u00EDvel adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC238=Erro\: o cache de classe compartilhado n\u00E3o est\u00E1 conectado
SHRC599=O espa\u00E7o livre da \u00E1rea de dados brutos de classe est\u00E1 corrompido ('in\u00EDcio do espa\u00E7o livre'\=%p, 'fim do espa\u00E7o livre'\=%p, 'tamanho livre'\=%lu bytes)
SHRC237=Aberto cache persistente de classes compartilhado %1$s
SHRC598=A \u00E1rea de dados brutos de classe est\u00E1 corrompida porque seu tamanho de %lu \u00E9 maior que o tamanho total do cache de %lu.
SHRC236=Criado cache persistente de classes compartilhado %1$s
SHRC597=-Xshareclasses\:rcdSize\=%u bytes \u00E9 maior que %u bytes de espa\u00E7o livre dispon\u00EDvel, -Xshareclasses\:rcdSize\=%u ser\u00E1 usado no lugar.
SHRC235=Erro ao liberar o bloqueio de leitura de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC596=Executar verifica\u00E7\u00F5es extras ao armazenar e alocar dados de classe inadequados.
SHRC234=Erro ao adquirir bloqueio de leitura de conex\u00E3o de arquivo de cache de classe compartilhado
SHRC595=As op\u00E7\u00F5es da linha de comandos "%s" e "%s" s\u00E3o incompat\u00EDveis
SHRC233=Erro ao criar cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC594=A subop\u00E7\u00E3o -Xshareclasses\:cacheRetransformed \u00E9 incompat\u00EDvel com um cache compartilhado criado com a subop\u00E7\u00E3o enableBCI
SHRC232=N\u00E3o \u00E9 poss\u00EDvel criar monitor no modo de leitura
SHRC593=BCI Ativado        \= false
SHRC231=Erro ao configurar comprimento do arquivo de cache de classe compartilhado
EXEX019=
SHRC592=BCI Ativado        \= true
SHRC230=Erro ao inicializar cabe\u00E7alho de dados do cache compartilhado
EXEX018=
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
EXEX017=Erro ao mapear jxe em flash
SHRC590=A subop\u00E7\u00E3o "enableBCI" foi especificada, mas o cache existente n\u00E3o foi criado com a subop\u00E7\u00E3o "enableBCI".
EXEX016=Par\u00E2metros jxespace inv\u00E1lidos
EXEX015=Erro de inicializa\u00E7\u00E3o da VM\: Sem mem\u00F3ria
EXEX014=Execute %s -help para uso
EXEX013=Erro interno da VM\: Falha em criar Java VM
EXEX012=A op\u00E7\u00E3o -jar n\u00E3o est\u00E1 dispon\u00EDvel para esta biblioteca de classes
EXEX011=
EXEX010=%s requer um par\u00E2metro
JDBG021=op\u00E7\u00E3o de depura\u00E7\u00E3o n\u00E3o reconhecida
JDBG020=op\u00E7\u00E3o de depura\u00E7\u00E3o n\u00E3o reconhecida\: '%s'
SHRC229=Erro\: o arquivo de cache de classe compartilhado possui um cabe\u00E7alho inv\u00E1lido
SHRC228=Erro ao atualizar o cache de classe compartilhado desde a \u00FAltima conex\u00E3o
SHRC589=Criar o cache com suporte para instrumenta\u00E7\u00E3o de bytecode.
SHRC227=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho de arquivo do cache de classe compartilhado
SHRC588=Erro ao liberar o bloqueio de leitura do cabe\u00E7alho do cache de classe compartilhada de convidado cruzado
SHRC226=Erro ao abrir o arquivo de cache de classe compartilhado
SHRC587=Erro ao atualizar o \u00FAltimo hor\u00E1rio de conex\u00E3o do cache de classe compartilhada de convidado cruzado
SHRC225=Erro ao obter caminho de arquivo de cache
SHRC586=Erro\: o cache de classe compartilhada de convidado cruzado possui um cabe\u00E7alho inv\u00E1lido
SHRC224=Sem mem\u00F3ria para c\u00F3pia local de nome do cache
SHRC585=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho do cache de classe compartilhada de convidado cruzado
SHRC223=O caches de classe compartilhado persistente n\u00E3o pode ser criado/utilizado, pois o bloqueio de arquivo n\u00E3o \u00E9 suportado
SHRC584=Erro ao adquirir bloqueio de leitura de conex\u00E3o do cache de classe compartilhada de convidado cruzado
SHRC222=O cache de classe compartilhado persistente n\u00E3o pode ser criado/utilizado, pois o mapeamento de mem\u00F3ria n\u00E3o suporta os recursos necess\u00E1rios
SHRC583=Erro ao atualizar o "\u00FAltimo hor\u00E1rio removido" do cache de classe compartilhada de convidado cruzado
SHRC221=Mensagem de erro de plataforma\: %1$s
EXEX009=\  -verify          ative a verifica\u00E7\u00E3o do arquivo de classe.\n  -X               imprime a ajuda de op\u00E7\u00F5es que n\u00E3o s\u00E3o padr\u00E3o.
SHRC582=Erro\: n\u00E3o \u00E9 poss\u00EDvel excluir cache de classe compartilhada de convidado cruzado
SHRC220=C\u00F3digo de erro de camada da porta \= %1$d
EXEX008=\  -verbose[\:class,gc,stack,sizes]\n                   ativa a sa\u00EDda detalhada (default\=class).\n
SHRC581=Erro ao mapear no objeto compartilhado de convidado cruzado
EXEX007=\  -jcl\:<config>[\:op\u00E7\u00F5es]\n                   especifica qual biblioteca compartilhada JCL utilizar (por exemplo\: cdc, cldc, ...).\n
SHRC580=Erro ao liberar bloqueio de leitura de conex\u00E3o do cache de classe compartilhada de convidado cruzado
EXEX006=\  -debug\:<op\u00E7\u00F5es> ativa debug, padr\u00E3o JDWP <op\u00E7\u00F5es>.\n
JDBG019=lista de relocaliza\u00E7\u00F5es n\u00E3o classificadas %zx
EXEX005=\  -D<prop>\=<val>   defina o valor de uma propriedade de sistema.\n
JDBG018=ignorando op\u00E7\u00E3o de depura\u00E7\u00E3o n\u00E3o reconhecida
EXEX004=\  -jxespace\:<endere\u00E7o f\u00EDsico>,<tamanho>,<endere\u00E7o l\u00F3gico>\n                   mapeia a regi\u00E3o da mem\u00F3ria para jxes, (valores est\u00E3o em hexadecimal).\n  -jxeaddr\:<logicalAddr>\n                   executa um jxe diretamente da mem\u00F3ria, (endere\u00E7o est\u00E1 em hexadecimal).
JDBG017=
EXEX003=\  -jxe\:<arquivo jxe>   execute o arquivo jxe denominado.
JDBG016=falha na conex\u00E3o com a JVM
EXEX002=\n[op\u00E7\u00F5es]\n  -classpath <caminho>\n  -cp <caminho>       configure o caminho de classe para <caminho>.
JDBG015=Servidor de resposta de depura\u00E7\u00E3o
EXEX001=Uso\:\t%s [op\u00E7\u00F5es] -jxe\:<arquivo jxe> [args...]
JDBG014=n\u00E3o \u00E9 poss\u00EDvel alocar o conjunto vm->debuggerClassReferences
EXEX000=Uso\:\t%s [op\u00E7\u00F5es] classname [args...]
JDBG013=n\u00E3o \u00E9 poss\u00EDvel alocar o conjunto vm->debuggerReferences
JDBG012=falha em j9dbg_init_server
JDBG011=n\u00E3o \u00E9 poss\u00EDvel alocar debugServer
JDBG010=Exemplo\: java -Xrunjdwp\:transport\=dt_socket,address\=localhost\:8000\n
SHRC219=[-Xshareclasses acesso de grupo ativado para novos caches]
SHRC218=[-Xshareclasses cache persistente desativado]
SHRC579=Erro ao inicializar cabe\u00E7alho de dados do cache compartilhado de convidado cruzado
SHRC217=[-Xshareclasses cache persistente ativado]
SHRC578=Erro ao criar cabe\u00E7alho no cache de classe compartilhada de convidado cruzado
SHRC216=Criar cache de classe compartilhada n\u00E3o persistente
SHRC577=N\u00E3o \u00E9 poss\u00EDvel criar um cache compartilhado de convidado cruzado no modo somente leitura
SHRC215=Criar cache de classe compartilhado persistente
SHRC576=N\u00E3o \u00E9 poss\u00EDvel abrir o cache compartilhado de convidado cruzado como somente leitura uma vez que ele ainda n\u00E3o foi inicializado
SHRC214=N\u00E3o \u00E9 poss\u00EDvel digitar mutex de tabela hash ByteDataManager
SHRC575=Erro ao adquirir bloqueio de grava\u00E7\u00E3o para o cabe\u00E7alho no cache de classe compartilhada de convidado cruzado
SHRC213=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ByteDataManagerImpl
SHRC574=N\u00E3o \u00E9 poss\u00EDvel localizar o cache compartilhado de convidado cruzado em um sistema de arquivos de rede. Selecione "nonpersistent" ou um cacheDir diferente.
SHRC212=Armazenando dados de bytes para a chave %.*s no cache compartilhado...
SHRC573=A op\u00E7\u00E3o da linha de comandos "-Xshareclasses\:%s" requer "-Xvirt"
SHRC211=Localizando dados de bytes para a chave %.*s no cache compartilhado...
SHRC572=Localizada a especifica\u00E7\u00E3o de destino incorreta. O destino especificado no cabe\u00E7alho do cache \u00E9\: %s, mas o esperado \u00E9\: %s.
SHRC210=[-Xshareclasses sa\u00EDda detalhada de dados de bytes ativada]
SHRC571=As classes de cache de convidado cruzado anexadas compartilhadas %1$s
SHRC570=O cache compartilhado de convidado cruzado "%1$s" foi destru\u00EDdo
JDBG009=j9methodids\=y|n                 usar m\u00E9todo j9 ids              n\n
JDBG008=onuncaught\=y|n                  depurar em qq n\u00E3o-captura?          n
JDBG007=onthrow\=<nome_da_exce\u00E7\u00E3o>       depurar quando emitido          none
JDBG006=server\=y|n                      atender depurador?            n
JDBG005=address\=<escutar/anexar endere\u00E7o> spec de transporte              "localhost\:8888"
JDBG004=transport\=<nome>                spec de transporte              none
JDBG003=suspend\=y|n                     aguardar na inicializa\u00E7\u00E3o?                y
JDBG002=---------------------           ---------                       ------
JDBG001=Nome e Valor da Op\u00E7\u00E3o           Descri\u00E7\u00E3o                       Padr\u00E3o
JDBG000=-Xrunjdwp uso\: -Xrunjdwp\:[help]|[<option>\=<valor>, ...]\n
SHRC209=Ativar sa\u00EDda detalhada de dados de bytes
SHRC208=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para conjunto de itens de tabela hash em CompiledMethodManagerImpl
SHRC569=Classes de cache de convidado cruzado criadas compartilhadas %1$s
SHRC207=N\u00E3o \u00E9 poss\u00EDvel digitar mutex de tabela hash CompiledMethodManager
SHRC568=Cache de convidado cruzado aberto de classes compartilhadas %1$s
SHRC206=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em CompiledMethodManagerImpl
SHRC567=Cache de convidado cruzado aberto de classe compartilhada %1$s somente leitura
SHRC205=Falha ao criar novo item de tabela hash em CompiledMethodManagerImpl
SHRC566=O destaque do cabe\u00E7alho do cache de classe compartilhada de convidado cruzado \u00E9 inv\u00E1lido
SHRC204=N\u00E3o \u00E9 poss\u00EDvel criar o mutex da tabela hash no Gerenciador de classes compartilhado
SHRC565=Criar cache de classe compartilhada crossguest
SHRC203=N\u00E3o \u00E9 poss\u00EDvel criar tabela hash no Gerenciador de classes compartilhado
SHRC564=[-Xshareclasses crossguest de cache compartilhado ativado]
SHRC202=Falha ao inicializar conjuntos no Gerenciador de classes compartilhado
SHRC563=Abrindo um cache em tempo real, o que n\u00E3o \u00E9 compat\u00EDvel com esta JVM; use a op\u00E7\u00E3o -Xrealtime JVM para acessar esse cache.
SHRC201=\ Substitui\u00E7\u00E3o bem-sucedida de %2$.*1$s.
SHRC562=Leia os dados corrompidos para o cabe\u00E7alho de entrada de cache 0x%p (comprimento de item inv\u00E1lido de %u bytes)
SHRC200=\ Localiza\u00E7\u00E3o bem-sucedida de %2$.*1$s.
SHRC561=Falha ao inicializar o cache de classes compartilhado, n\u00E3o h\u00E1 espa\u00E7o suficiente no sistema de arquivos. Bytes de espa\u00E7o livre em disco dispon\u00EDveis \= %lld, bytes solicitados \= %lld.
SHRC560=O nome do cache interno n\u00E3o \u00E9 adequado.
SHRC559=Falha ao criar um diret\u00F3rio "%s" para o cache de classe compartilhado
SHRC558=Op\u00E7\u00F5es dispon\u00EDveis para -Xshareclasses\:printStats\=<options>. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es. Ou seja, printstats\=aot+url \n
SHRC557=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o printstats\= . O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC556=Imprimir resumo de estat\u00EDsticas de cache. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC555=O cache cont\u00E9m classes com n\u00FAmeros de linha e classes sem n\u00FAmeros de linha
SHRC554=O cache cont\u00E9m apenas classes sem n\u00FAmeros de linha
SHRC553=O cache cont\u00E9m apenas classes com n\u00FAmeros de linha
SHRC552=N\u00E3o \u00E9 poss\u00EDvel alocar o tamanho d bloco solicitado para o cache "%s". Bytes dispon\u00EDveis \= %d, Bytes solicitados \= %d
SHRC551=O cache "%s" est\u00E1 marcado como cheio. Falha ao alocar o tamanho de bloco \= %d.
SHRC550=O sinalizador de tempo de execu\u00E7\u00E3o ROUND_TO_PAGE_SIZE est\u00E1 ausente. -Xshareclasses\:checkStringTableReset requer que a tabela da sequ\u00EAncia seja arredondada para o tamanho da p\u00E1gina.
SHRC549=-Xshareclasses\:checkStringTableReset pode falhar. A tabela da sequ\u00EAncia n\u00E3o \u00E9 grande o bastante. Ela precisa ter mais que o tamanho de p\u00E1gina do S.O. Tamanho da tabela \= %d, Tamanho da p\u00E1gina \= %d
SHRC548=For\u00E7ar verifica\u00E7\u00E3o para reconfigura\u00E7\u00E3o da tabela de sequ\u00EAncia quando ela estiver marcada como corrompida.
SHRC547=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a matriz de caracteres em shrinit
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC535=\t bytedata     Imprime todos os outros tipos bytedata no cache compartilhado.
SHRC534=\t jcl               Imprime apenas tipos jcl no cache compartilhado.
SHRC533=\t aotdata       Imprime apenas tipos aotdata no cache compartilhado.
SHRC532=\t aotthunk     Imprime apenas tipos aotthunk no cache compartilhado.
SHRC531=\t aotch           Imprime apenas tipos aotch no cache compartilhado.
SHRC530=\t jithint       Imprime apenas tipos jithint no cache compartilhado.
DUMP042=Interromper sinal recebido durante a execu\u00E7\u00E3o na pilha Java. Os agentes de dump JVM n\u00E3o puderam ser executados.
DUMP041=Uso incorreto de -Xdump msg_filter
DUMP040=Dump %1$s gravado no(s) conjunto de dados(s) usando o modelo de nome %2$s
SHRC529=\t orphan         Imprime apenas tipos \u00F3rf\u00E3os no cache compartilhado.
SHRC528=\t extra           Imprime todos os tipos privados a seguir no cache compartilhado.
SHRC527=\t zipcache     Imprime apenas tipos zipcache no cache compartilhado.\n
SHRC526=\t jitprofile Imprime apenas tipos jitprofile no cache compartilhado.
SHRC525=\t aot               Imprime apenas tipos aot no cache compartilhado.
SHRC524=\t rommethod   Imprime apenas tipos rommethod no cache compartilhado.
SHRC523=\t romclass     Imprime apenas tipos romclass no cache compartilhado.
SHRC522=\t token           Imprime apenas tipos de tokens no cache compartilhado.
DUMP039=Processando o evento de dump "%1$s", detalhe "%3$.*2$s" em %4$s - aguarde.
SHRC521=\t url               Imprime apenas tipos de URL no cache compartilhado.
DUMP038=O dump de ajuste n\u00E3o \u00E9 gravado por causa do rastreio no arquivo\: %1$s
SHRC520=\t classpath   Imprime apenas tipos de caminho de classe no cache compartilhado
DUMP037=Erro no dump %1$s\: %2$s falhou, c\u00F3digo de erro\: %3$d
DUMP036=Filtro -Xdump inv\u00E1lido ou ausente
DUMP035=O usu\u00E1rio solicitou o dump %1$s por meio de %2$s
DUMP034=O usu\u00E1rio solicitou o dump %1$s usando '%2$s' por meio de %3$s
DUMP033=A JVM solicitou o dump %1$s em resposta a um evento
DUMP032=A JVM solicitou o dump %1$s usando '%2$s' em resposta a um evento
DUMP031=O heapdump solicitado n\u00E3o foi produzido porque o bloqueio exclusive da VM n\u00E3o foi solicitado. Inclua request\=exclusive+prepwalk+compact em sua op\u00E7\u00E3o da linha de comandos -Xdump\:heap\:.
DUMP030=N\u00E3o \u00E9 poss\u00EDvel gravar o dump no arquivo %s\: %s
SHRC519=\t all               Imprime todos os tipos a seguir no cache compartilhado.
SHRC518=Op\u00E7\u00F5es dispon\u00EDveis para -Xshareclasses\:printAllStats\=<options>. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es. Ou seja, printallstats\=aot+url \n
SHRC517=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o printallstats\= O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC516=Listar todos os elementos em cache O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC515=Falha ao obter diret\u00F3rio de cache padr\u00E3o.
SHRC514=Configura\u00E7\u00E3o inv\u00E1lida para a op\u00E7\u00E3o cacheDirPerm. Ela deve ser a permiss\u00E3o de arquivo de estilo unix no intervalo de 0700 - 0777 ou 1700 - 1777 (em representa\u00E7\u00E3o octal).
SHRC513=Configure as permiss\u00F5es de estilo unix para criar diret\u00F3rios de cache
SHRC512=n\u00E3o existem dados no cache
DUMP029=A solicita\u00E7\u00E3o de prepwalk ou compact antes de executar um dump do sistema ser\u00E1 ignorado porque o bloqueio exclusive da VM n\u00E3o foi solicitado.
SHRC511=O cache composto possui valor do sinalizador de inicializa\u00E7\u00E3o inv\u00E1lido. O valor de ccInitComplete \u00E9 %lu
DUMP028=O bloqueio exclusive da VM n\u00E3o p\u00F4de ser obtido antes da execu\u00E7\u00E3o do dump do sistema.
SHRC510=Desative a cria\u00E7\u00E3o de dumps em caches danificados
DUMP027=O heapdump solicitado n\u00E3o foi produzido porque um outro componente est\u00E1 retendo o bloqueio exclusive da VM.
DUMP026=Nome de IEATDUMP excedendo o comprimento m\u00E1ximo permitido. Nome padr\u00E3o usado.
DUMP025=Falha de IEATDUMP para DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=V\u00E1rios dumps do heap foram solicitados mas %%id est\u00E1 ausente no r\u00F3tulo do arquivo\: os dumps ser\u00E3o sobrescritos
DUMP023=A prepara\u00E7\u00E3o de heap solicitada n\u00E3o foi executada porque o acesso exclusive n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
DUMP022=A compacta\u00E7\u00E3o de heap solicitada n\u00E3o foi executada porque o acesso exclusive n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
DUMP021=O heapdump solicitado n\u00E3o foi produzido porque o acesso exclusive n\u00E3o foi solicitado e n\u00E3o p\u00F4de ser obtido.
DUMP020=O dump %s foi gravado
SHRC509=Crie um cache uma gera\u00E7\u00E3o mais antiga do que a gera\u00E7\u00E3o atual.
SHRC508=Adquirido um sem\u00E1foro diferente daquele usado anteriormente com este cache. Antigo semid\=%d, novo semid\=%d
SHRC507=Execute verifica\u00E7\u00F5es extras ao armazenar e alocar os dados de depura\u00E7\u00E3o de classe
SHRC506=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque seu tamanho de %lu \u00E9 maior do que o tamanho do cache total de %u armazenado no cabe\u00E7alho do cache
SHRC505=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o superior do espa\u00E7o livre %p menos o endere\u00E7o inferior do espa\u00E7o livre %p excede o tamanho da regi\u00E3o de depura\u00E7\u00E3o de %lu bytes
SHRC504=O in\u00EDcio dos dados em cache \u00E9 nulo. In\u00EDcio de dados\: %p
SHRC503=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o armazenamento dos bytes da 'tabela de n\u00FAmero da linha' %d  e dos bytes da 'tabela de vari\u00E1vel local' %d resultar\u00E1 em um endere\u00E7o superior de 'dados da tabela de n\u00FAmero da linha' de %p, que ser\u00E1 maior do que o novo endere\u00E7o inferior de dados da 'tabela de vari\u00E1vel local' %p
SHRC502=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o inferior dos 'dados da tabela de vari\u00E1vel local' %p, \u00E9 maior do que o endere\u00E7o superior %p
DUMP019=JVM solicitando dump %s
SHRC501=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o inferior de 'dados da tabela do n\u00FAmero da linha' %p, \u00E9 maior do que o endere\u00E7o superior %p
DUMP018=O evento solicitado n\u00E3o est\u00E1 dispon\u00EDvel\: execute com o sinalizador -Xdump\:dynamic
SHRC500=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o inferior do espa\u00E7o livre %p, \u00E9 maior do que o endere\u00E7o superior do espa\u00E7o livre %p
DUMP017=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel compactar o arquivo (%s)
DUMP016=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel criar o arquivo (%s)
DUMP015=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel abrir ou ler (%s)
DUMP014=A\u00E7\u00E3o de VM n\u00E3o reconhecida\: ...%s
DUMP013=Evento de dump processado "%1$s", detalhe "%3$.*2$s".
DUMP012=Erro no dump %1$s\: %2$s
DUMP011=O dump %1$s criou o processo %2$d
DUMP010=%1$s dump gravado em %2$s
EXEL111=\  -XX\:+StoreIntermediateClassfile   armazenar dados de classe de base a serem usados durante a re-transforma\u00E7\u00E3o
EXEL110=\  -XX\:ShareClassesDisableBCI   criar o cache de classe compartilhada sem suporte para instrumenta\u00E7\u00E3o de bytecode
DUMP009=Dump %s n\u00E3o dispon\u00EDvel
DUMP008=usando '%s'
DUMP007=JVM Solicitando dump %1$s utilizando '%2$s'
DUMP006=Processando o evento de dump "%1$s", detalhe "%3$.*2$s" - aguarde.
DUMP005=Ferramenta externa ausente
DUMP004=Nome de arquivo ausente
DUMP003=Agente de dump n\u00E3o reconhecido\: %s
DUMP002=Token n\u00E3o reconhecido\: %%%1$c
DUMP001=Evento de dump n\u00E3o reconhecido\: ...%s
DUMP000=Op\u00E7\u00E3o de dump n\u00E3o reconhecida\: -Xdump\:%s
TNNT004=Arquivo tenant.properties malformado (%1$s).  N\u00E3o \u00E9 poss\u00EDvel decodificar key\='%2$s' value\='%3$s' necess\u00E1rios
TNNT003=tenant.properties malformado, chave necess\u00E1ria (%2$s) ausente do arquivo (%1$s)
TNNT002=N\u00E3o foi poss\u00EDvel ler o arquivo de propriedades de isolamento necess\u00E1rio (%1$s)
TNNT001=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o ativador arrendat\u00E1rio
EXEL109=\  -XX\:ShareClassesEnableBCI   criar o cache de classe compartilhada com suporte para instrumenta\u00E7\u00E3o de bytecode
TNNT000=Suporte de arrendat\u00E1rio ativado.
EXEL108=\  -Xzero\:nosharebootzip   n\u00E3o compartilhar caches de entrada do JAR de inicializa\u00E7\u00E3o no cache de classe compartilhada
EXEL107=\  -Xscmaxjitdata<x>   configurar o espa\u00E7o m\u00E1ximo do cache de classes compartilhado permitido para os dados JIT para <x>
EXEL106=\  -Xscminjitdata<x>   configurar o espa\u00E7o m\u00EDnimo de cache de classes compartilhado reservado para os dados JIT para <x>
EXEL105=\  -Xscmaxjit<x>   configurar o espa\u00E7o m\u00E1ximo do cache de classes compartilhado permitido para os dados de JIT para <x>
EXEL104=\  -Xscminjit<x>   configurar o espa\u00E7o m\u00EDnimo de cache de classes compartilhado reservado para os dados de JIT para <x>
EXEL103=\  -Xscdmx<x>      configurar o tamanho da \u00E1rea do atributo de depura\u00E7\u00E3o do cache de classe compartilhado para <x>
EXEL102=\n  -Xdiagnosticscollector ativar o Coletor de Diagn\u00F3sticos
EXEL101=\n  -Xhealthcenter  ativar o agente Health Center
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj ativar realtime tempor\u00E1rio
CFRE099=modificadores de m\u00E9todo ilegais
CFRE098=a assinatura de vari\u00E1vel local deve ser uma cadeia
CFRE097=duplicar entrada de classe interna no atributo
CFRE096=direcionar n\u00E3o-instru\u00E7\u00E3o em bytecode switch
CFRE095=as anota\u00E7\u00F5es devem ser interfaces
CFRE094=o bytecode instanceof deve referir-se a uma classe
CFRE093=o m\u00E9todo pode ser no m\u00E1ximo um entre p\u00FAblico privado ou protegido
CFRE092=assinatura inv\u00E1lida
CFRE091=o PC de in\u00EDcio do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o
CFRE090=o novo bytecode n\u00E3o pode criar matrizes
CFRE089=esperando nome e tipo
CFRE088=o nome da vari\u00E1vel local deve ser uma cadeia
CFRE087=o bytecode do m\u00E9todo de interface deve referenciar um InterfaceMethodref
CFRE086=o m\u00E9todo possui dois atributos Code
CFRE085=o nome interno deve ser uma cadeia
CFRE084=sem erro
CFRE083=a classe \u00E9 abstrata e final
CFRE082=<init> o m\u00E9todo n\u00E3o pode ser est\u00E1tico, final, sincronizado, nativo ou abstrato
CFRE081=o arquivo de origem deve ser um UTF8
CFRE080=a assinatura de m\u00E9todo \u00E9 inv\u00E1lida
CFRE079=o PC do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE078=o \u00EDndice da classe de m\u00E9todo de inclus\u00E3o deve referir-se a uma classe
CFRE077=as interfaces devem ser abstratas
CFRE076=n\u00FAmero m\u00E1gico inv\u00E1lido
CFRE075=assinatura de vari\u00E1vel local inv\u00E1lida
CFRE074=nenhum atributo Code especificado
CFRE073=atributo StackMap/StackMapTable localizado fora do atributo Code
CFRE072=entradas n\u00E3o classificadas no bytecode lookupswitch
CFRE071=a matriz de bytecode est\u00E1 vazia
CFRE070=PC de n\u00FAmero de linha inv\u00E1lido
CFRE069=comprimento do atributo maior do que os dados do atributo
CFRE068=o nome da classe \u00E9 inv\u00E1lido
CFRE067=tag de entrada do conjunto de constantes desconhecida
CFRE066=atributos InnerClasses m\u00FAltiplos
CFRE065=v\u00E1rios atributos de m\u00E9todos de inclus\u00E3o
CFRE064=o descritor deve ser uma cadeia UTF8
CFRE063=o bytecode invoke chama o m\u00E9todo inv\u00E1lido
CFRE062=o m\u00E1x. de locais \u00E9 menor do que o tamanho de argumentos
CFRE061=o nome deve ser uma cadeia UTF8
CFRE060=o PC de final do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o ou o final da matriz de bytecode
CFRE059=o PC do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o
CFRE058=\u00EDndice de vari\u00E1vel local fora do intervalo no retorno da sub-rotina
CFRE057=o tipo de manipulador de exce\u00E7\u00F5es deve ser uma classe
CFRE056=contagem do argumento de bytecode invokeinterface incorreta
CFRE055=o PC de fim do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE054=o bytecode de campo deve fazer refer\u00EAncia a um Fieldref
CFRE053=o m\u00E9todo possui mais de 255 slots de argumentos
CFRE052=a classe externa deve ser uma classe
CFRE051=a constante da cadeia deve ser uma cadeia
CFRE050=o m\u00E9todo da interface deve ser p\u00FAblico e abstrato
J9TI067=Cancelar uma assinatura para tracepoints de VM
J9TI066=Criar uma assinatura para tracepoints de VM
J9TI065=Fun\u00E7\u00E3o de inicializa\u00E7\u00E3o %s do agente n\u00E3o localizada na biblioteca %s
J9TI064=A fun\u00E7\u00E3o de inicializa\u00E7\u00E3o %s do agente falhou para a biblioteca %s, c\u00F3digo de retorno %d
J9TI063=Obt\u00E9m o ponteiro J9Method de JMethodID
J9TI062=Obt\u00E9m o ponteiro J9VMThread de um jthread
J9TI061=Cancelar uma assinatura para registros de GC detalhados
J9TI060=Criar uma assinatura para registros de GC detalhados
CFRE049=o bytecode checkcast deve referir-se a uma classe
CFRE048=\u00EDndice de vari\u00E1vel local fora do intervalo no armazenamento
CFRE047=a classe de interface pode ser apenas p\u00FAblica, abstrata ou de anota\u00E7\u00E3o
CFRE046=preenchimento de bytecode switch incorreto
CFRE045=\u00EDndice de conjunto de constantes fora do intervalo
CFRE044=o bytecode invokeinterface reservou o slot diferente de zero
CFRE043=o bytecode n\u00E3o pode ser ampliado
CFRE042=tamanho de matriz de bytecode > 65535
CFRE041=vers\u00E3o secund\u00E1ria inv\u00E1lida
CFRE040=comprimento do atributo menor que os dados do atributo
J9TI059=Obter a quantia de mem\u00F3ria nativa usada pela JVM, quebrada dentro das categorias de mem\u00F3ria.
J9TI058=N\u00E3o foi poss\u00EDvel configurar as op\u00E7\u00F5es de log da JVM.
J9TI057=N\u00E3o foi poss\u00EDvel converter as sequ\u00EAncias nativas das op\u00E7\u00F5es de log da JVM.
J9TI056=N\u00E3o foi poss\u00EDvel consultar as op\u00E7\u00F5es de log da JVM.
J9TI055=N\u00E3o foi poss\u00EDvel alocar o buffer para as op\u00E7\u00F5es de log da JVM.
J9TI054=Solicitar um dump de Java Lock Monitor (JLM) com um especificador de formato.
J9TI053=Configurar as op\u00E7\u00F5es de log da VM.
J9TI052=Consultar as op\u00E7\u00F5es atuais de log da VM.
J9TI051=Limpar o sinalizador per-method para notifica\u00E7\u00E3o seletiva de entrada e sa\u00EDda.
J9TI050=Obter um c\u00F3digo hash para o monitor de um objeto.
RCMT000=Gerenciamento de recurso ativado.
CFRE039=\u00EDndice de vari\u00E1vel local fora do intervalo no carregamento
CFRE038=o m\u00E9todo possui dois atributos Exceptions
CFRE037=temp cont\u00E9m um tipo incorreto
CFRE036=direcionar n\u00E3o-instru\u00E7\u00E3o em bytecode jump
CFRE035=o novo bytecode deve referir-se a uma classe
CFRE034=bytecode incompleto
CFRE033=o intervalo do manipulador de exce\u00E7\u00F5es est\u00E1 vazio
CFRE032=a superclasse da interface deve ser java.lang.Object
CFRE031=a exce\u00E7\u00E3o lan\u00E7ada deve ser uma classe
CFRE030=superclasse nula
J9TI049=Os nomes de Classe de Retorno, M\u00E9todo e Pacote para um conjunto de ponteiros do M\u00E9todo RAM
J9TI048=Obt\u00E9m os metadados de rastreio que podem ser usados com o formatador para processar buffers de rastreio
J9TI047=Todos os registros de rastreio em uso s\u00E3o alternados e passados para assinantes do rastreio
J9TI046=Cancelar uma assinatura para registros de rastreio externos
J9TI045=Criar uma assinatura para registros de rastreio externos
J9TI044=Excluir todas as tags de objeto.
J9TI043=Sinalizar carregamento de classe apenas para classes de matriz.
J9TI042=Sinalizar tags autom\u00E1ticas para o objeto recentemente alocado e sua classe.
J9TI041=Sinalizar o evento renomeado por objeto(s) (movido ou exclu\u00EDdo).
J9TI040=Inclui o recurso estendido can_autotag_objects.
CFRE029=o bytecode multianewarray deve referir-se a uma classe
CFRE028=o bytecode ldc* deve referir-se a uma constante
CFRE027=o bytecode multianewarray deve referir-se a uma classe de matriz
CFRE026=tipo de bytecode newarray n\u00E3o reconhecido
CFRE025=o campo possui dois atributos ConstantValue
CFRE024=o nome da classe deve ser uma cadeia
CFRE023=conjunto de constantes vazio
CFRE022=thisClass deve ser uma classe
CFRE021=campo duplicado
CFRE020=o PC de in\u00EDcio do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
J9TI039=Destruir um cache compartilhado nomeado.
J9TI038=Iterar sobre caches compartilhados.
J9TI037=Obter a mem\u00F3ria total do heap.
J9TI036=Obter a mem\u00F3ria livre do heap atual.
J9TI035=Ciclo de coleta de lixo conclu\u00EDdo.
J9TI034=Ciclo de coleta de lixo iniciado.
J9TI033=Reconfigure as op\u00E7\u00F5es de dump de VM.
J9TI032=Indica que um encadeamento processou o evento ass\u00EDncrono
J9TI031=Cancela o evento ass\u00EDncrono em um \u00FAnico encadeamento ou em todos os encadeamentos
J9TI030=Sinaliza o evento ass\u00EDncrono em um \u00FAnico encadeamento ou em todos os encadeamentos
CFRE019=in\u00EDcio de PC de vari\u00E1vel local inv\u00E1lido
CFRE018=a classe interna deve ser uma classe
CFRE017=atributos StackMap/StackMapTable m\u00FAltiplos
CFRE016=\u00EDndice de vari\u00E1vel local fora do intervalo em incremento
CFRE015=as interfaces devem ser classes
CFRE014=Atributo de c\u00F3digo especificado para um m\u00E9todo nativo ou abstrato
CFRE013=comprimento de PC vari\u00E1vel local inv\u00E1lido
CFRE012=o valor constante deve ser um valor
CFRE011=o bytecode anewarray deve referir-se a uma classe
CFRE010=contagem negativa para pares de correspond\u00EAncia e deslocamento no bytecode lookupswitch
J9TI029=Consulta a configura\u00E7\u00E3o do agente de dump do RAS.
J9TI028=Relata o fim de um dump de RAS.
J9TI027=Relata o in\u00EDcio de um dump de RAS.
J9TI026=Aciona um dump utilizando a configura\u00E7\u00E3o de RAS fornecida.
J9TI025=Permitir JNI direta na presen\u00E7a de eventos de entrada e sa\u00EDda de m\u00E9todo (resultando em um prov\u00E1vel relat\u00F3rio impreciso de entrada e sa\u00EDda)
J9TI024=Sa\u00EDda de m\u00E9todo sem o valor de retorno.
J9TI023=Obter informa\u00E7\u00F5es estendidas sobre o quadro para uma lista de encadeamento
J9TI022=Obter informa\u00E7\u00F5es estendidas sobre o quadro para todos os rastreios de pilha
J9TI021=Obter informa\u00E7\u00F5es estendidas sobre o quadro
J9TI020=Obt\u00E9m o ID de encadeamento de S.O. de um jthread
CFRE009=o campo de interface deve ser est\u00E1tico p\u00FAblico e final
CFRE008=alto < baixo no bytecode tableswitch
CFRE007=a assinatura do campo \u00E9 inv\u00E1lida
CFRE006=atributo StackMap/StackMapTable inv\u00E1lido
CFRE005=interface duplicada
CFRE004=bytecode desconhecido
JVMP000=A tentativa para instrumentar %.*s atrav\u00E9s de JVMPI foi proibida
JNCK099=Erro de JNI em %1$s\: argumento \#%2$d requer um tipo sem matriz
CFRE003=vers\u00E3o principal inv\u00E1lida
JNCK098=Erro de JNI em %1$s\: argumento \#%2$d espera %3$s %4$s, o argumento real \u00E9 %5$s %6$s
CFRE002=o nome do m\u00E9todo \u00E9 inv\u00E1lido
JNCK097=\tadvice         exibir recomenda\u00E7\u00E3o
CFRE001=%1$s; class\=%3$.*2$s, offset\=%4$u
JNCK096=\twarn           exibir avisos
CFRE000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
JNCK095=Erro de JNI no valor retornado\: o tipo de retorno \u00E9 uma refer\u00EAncia mas o valor (0x%1$p) n\u00E3o \u00E9 uma refer\u00EAncia de objeto v\u00E1lida. Seu tipo \u00E9\: %2$s
JNCK094=Erro de JNI em %1$s\: Os dados apontados pelo argumento \#%2$d foram modificados durante a execu\u00E7\u00E3o de %3$s. Os dados podem ter sido modificados por outro encadeamento ou por uma chamada aninhada. O resultado de %4$s pode estar incorreto e o VM pode se tornar inst\u00E1vel
JNCK093=Erro de JNI em %s\: O m\u00E9todo n\u00E3o \u00E9 um construtor
J9TI019=Configura o modo de notifica\u00E7\u00E3o para eventos estendidos, permitindo seletividade em n\u00EDvel de encadeamento
JNCK092=\tvalist         check for va_list reuse
J9TI018=Configura um m\u00E9todo para notifica\u00E7\u00E3o seletiva de entrada e sa\u00EDda.
JNCK091=Detectada recomenda\u00E7\u00E3o no quadro do manipulador de um evento JVMPI ou JVMTI\n
J9TI017=Controla v\u00E1rias op\u00E7\u00F5es de VM e de compila\u00E7\u00E3o.
JNCK090=Detectado aviso no quadro do manipulador de um evento JVMPI ou JVMTI\n
J9TI016=Permitir seq\u00FCenciamento na presen\u00E7a de eventos de entrada e sa\u00EDda de m\u00E9todo (resultando em um prov\u00E1vel relat\u00F3rio impreciso de entrada e sa\u00EDda)
J9TI015=Solicita um dump JLM.
J9TI014=Controla o JLM (Java Lock Monitor) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI013=Permite retornos de chamada para aloca\u00E7\u00F5es instrument\u00E1veis (as n\u00E3o relatadas por VMObjectAlloc).
J9TI012=Inclua uma op\u00E7\u00E3o -Xdump din\u00E2mica
J9TI011=Inclua uma op\u00E7\u00E3o -Xtrace din\u00E2mica
J9TI010=Entrada do m\u00E9todo com informa\u00E7\u00F5es estendidas sobre o tipo de m\u00E9todo.
JNCK089=Detectado erro no quadro do manipulador de um evento JVMPI ou JVMTI\n
JNCK088=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma refer\u00EAncia fraca. Uma refer\u00EAncia fraca pode se tornar NULA a qualquer momento. A refer\u00EAncia deve ser promovida utilizando NewLocalRef ou NewGlobalRef e, em seguida, comparada com NULO antes de chamar %3$s
JNCK087=Erro de JNI em \#%1$s\: O argumento \#%2$d n\u00E3o \u00E9 java/lang/reflect/Method ou java/lang/reflect/Constructor
JNCK086=Aviso de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 um java/nio/Buffer. %3$s retornar\u00E1 um c\u00F3digo de erro
JNCK085=Orienta\u00E7\u00E3o detectada em JNI_OnLoad da biblioteca %.*s\n
JNCK084=Aviso detectado em JNI_OnLoad da biblioteca %.*s\n
JNCK083=Erro detectado em JNI_OnLoad da biblioteca %.*s\n
J9TI009=Indica o fim de uma fase de compila\u00E7\u00E3o de JIT. (N\u00E3o \u00E9 seguro para retorno de chamada)
JNCK082=A orienta\u00E7\u00E3o foi detectada no quadro mais externo de um encadeamento conectado\n
J9TI008=Indica o in\u00EDcio de uma fase de compila\u00E7\u00E3o de JIT. (N\u00E3o \u00E9 seguro para retorno de chamada)
JNCK081=O aviso foi detectado no quadro mais externo de um encadeamento conectado\n
J9TI007=Obtenha o conjunto atual de recursos estendidos por meio de capabilities_ptr.
JNCK080=O erro foi detectado no quadro mais externo de um encadeamento conectado\n
J9TI006=Elimine os recursos estendidos de capabilities_ptr.
J9TI005=Inclua os novos recursos estendidos a partir de capabilities_ptr.
J9TI004=Retorna por meio do capabilities_ptr os recursos estendidos dispon\u00EDveis neste momento.
J9TI003=Agent_OnLoad falhou para a biblioteca %s
J9TI002=Agent_OnLoad n\u00E3o localizado na biblioteca %s
J9TI001=A biblioteca do agente %1$s n\u00E3o p\u00F4de ser aberta (%2$s)
J9TI000=Sem mem\u00F3ria, est\u00E1 tentando carregar a biblioteca do agente %s
JNCK079=Orienta\u00E7\u00E3o detectada em %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK078=Aviso detectado em %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK077=Erro detectado em %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK076=Erro interno de jnichk em %s\: Sem mem\u00F3ria
JNCK075=Erro interno de jnichk em %1$s\: Descritor n\u00E3o reconhecido 0x%2$x
JNCK074=Orienta\u00E7\u00E3o de JNI em %s\: Parece que o buffer n\u00E3o foi modificado. Considere a possibilidade de utilizar JNI_ABORT, em vez de modo 0.
JNCK073=Orienta\u00E7\u00E3o de JNI em %1$s\: JNI_ABORT foi especificado, mas n\u00E3o pode ser honrado porque os dados foram modificados.\n(CRC original\=0x%2$x, novo CRC\=0x%3$x).\nComo %4$s retornou o conte\u00FAdo real da matriz, as altera\u00E7\u00F5es n\u00E3o ser\u00E3o descartadas. Isto pode n\u00E3o ser o que voc\u00EA desejada.
JNCK072=Orienta\u00E7\u00E3o de JNI em %1$s\: JNI_COMMIT foi especificado, mas ser\u00E1 ignorado.\nComo %2$s retornou o conte\u00FAdo real da matriz, o buffer ser\u00E1 inv\u00E1lido ap\u00F3s esta chamada. Isto pode n\u00E3o ser o que voc\u00EA desejada.
JNCK071=Aviso de JNI\: A mem\u00F3ria em 0x%1$p, obtida por %2$s, n\u00E3o foi liberada antes de retornar de nativo. Provavelmente, seja uma fuga de mem\u00F3ria.
JNCK070=Aviso de JNI em %1$s\: Dados originais da matriz foram modificados entre %2$s e %3$s.\n(CRC original\=0x%4$x, novo CRC\=0x%5$x).\nComo %6$s retornou uma c\u00F3pia do conte\u00FAdo da matriz, o novo conte\u00FAdo ser\u00E1 perdido.
JNCK069=Aviso de JNI em %1$s\: Fim est\u00E1 fora do intervalo (%2$d + %3$d > %4$d)
JNCK068=Aviso de JNI em %1$s\: O in\u00EDcio ou \u00EDndice est\u00E1 fora do intervalo (%2$d >\= %3$d)
JNCK067=Aviso de JNI em %1$s\: Tamanho de regi\u00E3o negativo (%2$d) especificado
JNCK066=Aviso de JNI em %1$s\: In\u00EDcio ou \u00EDndice negativo (%2$d) especificado
JNCK065=Aviso JNI em %1$s\: Aumento autom\u00E1tico da capacidade de quadro de refer\u00EAncia local de %2$d para %3$d. %4$d refer\u00EAncias est\u00E3o em uso.\nUtilize EnsureLocalCapacity ou PushLocalFrame para aumentar explicitamente o quadro.
JNCK064=Aviso JNI em %1$s\: Aumento autom\u00E1tico fraco da capacidade do conjunto de refer\u00EAncia de %2$d para %3$d.\nIsto pode ser um indicador de fuga de mem\u00F3ria.
JNCK063=Aviso JNI em %1$s\: Aumento autom\u00E1tico da capacidade do conjunto de refer\u00EAncias global de %2$d para %3$d.\nIsto pode ser um indicador de fuga de mem\u00F3ria.
JNCK062=Aviso de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o deve ser chamada dentro de uma se\u00E7\u00E3o cr\u00EDtica
JNCK061=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma assinatura de campo malformada ("%3$s")
JNCK060=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma assinatura de m\u00E9todo malformada ("%3$s")
JNCK059=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 um identificador malformado ("%3$s")
JNCK058=Aviso de JNI em %1$s\: Depois de chamar %2$s, voc\u00EA deve verificar se h\u00E1 exce\u00E7\u00F5es utilizando ExceptionCheck, ExceptionClear ou ExceptionOccurred antes de chamar %3$s
JNCK057=Erro de JNI em %1$s\: N\u00E3o utilize %2$s para liberar mem\u00F3ria 0x%3$p adquirida utilizando %4$s
JNCK056=Erro de JNI em %1$s\: A mem\u00F3ria 0x%2$p foi obtida do objeto 0x%3$p, liberando de 0x%4$p
JNCK055=Erro de JNI em %1$s\: O ponteiro 0x%2$p n\u00E3o foi retornado por nenhuma fun\u00E7\u00E3o da JNI ou j\u00E1 foi liberado
JNCK054=Erro de JNI em %1$s\: Op\u00E7\u00E3o de modo n\u00E3o reconhecida %2$d
JNCK053=Erro de JNI\: A se\u00E7\u00E3o cr\u00EDtica deve ser liberada antes da fun\u00E7\u00E3o ser retornada
JNCK052=Erro de JNI em %1$s\: A classe %3$.*2$s \u00E9 obsoleta
JNCK051=Erro interno de VM em %1$s\: Os bytes enviados %2$p s\u00E3o menores do que os bytes de refer\u00EAncia JNI %3$p
SHRC199=\ Armazenamento bem-sucedido de %2$.*1$s.
JNCK050=Erro de JNI em %s\: PopLocalFrame foi chamado sem um quadro local na pilha
SHRC198=Armazenando c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado...
SHRC197=Localizando c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado...
SHRC196=[-Xshareclasses sa\u00EDda detalhada AOT ativada]
SHRC195=Ativar sa\u00EDda detalhada de AOT
SHRC194=\tpara ROMClass %2$.*1$s em 0x%3$p.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC192=O valor -Xscmaxaot \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado como ilimitado
SHRC191=O valor -Xscminaot \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado para ser igual ao valor -Xscmx
SHRC190=O valor -Xscminaot n\u00E3o deve ser maior do que o valor -Xscmaxaot
