MWF.xApplication.AppMarketV2.LP = {
    "title": "ຕະຫຼາດແອັບ",
    "implodeLocal": "ນໍາເຂົ້າຈາກທ້ອງຖິ່ນ",
    "download": "ດາວໂຫຼດຟຣີ",
    "setupTitle": "ກ່ຽວກັບການຕິດຕັ້ງ",
    "ok": "ຕົກລົງ",
    "cancel": "ຍົກເລີກ",

    "downloadInfor": "ໂມດູນຕໍ່ໄປນີ້ຈະຖືກດາວໂຫຼດ ແລະຕິດຕັ້ງ:",

    "setup": "ຕິດຕົັ້ງ",
    "setupDone":"ຕິດຕັ້ງ",
    "update":"ອັບເດດ",
    "conflict": "ຂໍ້ຂັດແຍ່ງ",

    "ignore": "ບໍ່ສົນໃຈ",
    "create": "ສ້າງ",
    "cover": "ກວມເອົາ",
    "name": "ຊື່",
    "id": "ລະຫັດ",
    "setupSuccess": "ຕິດຕັ້ງແອັບພລິເຄຊັນສຳເລັດແລ້ວ!",
    "localApp": "ແອັບພິລເຄຊັນທ້ອງຖິ່ນ",
    "confirmsetupTitle":"ຢືນຢັນການຕິດຕັ້ງ",
    "confirmsetupContent":"ທ່ານແນ່ໃຈບໍ່ວ່າຕິດຕັ້ງແອັບພລິເຄຊັນນີ້?",
    "confirmupdateTitle" : "ຢືນຢັນການອັບເດດ",
    "confirmupdateContent":"ທ່ານແນ່ໃຈບໍ່ທີ່ຈະອັບເດດແອັບພລິເຄຊັນນີ້? ຖ້າຫາກທ່ານປ່ຽນແອັບ ນີ້ຫຼັງຈາກການຕິດຕັ້ງຄໍາຮ້ອງສະຫມັກ, ມັນຈະໄດ້ຮັບການທົດແທນຫຼັງຈາກການປັບປຸງນີ້",

    "all" : "ທັງໝົດ",
    "searchHolder": "ໃສ່ຄຳຄົ້ນຫາ",
    "accessDenyNotice": "ຕະຫຼາດແອັບຕ້ອງການບົດບາດຜູ້ບໍລິຫານເພື່ອເຂົ້າເຖິງ"
}