MWF.xApplication.process.DictionaryDesigner.LP = {
    "title": "ບັນນາທິການວັດຈະນານຸກົມ",
    "newDictionary": "ສ້າງວັດຈະນານຸກົມ",
    "property": "ຊັບສິນ",
    "item": "ລາຍການ",
    "type": "ປະເພດ",
    "value": "ຄຸນຄ່າ",
    "dictionary": "ວັດຈະນານຸກົມ",
    "search": "ຄົ້ນຫາ",
    "next": "ຕໍ່ໄປ",

    "id": "ລະຫັດ",
    "name": "ຊື່",
    "alias": "ນາມສະກຸນ",
    "description": "ລາຍລະອຽດ",
    "ProjectionType": "ປະເພດການຄາດຄະເນ",
    "ProjectionProcess": "ຂະບວນການຄາດຄະເນ",

    "design": "ອອກແບບ",
    "script": "ເນື້ອໃນ",

    "notice": {
        "save_success": "ບັນທຶກວັດຈະນານຸກົມຂໍ້ມູນສຳເລັດແລ້ວ!",

        "deleteDataTitle": "ລົບການຢືນຢັນຂໍ້ມູນ",
        "deleteData": "ທ່ານແນ່ໃຈບໍ່ທີ່ຈະລົບຂໍ້ມູນປັດຈຸບັນ ແລະຂໍ້ມູນຍ່ອຍຂອງມັນອອກ?",

        "changeTypeTitle": "ປ່ຽນການຢືນຢັນປະເພດຂໍ້ມູນ",
        "changeTypeDeleteChildren": "ການປ່ຽນປະເພດຂໍ້ມູນຈະລົບຂໍ້ມູນເດັກນ້ອຍທັງໝົດ. ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການປະຕິບັດມັນ?",
        "changeType": "ການປ່ຽນປະເພດຂໍ້ມູນຈະປ່ຽນຄ່າຂອງຂໍ້ມູນ. ທ່ານແນ່ໃຈບໍວ່າທ່ານຕ້ອງການທີ່ຈະປະຕິບັດມັນ?",

        "inputTypeError": "ປະເພດຂໍ້ມູນທີ່ທ່ານໃສ່ຜິດ, ກະລຸນາໃສ່ໃໝ່",
        "sameKey": "ຊື່ລາຍການທີ່ເຈົ້າໃສ່ນັ້ນມີຢູ່ໃນວັດຖຸແລ້ວ, ກະລຸນາໃສ່ໃໝ່",
        "emptyKey": "ຊື່ໂຄງການບໍ່ສາມາດຫວ່າງເປົ່າໄດ້, ກະລຸນາໃສ່ໃໝ່",
        "numberKey": "ຊື່ລາຍການບໍ່ສາມາດເປັນຕົວເລກໄດ້, ກະລຸນາໃສ່ໃໝ່",

        "sameObjectKey": "ຊື່ລາຍການຊ້ຳກັນ",
        "emptyObjectKey": "ຊື່ໂຄງການບໍ່ສາມາດຫວ່າງເປົ່າ",
        "numberObjectKey": "ຊື່ລາຍການບໍ່ສາມາດເປັນຕົວເລກໄດ້",
        "editorNotValidated": "ກະລຸນາແກ້ໄຂຂໍ້ຜິດພາດທີ່ຖືກລາຍງານໂດຍບັນນາທິການກ່ອນ",

        "inputName": "ກະລຸນາໃສ່ຊື່ວັດຈະນານຸກົມຂໍ້ມູນ ແລະນາມແຝງ",
        "noModifyName": "ບໍ່ສາມາດແກ້ໄຂຊື່ ຫຼືນາມແຝງ",
        "jsonParseError": "ຮູບແບບ json ຜິດພາດ, ກະລຸນາແກ້ໄຂມັນກ່ອນ"
    },
    "isSave": "ກຳລັງບັນທຶກ, ກະລຸນາລໍຖ້າ..."
};
 