MWF.xApplication.process.ProcessManager.LP = {
    "title": "ການຄຸ້ມຄອງຂະບວນການ",
    "categoryTitle": "ໝວດໝູ່",
    "description": "ລາຍລະອຽດ",
    "deleteItems": "ລົບອົງປະກອບທີ່ເລືອກ",
    "copy": "ສຳເນົາ",
    "copyto": "ສຳເນົາ...",
    "copyInfor": "ເລືອກຫຼາຍອົງປະກອບ, ກົດ Ctrl+C ເພື່ອສຳເນົາອົງປະກອບ, ກົດ Ctrl+V ເພື່ອວາງອົງປະກອບໃສ່ໃນແອັບພລິເຄຊັນປະຈຸບັນ",
    "copyed": "ອົງປະກອບທີ່ເລືອກໄດ້ຖືກຄັດລອກ",
    "copyConfirmTitle": "ສຳເນົາການຢືນຢັນອົງປະກອບ",
    "copyConfirmInfor": "ພື້ນທີ່ເປົ້າໝາຍມີອົງປະກອບດຽວກັນແລ້ວ:",
    "copySource": "ໄຟລ໌ຕົ້ນສະບັບ:",
    "copyTarget": "ສຳເນົາໄຟລ໌:",
    "copyConfirm_overwrite": "ແທນທີ່",
    "copyConfirm_new": "ສ້າງ",
    "copyConfirm_skip": "ຂ້າມ",
    "copyConfirm_cancel": "ຍົກເລີກ",
    "copynew": "ໃຫມ່",

    "formConfig": "ແບບຟອມ",
    "processConfig": "ຂະບວນການ",
    "dataConfig": "ຂໍ້ມູນ",
    "scriptConfig": "ເນື້ອໃນ",
    "fileConfig": "ຊັບພະຍາກອນ",
    "applicationConfig": "ຄຸນລັກສະນະ",

    "findDesigner": "ຊອກຫາໂຄດ",

    "ok": "ຕົກລົງ",
    "edit": "ແກ້ໄຂ",
    "save": "ບັນທຶກ",
    "cancel": "ຍົກເລີກ",

    "phone": "ໂທລະສັບ",
    "mail": "ອີເມລ",

    "deleteElementTitle": "ລົບການຢືນຢັນການອອກແບບ",
    "deleteElement": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບອົງປະກອບອອກແບບທີ່ເລືອກ?",

    "deleteProcessTitle": "ລົບການຢືນຢັນການອອກແບບ",
    "deleteProcess": "ການລົບຂະບວນການທີ່ເລືອກໄວ້ຈະເປັນການລົບຕົວຢ່າງປັດຈຸບັນຂອງຂະບວນການທີ່ເລືອກ. ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບຂະບວນການທີ່ເລືອກ?",

    "process": {
        "create": "ສ້າງຂະບວນການ",
        "search": "ຂະບວນການຄົ້ນຫາ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",

        "noProcessNoticeText": "ແອັບພລິເຄຊັນນີ້ຍັງບໍ່ມີຂະບວນການເທື່ອ, ທ່ານສາມາດກົດທີ່ນີ້ເພື່ອສ້າງຂະບວນການໃໝ່",
        "loaded": "ຂະບວນການຖືກໂຫລດ",

        "deleteProcessTitle": "ລົບການຢືນຢັນຂະບວນການ",
        "deleteProcess": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບຂະບວນການປະຈຸບັນ?"

    },
    "form": {
        "create": "ສ້າງແບບຟອມ",
        "search": "ແບບຟອມຄົ້ນຫາ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",

        "noFormNoticeText": "ແອັບພລິເຄຊັນນີ້ບໍ່ມີແບບຟອມເທື່ອ, ທ່ານສາມາດຄລິກທີ່ນີ້ເພື່ອສ້າງແບບຟອມໃໝ່",
        "loaded": "ແບບຟອມຖືກໂຫລດ",
        "deleteFormTitle": "ລົບການຢືນຢັນແບບຟອມ",
        "deleteForm": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບແບບຟອມປະຈຸບັນ?",

        "deleteFormTemplateTitle": "ຢືນຢັນການລົບແມ່ແບບແບບຟອມ",
        "deleteFormTemplate": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບແມ່ແບບແບບຟອມປະຈຸບັນ?"
    },
    "view": {
        "create": "ສ້າງວິວ",
        "search": "ເບິ່ງການຊອກຫາ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",

        "noNoticeText": "ແອັບຯນີ້ຍັງບໍ່ມີມຸມເບິ່ງເທື່ອ, ທ່ານສາມາດກົດທີ່ນີ້ເພື່ອສ້າງມຸມເບິ່ງໃໝ່",
        "loaded": "ເບິ່ງໂຫຼດ",
        "deleteViewTitle": "ລົບການຢືນຢັນການເບິ່ງ",
        "deleteView": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບມຸມມອງປັດຈຸບັນອອກ?"
    },
    "stat": {
        "create": "ສ້າງສະຖິຕິ",
        "search": "ສະຖິຕິການຄົ້ນຫາ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",

        "noNoticeText": "ແອັບພລິເຄຊັນນີ້ບໍ່ມີການຕັ້ງຄ່າສະຖິຕິເທື່ອ, ທ່ານສາມາດກົດທີ່ນີ້ເພື່ອສ້າງການຕັ້ງຄ່າສະຖິຕິໃໝ່",
        "loaded": "ສະຖິຕິຖືກໂຫຼດ",
        "deleteViewTitle": "ລົບການຢືນຢັນສະຖິຕິ",
        "deleteView": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບສະຖິຕິປັດຈຸບັນອອກ?"
    },
    "dictionary": {
        "create": "ສ້າງວັດຈະນານຸກົມຂໍ້ມູນ",
        "search": "ຄົ້ນຫາວັດຈະນານຸກົມຂໍ້ມູນ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",

        "noDictionaryNoticeText": "ແອັບພລິເຄຊັນນີ້ຍັງບໍ່ມີວັດຈະນານຸກົມຂໍ້ມູນເທື່ອ, ທ່ານສາມາດກົດທີ່ນີ້ເພື່ອສ້າງວັດຈະນານຸກົມຂໍ້ມູນໃໝ່",
        "noDictionaryNoCreateNoticeText": "ແອັບພລິເຄຊັນນີ້ບໍ່ມີວັດຈະນານຸກົມຂໍ້ມູນດຽວນີ້",
        "loaded": "ວັດຈະນານຸກົມຂໍ້ມູນຖືກໂຫລດ",
        "deleteFormTitle": "ຢືນຢັນການລົບວັດຈະນານຸກົມຂໍ້ມູນ",
        "deleteForm": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບວັດຈະນານຸກົມຂໍ້ມູນປັດຈຸບັນອອກ?"
    },
    "script": {
        "create": "ສ້າງສະຄຣິບ",
        "search": "ສະຄຣິບຄົ້ນຫາ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",

        "noScriptNoticeText": "ບໍ່ມີສະຄຣິບສຳລັບແອັບພລິເຄຊັນນີ້, ທ່ານສາມາດກົດທີ່ນີ້ເພື່ອສ້າງສະຄຣິບໃໝ່",
        "loaded": "ໂຫລດເນື້ອໃນແລ້ວ",
        "deleteFormTitle": "ລົບການຢືນຢັນສະຄຣິບ",
        "deleteForm": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບສະຄຣິບປັດຈຸບັນອອກ?"
    },
    "file": {
        "create": "ສ້າງໄຟລ໌ແນບ",
        "search": "ຊອກຫາເອກະສານຄັດຕິດ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",
        "description": "ຂໍ້ມູນ",

        "noScriptNoticeText": "ແອັບຯນີ້ບໍ່ມີໄຟລ໌ແນບເທື່ອ, ທ່ານສາມາດຄລິກທີ່ນີ້ເພື່ອສ້າງໄຟລ໌ແນບໃໝ່",
        "loaded": "ໄຟລ໌ແນບຖືກໂຫຼດ",
        "deleteFormTitle": "ຢືນຢັນການລຶບໄຟລ໌ແນບ",
        "deleteForm": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບໄຟລ໌ແນບປັດຈຸບັນອອກ?",
        "saveSuccess": "ໄຟລ໌ແນບໄດ້ຖືກບັນທຶກແລ້ວ!",
        "saveConfirm": "ບັນທຶກການຢືນຢັນ",
        "saveConfirmText": "ໄຟລ໌ແນບໄດ້ຖືກດັດແກ້, ທ່ານຕ້ອງການບັນທຶກເນື້ອຫາທີ່ຖືກແກ້ໄຂບໍ?",
        "uploadSuccess": "ໄຟລ໌ແນບໄດ້ຖືກອັບໂຫລດແລ້ວ",
        "loadFiles": "ການອັບໂຫລດໄຟລເປັນຊຸດ "
    },
    "projection": {
        "create": "ສ້າງການຄາດຄະເນ",
        "search": "ຄົ້ນຫາຂໍ້ມູນການຄາດຄະເນ",
        "searchText": "ກະລຸນາໃສ່ຄໍາສໍາຄັນ",
        "createProjectionType": "ປະເພດການຄາດຄະເນ",
        "createProjectionProcess": "ເລືອກຂະບວນການຄາດຄະເນ",

        "noProjectionType": "ກະລຸນາເລືອກປະເພດການຄາດຄະເນກ່ອນ",
        "noProjectionProcess": "ກະລຸນາເລືອກໂປຣເຈັກເຕີກ່ອນ",

        "noDictionaryNoticeText": "ແອັບພລິເຄຊັນນີ້ບໍ່ມີການຄາດຄະເນເທື່ອ, ທ່ານສາມາດກົດທີ່ນີ້ເພື່ອສ້າງແຜນທີ່ຂໍ້ມູນໃໝ່",
        "noDictionaryNoCreateNoticeText": "ແອັບພລິເຄຊັນນີ້ບໍ່ມີການຄາດຄະເນ",
        "loaded": "ການຄາດຄະເນຖືກໂຫຼດ",
        "deleteFormTitle": "ລົບການຢືນຢັນການຄາດຄະເນ",
        "deleteForm": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບໂປຣເຈັກເຕີປັດຈຸບັນອອກ?",
        "disabled": "ປິດການໃຊ້ງານ",

        "work": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດກັບຕົວຢ່າງໃນການໄຫຼວຽນ",
        "workCompleted": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດກັບຕົວຢ່າງທີ່ສໍາເລັດ",
        "task": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດທີ່ຕ້ອງເຮັດ",
        "taskCompleted": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດໃຫ້ສຳເລັດ",
        "read": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດທີ່ຈະອ່ານ",
        "readCompleted": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດໃຫ້ສຳເລັດ",
        "review": "ສ້າງແຜນທີ່ຂໍ້ມູນທຸລະກິດໃສ່ຕາຕະລາງການອ່ານ",
        "createElementInfor": "ກະລຸນາເລືອກປະເພດແຜນທີ່ຂໍ້ມູນກ່ອນ",
        "noProcessInfor": "ທ່ານໄດ້ສ້າງແຜນທີ່ຂໍ້ມູນປະເພດ {type} ສໍາລັບຂະບວນການທັງໝົດ"
    },

    "application": {
        "inputApplicationName": "ກະລຸນາໃສ່ຊື່ແອັບພລິເຄຊັນ",
        "property": "ຄຸນສົມບັດຂອງແອັບພລິເຄຊັນ",
        "name": "ຊື່ຄໍາຮ້ອງສະຫມັກ",
        "alias": "ແອັບພລິເຄຊັນ ນາມສະກຸນ",
        "description": "ລາຍລະອຽດຄໍາຮ້ອງສະຫມັກ",
        "type": "ປະເພດຄໍາຮ້ອງສະຫມັກ",
        "icon": "ໄອຄອນແອັບ",
        "id": "ລະຫັດ ຄໍາຮ້ອງສະຫມັກ",
        "controllerList": "ຜູ້ຈັດການ",
        "available": "ຊ່ວງທີ່ສາມາດໃຊ້ໄດ້",
        "defaultForm": "ແບບຟອມເລີ່ມຕົ້ນ",

        "changeIcon": "ປ່ຽນໄອຄອນ",
        "setManager": "ຜູ້ຈັດການຊຸດ",
        "setAppManager": "ຕັ້ງຄ່າຕົວຈັດການແອັບພລິເຄຊັນ",
        "setUsableIdentity": "ຕັ້ງຕົວຕົນທີ່ໃຊ້ໄດ້",
        "setUsableUnit": "ຕັ້ງ ຫົວໜ່ວຍທີ່ໃຊ້ໄດ້",
        "setAppUsableIdentity": "ຕັ້ງ ຄ່່າຂໍ້ມູນປະຈຳຕົວທີ່ໃຊ້ງານໄດ້ຂອງແອັບ",
        "setAppUsableUnit": "ຕັ້ງ ຄ່່າໜ່ວຍທີ່ໃຊ້ງານໄດ້ຂອງແອັບ",

        "maintenanceIdentity": "ຜູ້ຮັກສາຂະບວນການ",
        "setMaintainer": "ຕົວຮັກສາຂະບວນການ"
    },
    "createSelectTemplate": "ສ້າງ: ເລືອກແມ່ແບບ",
    "templateCategory": "ໝວດໝູ່ແມ່ແບບ:",
    "all": "ທັງໝົດ",

    "name": "ຊື່",
    "alias": "ນາມແຝງ",
    "attachment": "ແນບ",
    "upload": "ອັບໂຫຼດ",
    "selectorButton": {
        "ok ": "ຕົກລົງ",
        "cancel": "ຍົກເລີກ"
    },

    "defaultProcess": "ມາດຕະຖານ",
    "sequenceProcess": "ລໍາດັບ",
    "choiceProcess": "ທາງເລືອກ",
    "parallelProcess": "ຂະຫນານ",

    "emptyForm": "ເປົ່າ",
    "commonForm": "ສາມັນ",
    "blueForm": "ແບບສີຟ້າ",
    "redForm": "ຮູບແບບສີແດງ",
    "greenForm": "ແບບສີຂຽວ",
    "publishForm": "ເຜີຍແຜ່",
    "fileForm": "ໄຟລແບບຟອມ",
    "submitPcForm": "ສົ່ງແບບຟອມ (PC)",
    "submitMobileForm": "ແບບຟອມສົ່ງ (ມືຖື)"

};
