MWF.xApplication.ConfigDesigner.LP = {
    "title": "ກຳນົດຄ່າ Platform ",
    "newScript": "ກຳນົດຄ່າໃໝ່",
    "scriptLibrary": "ກຳນົດລາຍການ ",
    "property": "ຄຸນສົມບັດ",
    "include": "ອ້າງອີງ",

    "id": "ID",
    "name": "ຊື່",
    "node" : "Node",
    "alias": "ຊື່ຫຼິ້ນ",
    "description": "ອະທິບາຍ",

    "notice": {
        "save_success": "ການກຳນົດຄ່າບັນທຶກສຳເລັດ！",

        "deleteDataTitle": "ຢືນຢັນການລົບ",
        "deleteData": "ແນ່ໃຈ ຫຼື ບໍ ຕ້ອງກນລົບຂໍ້ມູນປະຈຸບັນ, ແລະ ຂໍ້ມູນຍ່ອຍ?",

        "changeTypeTitle": "ຢືນຢັນປ່ຽນປະເພດຂໍ້ມູນ",
        "changeTypeDeleteChildren": "ການປ່ຽນປະເພດຂໍ້ມູນຈະລົບຂໍ້ມູນຍ່ອຍທັງໝົດ, ແນ່ໃຈ ຫຼື ບໍວ່າຕ້ອງການດຳເນີນການດັ່ງກ່າວ？",
        "changeType": "ການປ່ຽນປະເພດຂໍ້ມູນຈະປ່ຽນການກຳນົດຂອງຂໍ້ມູນ，ແນ່ໃຈ ຫຼື ບໍວ່າຕ້ອງການດຳເນີນການດັ່ງກ່າວ？",

        "inputTypeError": "ເຈົ້າຢືນຢັນປະເພດຂໍ້ມູນພິພາດ，ກະລຸນາຢືນຢັນໃໝ່ອີກຄັ້ງ",
        "sameKey": "ຊື່ໂຄງການທີ່ເຈົ້າຕັ້ງມີຢູ່ແລ້ວ，ກຸລະນາຢືນຢັນໃໝ່ອີກຄັ້ງ",
        "emptyKey": "ຊື່ໂຄງການບໍ່ສາມາດເວັ້ນວ່າງໄດ້，ກະລຸນາຢືນຢັນໃໝ່ອີກຄັ້ງ",
        "numberKey": "ຊື່ໂຄງການບໍ່ສາມາດໃສ່ເປັນຕົວເລກໄດ້，ກະລຸນາຢືນຢັນໃໝ່ອີກຄັ້ງ",

        "inputName": "ກະລຸນາຢືນຢັນຊື່ການກຳນົດຄ່າ"
    }
};