MWF.xApplication.cms.ViewDesigner.LP = {
    "title": "ແກ້ໄຂລາຍການ",
    "newView": "ລາຍການໃໝ່",
    "property": "ຊັບສິນ",
    "viewProperty":"ລາຍຊື່ຊັບສິນ",
    "item": "ລາຍການ",
    "type": "ປະເພດ",
    "value": "ຄຸນຄ່າ",
    "view": "ລາຍການ",
    "relativeForm": "ແບບຟອມ",
    "noTitle": "ບໍ່ມີຊື່",
    "columnProperty": "ຄຸນສົມບັດຖັນ",
    "base": "ພື້ນຖານ",
    "events": "ເຫດການ",

    "sortColumn": "ຄັດ",
    "asc": "ສັ່ງ",
    "desc": "ຄໍາສັ່ງປີ້ນ",

    "columnTitle": "ຊື່ຖັນ",
    "columnValue": "ຄ່າຖັນ",
    "columnWidth": "ຄວາມກວ້າງຖັນ",
    "columnAlign": "ຈັດຮຽງ",
    "columnAlignText": "ກາງ, ຊ້າຍ, ຂວາ",
    "columnAlignValue": "ກາງ,ຊ້າຍ,ຂວາ",
    "ເປີເຊັນ": "%",
    "px": "Pixel",

    "id": "ການລະບຸຕົວຕົນ",
    "name": "ຊື່",
    "alias": "ນາມແຝງ",
    "description": "ລາຍລະອຽດ",
    "action": "ການກະທຳ",
    "delete": "ລqບ",
    "edit": "ແກ້ໄຂ",
    "share": "ແບ່ງປັນ",
    "sortByClickTitle": "ກົດຊື່ຖັນເພື່ອຈັດລຽງ",

    "insertColLeft":"ໃສ່ຖັນ",
    "insertColRight":"ເພີ່ມຖັນ",
    "deleteCol": "ລົບຖັນ",
    "moveCol":"ຍ້າຍຖັນ",

    "ok":  "ຕົກລົງ",
    "cancel": "ຍົກເລີກ",

    "deleteColConfirmTitle": "ລົບການຢືນຢັນຖັນ",
    "deleteColConfirm": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລົບຖັນນີ້ອອກ?",

    "notice": {
        "save_success": "ລາຍການຖືກບັນທຶກສຳເລັດແລ້ວ!",
        "saveAs_success": "ບັນຊີລາຍຊື່ໄດ້ຖືກບັນທຶກໄວ້ຢ່າງສໍາເລັດຜົນ, ທ່ານສາມາດເປີດບັນຊີລາຍຊື່ໃຫມ່ໃນການຕັ້ງຄ່າຖັນ!",
        "deleteDataTitle": "ລົບການຢືນຢັນຂໍ້ມູນ",
        "deleteData": "ທ່ານແນ່ໃຈບໍ່ທີ່ຈະລຶບຂໍ້ມູນປັດຈຸບັນ ແລະຂໍ້ມູນຍ່ອຍຂອງມັນອອກ?",

        "changeTypeTitle": "ປ່ຽນການຢືນຢັນປະເພດຂໍ້ມູນ",
        "changeTypeDeleteChildren": "ການປ່ຽນປະເພດຂໍ້ມູນຈະລົບຂໍ້ມູນເດັກນ້ອຍທັງໝົດ. ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການປະຕິບັດມັນ?",
        "changeType": "ການປ່ຽນປະເພດຂໍ້ມູນຈະປ່ຽນຄ່າຂອງຂໍ້ມູນ. ທ່ານແນ່ໃຈບໍວ່າທ່ານຕ້ອງການທີ່ຈະປະຕິບັດມັນ?",
        "inputTypeError": "ປະເພດຂໍ້ມູນທີ່ທ່ານໃສ່ຜິດ, ກະລຸນາໃສ່ໃໝ່",
        "sameKey": "ຊື່ລາຍການທີ່ເຈົ້າໃສ່ນັ້ນມີຢູ່ໃນວັດຖຸແລ້ວ, ກະລຸນາໃສ່ໃໝ່",
        "emptyKey": "ຊື່ໂຄງການບໍ່ສາມາດຫວ່າງເປົ່າໄດ້, ກະລຸນາໃສ່ໃໝ່",
        "numberKey": "ຊື່ລາຍການບໍ່ສາມາດເປັນຕົວເລກໄດ້, ກະລຸນາໃສ່ໃໝ່",

        "inputName": "ກະລຸນາໃສ່ຊື່ຂອງລາຍຊື່",
        "noModifyName": "ບໍ່ສາມາດແກ້ໄຂຊື່ ຫຼືນາມແຝງ",
        "noRemoveOnlyColumn": "ບໍ່ສາມາດລຶບຖັນດຽວໄດ້"
    },
    "copy": "ສຳເນົາ",
    "newListName": "ຊື່ລາຍຊື່ໃໝ່"
};