MWF.xApplication.cms.ScriptDesigner.LP = {
    "title": "ຕົວແກ້ໄຂສະຄຣິບ",
    "newScript": "ສະຄຣິບໃໝ່",
    "scriptLibrary": " ໄລບາຣີເນື້ອໃນ",
    "property": "ຊັບສິນ",
    "include": "ລວມ",
    "id": "ການລະບຸຕົວຕົນ",
    "name": "ຊື່",
    "alias": "ນາມສະກຸນ",
    "description": "ລາຍລະອຽດ",

    "notice": {
        "save_success": "ສະຄຣິບຖືກບັນທຶກສຳເລັດແລ້ວ!",
        "deleteDataTitle": "ລົບການຢືນຢັນຂໍ້ມູນ",
        "deleteData": "ທ່ານແນ່ໃຈບໍ່ທີ່ຈະລົບຂໍ້ມູນປັດຈຸບັນ ແລະຂໍ້ມູນຍ່ອຍຂອງມັນອອກ?",

        "changeTypeTitle": "ປ່ຽນການຢືນຢັນປະເພດຂໍ້ມູນ",
        "changeTypeDeleteChildren": "ການປ່ຽນປະເພດຂໍ້ມູນຈະລົບຂໍ້ມູນເດັກນ້ອຍທັງໝົດ. ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການເຮັດມັນ?",
        "changeType": "ການປ່ຽນປະເພດຂໍ້ມູນຈະປ່ຽນຄ່າຂອງຂໍ້ມູນ. ທ່ານແນ່ໃຈບໍວ່າທ່ານຕ້ອງການທີ່ຈະເຮັດມັນ?",

        "inputTypeError": "ປະເພດຂໍ້ມູນທີ່ທ່ານໃສ່ຜິດ, ກະລຸນາໃສ່ໃໝ່",
        "sameKey": "ຊື່ລາຍການທີ່ເຈົ້າໃສ່ນັ້ນມີຢູ່ໃນວັດຖຸແລ້ວ, ກະລຸນາໃສ່ໃໝ່",
        "emptyKey": "ຊື່ໂຄງການບໍ່ສາມາດຫວ່າງເປົ່າໄດ້, ກະລຸນາໃສ່ໃໝ່",
        "numberKey": "ຊື່ລາຍການບໍ່ສາມາດເປັນຕົວເລກໄດ້, ກະລຸນາໃສ່ໃໝ່",

        "inputName": "ກະລຸນາໃສ່ຊື່ສະຄຣິບ"
    }
};