MWF.xApplication.Collect.LP = {
    "title": " ການກຳນົດຄ່າO2Cloud ",
    "collectConnected": "ເຈົ້າສາມາດເຊື່ອມຕໍ່ກັບ O2 Cloud ໄດ້ແລ້ວ!",
    "collectDisconnect": "ເຊີບເວີຂອງທ່ານບໍ່ສາມາດເຊື່ອມຕໍ່ກັບ O2 Cloud!",
    "checking": "ກຳລັງກວດສອບ",

    "collectLogin": "ທ່ານໄດ້ເຂົ້າສູ່ລະບົບ O2 Cloud!",
    "collectNotLogin": "ທ່ານຍັງບໍ່ໄດ້ເຂົ້າສູ່ລະບົບ O2 Cloud ເທື່ອ!",

    "recheck": "ກວດຄືນ",
    "doDisconnect": "ຕັດການເຊື່ອມຕໍ່",

    "modifyAccountAction": "ແກ້ໄຂບັນຊີ",
    "modifyPwdAccountAction": "ປ່ຽນລະຫັດຜ່ານ",
    "deleteAccountAction": "ລົບບັນຊີ",
    "login": "ເຊື່ອມຕໍ່ O2Cloud",
    "logining": "ເຂົ້າສູ່ລະບົບ......",
    "register": "ລົງທະບຽນບັນຊີ",
    "registering": "ລົງທະບຽນ...",
    "forget": "ລືມລະຫັດຜ່ານ?",

    "connectedAndLogin": "<span style='color: #ff0000'>ຊົມເຊີຍ!</span>ທ່ານໄດ້ເຂົ້າສູ່ລະບົບ O2 cloud ແລະສາມາດໃຊ້ຟັງຊັນ O2 ທັງໝົດລວມທັງຫ້ອງການມືຖື!",
    "modifyAccount": "",
    "loginAccount": "",

    "disconnect": "ເຊີບເວີຂອງເຈົ້າບໍ່ສາມາດເຊື່ອມຕໍ່ກັບ O2 Cloud ໄດ້, ກະລຸນາກວດເບິ່ງສະພາບແວດລ້ອມເຄືອຂ່າຍເຊີບເວີຂອງເຈົ້າ.",
    "disconnectInfo": "ແພລະຕະຟອມ O2 ຕ້ອງການເຄື່ອງແມ່ຂ່າຍກາງ O2 ຂອງທ່ານເພື່ອເຂົ້າເຖິງ O2 cloud ເພື່ອໃຊ້ຄຸນສົມບັດທີ່ເຢັນທັງຫມົດ. ອັນນີ້ຮຽກຮ້ອງໃຫ້ເຄື່ອງແມ່ຂ່າຍຂອງທ່ານສາມາດເຂົ້າເຖິງອິນເຕີເນັດໄດ້, ແຕ່ນີ້ບໍ່ແມ່ນການບັງຄັບ." +
        "ທ່ານສາມາດນໍາໃຊ້ແພລະຕະຟອມ O2 ໃນສະພາບແວດລ້ອມເຄືອຂ່າຍສ່ວນຕົວທີ່ປິດ, ແຕ່ທ່ານບໍ່ສາມາດໃຊ້ຫນ້າທີ່ເຊັ່ນຫ້ອງການມືຖືແລະບໍລິການຂໍ້ຄວາມສັ້ນ.",

    "notLogin": "ເຂົ້າສູ່ລະບົບ O2 Cloud, ທ່ານສາມາດນໍາໃຊ້ຄຸນສົມບັດທັງຫມົດລວມທັງຫ້ອງການມືຖື!",
    "notLoginInfoLogin": "ຖ້າທ່ານມີບັນຊີ O2 Cloud ແລ້ວ, ກະລຸນາກົດທີ່ນີ້ເພື່ອເຂົ້າສູ່ລະບົບ:",
    "notLoginInfoRegister": "ຖ້າທ່ານບໍ່ມີບັນຊີ O2 Cloud, ກະລຸນາກົດທີ່ນີ້ເພື່ອລົງທະບຽນ:",

    "username": "ຊື່ຜູ້ໃຊ້",
    "password": "ລະຫັດຜ່ານ",
    "mobile": "ໂທລະສັບມືຖື",
    "mail": "ອີເມລ",
    "code": "ລະຫັດ",
    "secret": "ຍູ້ຂໍ້ຄວາມລັບ",
    "key": "ກະແຈຂໍ້ຄວາມ",

    "back": "ກັບ",
    "backUp": "ຍ້ອນກັບລະດັບກອ່ນ",
    "errorUsername": "ໃສ່ຊື່ບັນຊີ",

    "errorKey": "ໃສ່ປຸ່ມຂໍ້ຄວາມກົດ",
    "errorSecret": "ໃສ່ຂໍ້ຄວາມກົດລັບ",

    "errorPassword": "ໃສ່ລະຫັດຜ່ານ",
    "errorPasswordRule": "ລະຫັດຜ່ານແມ່ນງ່າຍດາຍເກີນໄປ, ຢ່າງຫນ້ອຍ 8 ຕົວເລກແລະການປະສົມຕົວອັກສອນ",
    "errorMobile": "ເບີໂທລະສັບຖືກໃສ່ບໍ່ຖືກຕ້ອງ",
    "errorMail": "ອີເມລ໌ຖືກປ້ອນບໍ່ຖືກຕ້ອງ",
    "errorCode": "ການປ້ອນລະຫັດຢືນຢັນບໍ່ຖືກຕ້ອງ",
    "loginError": "ເຂົ້າສູ່ລະບົບ O2 Cloud ບໍ່ສຳເລັດ, ກະລຸນາກວດເບິ່ງຊື່ບັນຊີ ແລະລະຫັດຜ່ານ",

    "getCodeAtion": "ຮັບລະຫັດ",
    "getCodeNext": "ຮັບອີກຄັ້ງ",

    "modifyNextStep": "ຂັ້ນຕອນຕໍ່ໄປ",
    "nextStepWait": "ຢືນຢັນ...",
    "modifyPassword": "ປັບປ່ຽນລະຫັດຜ່ານ",
    "modifyUnit": "ຢືນຢັນການດັດແກ້",
    "confirm Delete": "ຢືນຢັນການລຶບ",

    "usernameExisted": "ຊື່ບັນຊີມີຢູ່ແລ້ວ",
    "requestError": "ເກີດຄວາມຜິດພາດໃນການຮ້ອງຂໍຂອງເຊີບເວີ"
}