#Mon Oct 19 22:06:45 EDT 2015
JNCK049=Erreur JNI dans %s \: r\u00E9utilisation de va_list d\u00E9tect\u00E9e
JNCK048=Erreur JNI dans %s \: R\u00E9cepteur non \u00E9ligible
JNCK047=Erreur JNI dans %s \: Argument clazz incorrect
JNCK046=Erreur JNI dans %1$s \: Le type de retour ('%2$c') de la m\u00E9thode est erron\u00E9
JNCK045=Erreur JNI dans %s \: La m\u00E9thode n'est pas statique
JNCK044=Erreur JNI dans %s \: La m\u00E9thode est statique
JNCK043=Erreur JNI dans %1$s \: Argument \#%2$d ; %3$s introuvable
JNCK042=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas une sous-classe de %3$s
JNCK041=Erreur JNI dans %1$s \: L'argument \#%2$d se trouve hors intervalle pour un %3$s (0x%4$x > 0x%5$x)
SHRC189=Nombre de m\u00E9thodes AOT       \= %d
JNCK040=Erreur JNI dans %1$s \: L'argument \#%2$d se trouve hors intervalle pour un %3$s (0x%4$x < 0x%5$x)
SHRC188=Octets AOT          \= %d
SHRC187=D\u00E9sactive la sauvegarde de donn\u00E9es AOT dans le cache partag\u00E9
SHRC186=\tPartition %.*s dans ModContext %.*s
SHRC185=\tModContext %.*s
SHRC184=\tPartition %.*s
SHRC183=Impossible de cr\u00E9er la table de hachage dans ScopeManagerImpl
SHRC182=Impossible de cr\u00E9er le moniteur dans ScopeManagerImpl
SHRC181=Impossible d'entrer le mutex de table de hachage ScopeManagerImpl
SHRC180=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ScopeManagerImpl
JNCK039=Erreur JNI dans %1$s \: L'argument \#%2$d est NULL
JNCK038=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence d'objet valide. Son type est \: %4$s\n
JNCK037=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence locale. Son type est \: %4$s
JNCK036=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence globale faible. Son type est \: %4$s
JNCK035=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence globale. Son type est \: %4$s
JNCK034=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un %3$s
JNCK033=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un jarray
JNCK032=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un jobjectArray
JNCK031=Erreur JNI dans %1$s \: L'argument \#%2$d est NULL
SHRC179=Le segment ROMClass est endommag\u00E9. Erreur de lecture du ROMClass \u00E0 0x%p
JNCK030=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e tandis que le GC est d\u00E9sactiv\u00E9 (elle a probablement \u00E9t\u00E9 appel\u00E9e \u00E0 partir d'un \u00E9v\u00E9nement JVMPI ou JVMTI)
SHRC178=L'option noIncrementalUpdates est ignor\u00E9e du fait de l'utilisation de l'option singleJVM.
SHRC177=Impossible d'ex\u00E9cuter le mode sans \u00E9chec du fait de l'utilisation de l'option singleJVM
SHRC176=R\u00E9adressage d'invariant de cha\u00EEne activ\u00E9
SHRC175=Conserver le cache apr\u00E8s le red\u00E9marrage (Win uniquement)
SHRC174=Activer les optimisations d'une seule machine JVM
SHRC173=D\u00E9finit le r\u00E9pertoire des fichiers de contr\u00F4le JVM (avanc\u00E9)
SHRC172=Les restrictions du syst\u00E8me d'exploitation font qu'il n'est pas possible de cr\u00E9er le cache de taille demand\u00E9e
SHRC171=z/OS ne peut pas cr\u00E9er un cache de la taille demand\u00E9e \: v\u00E9rifier vos param\u00E8tres syst\u00E8me z/OS BPXPRMxx
SHRC170=D\u00E9finissez un nom de cache partag\u00E9\n \t(Utilisez %%u pour remplacer le nom d'utilisateur)
JNCK029=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e \u00E0 l'int\u00E9rieur d'une section critique
ZIPS001=Impossible d'ouvrir %s (export manquant)
JNCK028=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e quand une exception est en instance
ZIPS000=Impossible d'ouvrir %1$s (%2$s)
JNCK027=Erreur JNI dans %s \: JNIEnv n'est pas l'\u00E9l\u00E9ment JNIEnv pour l'unit\u00E9 d'ex\u00E9cution active
JNCK026=Erreur JNI dans %s \: JNIEnv ne semble pas \u00EAtre une unit\u00E9 d'ex\u00E9cution valide, ou la m\u00E9moire a \u00E9t\u00E9 corrompue, ou il ne s'agit pas d'une machine virtuelle J9
JNCK025=Utilisez -Xcheck\:jni\:nonfatal pour poursuivre le traitement en cas d'erreurs.
JNCK024=Erreur JNI d\u00E9tect\u00E9e. Abandon du traitement.
JNCK023=Erreur JNI d\u00E9tect\u00E9e. Poursuite du traitement...
JNCK022=r\u00E9f\u00E9rence locale lib\u00E9r\u00E9e
JNCK021=r\u00E9f\u00E9rence locale dans une autre unit\u00E9 d'ex\u00E9cution
SHRC169=Modification d\u00E9tect\u00E9e dans %2$.*1$s...\n \t...a marqu\u00E9 %3$d classes en cache comme \u00E9tant p\u00E9rim\u00E9es
JNCK020=r\u00E9f\u00E9rence du d\u00E9bogueur
SHRC168=Nombre total d'octets de classes partag\u00E9es lus \= %1$lld. Nombre total d'octets enregistr\u00E9s \= %2$d
SHRC167=D\u00E9sactive le partage de classes
SHRC166=Attach\u00E9 au cache "%1$s", taille \= %2$d octets
SHRC165=[Sortie d\u00E9taill\u00E9e de l'API auxiliaire -Xshareclasses activ\u00E9e]
SHRC164=[Sortie d'E-S d\u00E9taill\u00E9e -Xshareclasses activ\u00E9e]
SHRC163=[Sortie d\u00E9taill\u00E9e -Xshareclasses activ\u00E9e]
SHRC162=L'attente du mutex de cr\u00E9ation lors de l'ouverture de la m\u00E9moire partag\u00E9e a expir\u00E9
SHRC161=L'attente du mutex de cr\u00E9ation lors de la cr\u00E9ation de la m\u00E9moire partag\u00E9e a expir\u00E9
SHRC160=L'attente du mutex de cr\u00E9ation lors de l'ouverture du s\u00E9maphore a expir\u00E9
JNCK019=r\u00E9f\u00E9rence globale faible
JNCK018=r\u00E9f\u00E9rence globale
JNCK017=r\u00E9f\u00E9rence locale
JNCK016=NULL
JNCK015=\thelp           imprimer cet \u00E9cran
JNCK014=\tpedantic       effectuer des v\u00E9rifications plus pouss\u00E9es (mais plus longues)
JNCK013=\tnovalist       ne pas v\u00E9rifier la r\u00E9utilisation de va_list
JNCK012=\tnoadvice       ne pas afficher de conseil
JNCK011=\tnowarn         ne pas afficher les avertissements
SHRC159=Cache de classes partag\u00E9es "%1$s" ouvert
JNCK010=\tnonfatal       ne pas quitter lorsque des erreurs sont d\u00E9tect\u00E9es
SHRC158=Cache de classes partag\u00E9es "%1$s" cr\u00E9\u00E9
SHRC157=Impossible d'allouer les %1$d octets de m\u00E9moire partag\u00E9e demand\u00E9s \n \tLa m\u00E9moire partag\u00E9e maximale autoris\u00E9e a \u00E9t\u00E9 allou\u00E9e (%2$d octets) \n \t(Pour augmenter la m\u00E9moire partag\u00E9e disponible, modifiez la valeur du param\u00E8tre syst\u00E8me SHMMAX)
SHRC156=Erreur de copie du nom du groupe dans le nom de cache
SHRC155=Erreur de copie du nom d'utilisateur dans le nom de cache
SHRC154=Caract\u00E8re d'\u00E9chappement %.*s non valide pour le nom du cache
SHRC153=D\u00E9finissez le nom du cache partag\u00E9\n \t(Utilisez %%g pour remplacer le nom de groupe %%u pour le nom d'utilisateur)
SHRC152=JVM est toujours d\u00E9marr\u00E9e ind\u00E9pendamment des erreurs/avertissements
SHRC151=Supprime tous les messages
SHRC150=Active la sortie d\u00E9taill\u00E9e pour l'API auxiliaire
JNCK009=\tnobounds       ne pas effectuer de v\u00E9rification de bornes sur les cha\u00EEnes et les tableaux
JNCK008=\ttrace          tracer toutes les fonctions JNI
JNCK007=\tverbose        tracer certaines fonctions et activit\u00E9s JNI
JNCK006=\tall            v\u00E9rifier les classes d'application et syst\u00E8me
JNCK005=Syntaxe \: -Xcheck\:jni\:[option[,option[,...]]]
JNCK004=jnichk - Utilitaire de v\u00E9rification JNI pour J9, version %s
JNCK003=Utilitaire de v\u00E9rification JNI \: impossible d'allouer un espace de stockage local de machine virtuelle
JNCK002=Utilitaire de v\u00E9rification JNI \: impossible d'ancrer l'\u00E9v\u00E9nement
JNCK001=Utilitaire de v\u00E9rification JNI install\u00E9. Utilisez -Xcheck\:jni\:help
SHRC149=Active la sortie d\u00E9taill\u00E9e pour find/store
JNCK000=-Xcheck\:jni\: Option non identifi\u00E9e --> '%s'
SHRC148=Autoriser l'acc\u00E8s de groupe \u00E0 la m\u00E9moire cache (valeur par d\u00E9faut \: user)
SHRC147=Caract\u00E8re %.*s incorrect pour le nom de cache
SHRC146=Recherche de la classe %1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %2$d de jeton %4$.*3$s...
SHRC145=Recherche de la classe %1$s dans le cache partag\u00E9 pour l'ID chargeur de  classe %2$d d'URL %4$.*3$s...
SHRC144=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur  de classe %3$d de jeton %5$.*4$s...
SHRC143=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %3$d d'URL %5$.*4$s...
SHRC142=\t\u00E0 0x%1$p\t\t%2$x \!\= %3$x
SHRC141=octets diff\u00E9rents \:
SHRC140=taille \:\t%1$d\t\t\t%2$d\n
SHRC139=\n\tROMClass en cours de stockage\tROMClass dans le cache
SHRC138=Plusieurs \u00E9l\u00E9ments ROMClass orphelins trouv\u00E9s pour %.*s
SHRC137=MODE SANS ECHEC \: Avertissement \: Diff\u00E9rences entre ROMClass %.*s et l'\u00E9l\u00E9ment ROMClass du cache
SHRC499=Placeholder, not used
SHRC136=Impossible de cr\u00E9er le moniteur dans SH_ROMClassManagerImpl
SHRC498=Placeholder, not used
SHRC135=Impossible de cr\u00E9er la table de hachage dans SH_ROMClassManagerImpl
SHRC497=Placeholder, not used
SHRC134=Impossible de cr\u00E9er le pool dans SH_ROMClassManagerImpl
SHRC496=Echec de la mise \u00E0 jour de %1$s donn\u00E9es rattach\u00E9es pour l'adresse 0x%2$p \: motif \: %3$s
SHRC133=Impossible d'entrer le mutex de table de hachage ROMClassManager
SHRC495=Echec du stockage de %1$s donn\u00E9es rattach\u00E9es pour l'adresse 0x%2$p \: motif \: %3$s
SHRC132=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ROMClassManagerImpl
SHRC494=Impossible de trouver %1$s donn\u00E9es rattach\u00E9es pour l'adresse 0x%2$p \: motif \: %3$s
SHRC131=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e dans ROMClassManagerImpl
SHRC493=Impossible de trouver %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC130=Tentative d'allocation alors que la validation est en attente
SHRC492=Echec de la mise \u00E0 jour de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC491=Echec du stockage de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC490=Force la reconnaissance d'un cache de classes partag\u00E9es endommag\u00E9
SHRC129=Tentative d'attribution de la valeur -1 \u00E0 readerCount
SHRC128=Echec de SH_CompositeCache\:\:exitMutex avec le code retour %d. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9.
SHRC127=SH_CompositeCache\:\:enterMutex a \u00E9chou\u00E9 avec le code de retour %d. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9.
SHRC489=Si le cache ouvert est d\u00E9sign\u00E9 comme endommag\u00E9, d\u00E9clenche un \u00E9v\u00E9nement de vidage du cache
SHRC126=Demande d'ajout d'un trop grand nombre d'\u00E9l\u00E9ments dans ClasspathItem
SHRC488=Le total des valeurs -Xscminaot et -Xscminjitdata ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la taille du cache disponible
SHRC125=Impossible d'allouer de la m\u00E9moire pour la m\u00E9moire tampon de cha\u00EEnes dans SH_CacheMap
SHRC487=Espace maximal pour les octets de donn\u00E9es JIT    %*c\= %d
SHRC124=Cache rempli \u00E0 %1$d%%\n
SHRC486=Espace r\u00E9serv\u00E9 pour les octets de donn\u00E9es JIT    %*c\= %d
SHRC123=%% classes p\u00E9rim\u00E9es                    \= %1$d%%\n
SHRC485=Espace maximal pour les octets AOT         %*c\= %d
SHRC122=Nombre de classes p\u00E9rim\u00E9es    \= %d
SHRC484=Espace r\u00E9serv\u00E9 pour les octets AOT        %*c\= %d
SHRC121=Nombre de jetons           \= %d
SHRC483=\u00E9chec de l'actualisation du cache
SHRC120=Nombres d'URL             \= %d
SHRC482=l'adresse n'est pas dans le cache
SHRC481=le cache est endommag\u00E9
SHRC480=trop de mises \u00E0 jour lors de la lecture
EXEL099=\  -Xrealtime -Xnortsj             activer le temps r\u00E9el souple
EXEL098=\  -Xgcpolicy\:metronome           activer le temps r\u00E9el souple
EXEL097=\  -Xrealtime                      activer le temps r\u00E9el souple
EXEL096=\  -Xgcpolicy\:metronome         activer des extensions temps r\u00E9el
EXEL095=\  -Xrealtime                    utilisation des extensions temps r\u00E9el
EXEL094=\  -Xcompressedrefs            utiliser des r\u00E9f\u00E9rences de segment de m\u00E9moire compress\u00E9es
EXEL093=Les options suivante contr\u00F4le la configuration VM globale \:
EXEL092=\n  -Xdump[\:option,...]  utiliser des vidages de contr\u00F4le -Xdump\:help pour plus d'informations
SHRC119=Nombre de chemins d'acc\u00E8s aux classes       \= %d
EXEL091=\n  -Xcheck[\:option[\:...]]  contr\u00F4le les v\u00E9rifications utilisez -Xcheck\:help pour plus de d\u00E9tails
SHRC118=Nombre de classes ROM      \= %d
EXEL090=\  -Xscmaxaot<x>   d\u00E9finir l'espace maximal du cache de classes partag\u00E9es autoris\u00E9 pour les donn\u00E9es AOT sur <x>
SHRC117=%% m\u00E9tadonn\u00E9es utilis\u00E9es      \= %1$d%%\n
SHRC479=\u00E9chec de l'allocation de m\u00E9moire de %d octets
SHRC116=octets de m\u00E9tadonn\u00E9es     \= %d
SHRC478=taille des donn\u00E9es %d plus grande que la taille disponible %d
SHRC115=octets ROMClass     \= %d
SHRC477=plus d'espace dans le cache pour %d octets
SHRC114=octets disponibles         \= %d
SHRC476=les donn\u00E9es existent d\u00E9j\u00E0
SHRC113=taille de cache         \= %d
SHRC475=aucune donn\u00E9e n'existe
SHRC112=pointeur d'allocation \= 0x%p\n
SHRC474=\u00E9chec de enterReadMutex
SHRC111=adresse de fin            \= 0x%p
SHRC473=\u00E9chec de enterWriteMutex
SHRC110=\nadresse de base           \= 0x%p
SHRC472=aucun acc\u00E8s \u00E0 la ressource
SHRC471=Echec de la mise \u00E0 jour de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC470=%1$s donn\u00E9es jointes mises \u00E0 jour pour %7$.*6$s.%3$.*2$s%5$.*4$s
EXEL089=\  -Xscminaot<x>   d\u00E9finir l'espace minimal du cache de classes partag\u00E9es r\u00E9serv\u00E9 aux donn\u00E9es AOT sur <x>
EXEL088=
MECK002=Une erreur s'est produite lors de la cr\u00E9ation de la structure de donn\u00E9es du site d'appel. Les informations de site d'appel ne seront pas affich\u00E9es
EXEL087=\  -Xjni\:<options>               d\u00E9finir les options JNI
MECK001=Option -Xcheck\:memory non reconnue \: %s
EXEL086=\n  -Xtrace[\:option,...]  contr\u00F4le les traces utilisez -Xtrace\:help pour plus de d\u00E9tails
MECK000=Une erreur s'est produite lors de l'initialisation de l'utilitaire -Xcheck\:memory
EXEL085=\nATTENTION \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nATTENTION \: Utilisez plut\u00F4t "-jxe <chemin>".\n
EXEL084=Impossible de faire une copie de sauvegarde du fichier \: %s
EXEL083=Impossible d'ouvrir le fichier \: %s
EXEL082=\  -Xlp<x>         r\u00E9gler la taille des pages volumineuses sur <x>
SHRC109=\!STALE\!
EXEL081=java version "%1$s/%2$s"
SHRC108=\t%.*s
EXEL080=java version "%s"
SHRC107=\t%.*s
SHRC469=Echec du stockage de 1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC106=%1$d \: 0x%2$p TOKEN
SHRC468=%1$s donn\u00E9es jointes stock\u00E9es pour %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC105=%1$d \: 0x%2$p URL
SHRC467=Echec de recherche de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s.%6$.*5$s, raison \:%2$s
SHRC104=%1$d \: 0x%2$p CLASSPATH
SHRC466=%1$s donn\u00E9es jointes trouv\u00E9es pour %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC103=\tJeton 0x%p
SHRC465=[Sortie d\u00E9taill\u00E9e des donn\u00E9es JIT -Xshareclasses activ\u00E9e]
SHRC102=\tURL 0x%p
SHRC464=Active la sortie d\u00E9taill\u00E9e des donn\u00E9es JIT
SHRC101=\tIndex %1$d dans le chemin d'acc\u00E8s aux classes 0x%2$p
SHRC463=La valeur de -Xscmaxjitdata est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC100=%1$d \: 0x%2$p ROMCLASS \: %4$.*3$s \u00E0 0x%5$p.
SHRC462=La valeur de -Xscminjitdata est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC461=La valeur de -Xscminjitdata ne devrait pas \u00EAtre sup\u00E9rieure \u00E0 la valeur de -Xscmaxjitdata
SHRC460=D\u00E9sactiver le stockage des donn\u00E9es JIT dans le cache partag\u00E9
EXEL079=\  -Xscmx<x>       r\u00E9gler la taille du nouveau cache de classes partag\u00E9es sur <x>
EXEL078=\  -Xshareclasses[\:options]  Activer le partage de donn\u00E9es de classe (utiliser l'aide pour plus de d\u00E9tails)\n
EXEL077=\  -Xssi<x>        r\u00E9gler l'incr\u00E9ment de pile d'unit\u00E9s d'ex\u00E9cution Java sur <x>
EXEL076=JIT  - %s\n
EXEL075=\  -Xquickstart    am\u00E9liorer la dur\u00E9e du d\u00E9marrage en diff\u00E9rant les optimisations
EXEL074=Impossible de rediriger la console vers \: %1$s\:%2$d
EXEL073=Erreur interne de la VM \: Echec de la cr\u00E9ation de la VM Java
EXEL072=Erreur de d\u00E9marrage de la VM \: M\u00E9moire insuffisante
EXEL071=Nom de la classe principale introuvable
EXEL070=La version de l'image ROM est erron\u00E9e
SHRC459=D\u00E9sactive le partage des classes et les API de l'utilitaire
SHRC458=D\u00E9sactive le partage des classes sans d\u00E9sactiver les API de l'utilitaire
SHRC457=Nom du cache non valide, le nom du cache "%.*s" contient uniquement un blanc ou est vide
SHRC456=Forcer la reconnaissance d'un changement d'ID de g\u00E9n\u00E9ration de la machine virtuelle
SHRC455=Forcer la v\u00E9rification de la table de cha\u00EEnes au d\u00E9marrage
SHRC454=D\u00E9sactiver la v\u00E9rification si l'ID s\u00E9maphore SysV en cours est identique \u00E0 l'ID s\u00E9maphore SysV mis en cache
SHRC453=Dresser la liste de tous les \u00E9l\u00E9ments du cache, y compris les classes orphelines
SHRC452=D\u00E9sactiver la protection de m\u00E9moire de la zone en lecture/\u00E9criture (table de cha\u00EEnes)
SHRC451=La zone de d\u00E9but des donn\u00E9es dans l'en-t\u00EAte du cache n'est pas valide. L'adresse de d\u00E9but des donn\u00E9es dans l'en-t\u00EAte du cache est \: 0x%p.
SHRC450=La zone de longueur des donn\u00E9es dans l'en-t\u00EAte du cache n'est pas valide. La longueur des donn\u00E9es dans l'en-t\u00EAte du cache est de \: %u.
EXEL069=Image ROM introuvable
EXEL068=Erreur interne de la VM \: Echec de l'initialisation de l'\u00E9l\u00E9ment de tableau pour %s
EXEL067=Erreur interne de la VM \: Echec de la cr\u00E9ation de java/lang/String pour l'argument %s
EXEL066=Erreur interne de la VM \: \: Echec de la cr\u00E9ation du tableau d'octets pour l'argument %s
EXEL065=Erreur interne de la VM \: Echec de la cr\u00E9ation du tableau d'arguments
EXEL064=La m\u00E9thode main doit \u00EAtre d\u00E9clar\u00E9e en tant que m\u00E9thode de type public, static et void.
EXEL063=M\u00E9thode main() non impl\u00E9ment\u00E9e dans la classe %s
EXEL062=Erreur VM interne \: M\u00E9moire insuffisante pour la conversion de la cha\u00EEne en caract\u00E8res UTF du nom de classe %s
EXEL061=Erreur interne de la VM \: Echec de la cr\u00E9ation de java/lang/String pour le nom de classe %s
EXEL060=Erreur interne de la VM \: Echec de la cr\u00E9ation du tableau d'octets pour le nom de classe %s
SHRC449=Le remplissage est diff\u00E9rent de z\u00E9ro. Les octets de remplissage dans l'en-t\u00EAte du cache sont de \: %u.
SHRC448=La zone de taille du cache n'est pas valide dans l'en-t\u00EAte du cache. La taille du cache dans l'en-t\u00EAte du cache est de \: 0x%x.
SHRC447=L'identificateur de l'en-t\u00EAte du cache n'est pas valide. L'adresse de la cha\u00EEne d'identificateur se trouve dans l'en-t\u00EAte du cache \: 0x%p.
SHRC446=Echec de l'acquisition du verrou en \u00E9criture de l'en-t\u00EAte au cours du d\u00E9marrage du cache avec le code d'erreur \: %d.
SHRC445=La taille du cache est trop petite pour \u00EAtre utile. Taille du cache non valide \: 0x%x.
SHRC444=Donn\u00E9es endommag\u00E9es lues pour l'en-t\u00EAte de l'entr\u00E9e du cache 0x%p (longueur d'\u00E9l\u00E9ment non valide)
SHRC443=Le contr\u00F4le CRC du cache est incorrect car il indique un cache endommag\u00E9. Contr\u00F4le CRC du cache endommag\u00E9 \: 0x%x.
SHRC442=Le cache partag\u00E9 "%s" est corrompu. Le code d'endommagement est %d. La valeur endommag\u00E9e est 0x%p. Aucune nouvelle machine JVM ne pourra se connecter au cache.\n \tLes machines JVM existantes pourront continuer \u00E0 fonctionner, mais ne pourront pas mettre \u00E0 jour le cache.
SHRC441=La valeur de -XscmaxJIT est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC440=La valeur de -XscminJIT est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
EXEL059=Erreur interne de la VM \: Classe java/lang/String introuvable
EXEL058=Erreur interne de la VM \: M\u00E9moire insuffisante
EXEL057=
EXEL056=IBM est une marque d'IBM Corp.\nJava ainsi que toutes les marques et logos incluant Java\nsont des marques de Sun Microsystems, Inc. \n
EXEL055=Cible \: %s
EXEL054=(c) Copyright IBM Corp. 1991, %s  All Rights Reserved
EXEL053=El\u00E9ments sous licence - Propri\u00E9t\u00E9 d'IBM\n\nJ9 - Machine virtuelle pour la plateforme Java, version %s
EXEL052=\nATTENTION \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez plut\u00F4t l'argument -X.
EXEL051=\nATTENTION \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez "-classpath <chemin>" ou "-cp <chemin>".
EXEL050=\  -Xrdbginfo\:<h\u00F4te>\:<port>      activer le serveur d'informations de d\u00E9bogage distant
SHRC439=La valeur de -XscminJIT ne doit pas \u00EAtre sup\u00E9rieure \u00E0 la valeur de -XscmaxJIT
SHRC438=D\u00E9sactiver le stockage des donn\u00E9es JIT dans le cache partag\u00E9
SHRC437=Erreur lors de la lib\u00E9ration du verrou en lecture de l'en-t\u00EAte de fichier du cache de classes partag\u00E9es
SHRC436=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
SHRC435=-Xitsn%2$u utilise %1$u octets de m\u00E9moire, ce qui est plus volumineux que la taille du cache de classes partag\u00E9es de %3$u octets
SHRC434=La valeur\=%d transmise par l'option -Xitsn est hors de la plage de valeurs de nombre premier prise en charge par la machine virtuelle. Plage prise en charge \= 0 - %u
SHRC433=\tpour ROMClass %2$.*1$s \u00E0 0x%3$p.
J9CL040=Impossible d'allouer de la m\u00E9moire pour la nouvelle r\u00E9f\u00E9rence globale JNI
SHRC432=\ Signature \: %2$.*1$s Adresse \: 0x%3$p
SHRC431=%1$d \: 0x%2$p JITPROFILE \: %4$.*3$s
SHRC430=Impossible de supprimer la g\u00E9n\u00E9ration actuelle du cache de classes partag\u00E9es "%s"
EXEL049=\  -Xdbginfo\:<symbol file path> activer le serveur d'informations de d\u00E9bogage
EXEL048=\  -Xrunjdwp\:<options>               activer les options standard JDWP de d\u00E9bogage
EXEL047=\n  -Xdbg\:<options>               activer les options standard JDWP de d\u00E9bogage
EXEL046=\  -Xlp                          activer la prise en charge de pages volumineuses
EXEL045=\  -Xnocompactgc                 d\u00E9sactiver la compression
EXEL044=\  -Xcompactgc                   activer la compression
EXEL043=\  -Xcompactexplicitgc           activer la compression lors de chaque GC syst\u00E8me
EXEL042=\  -Xnocompactexplicitgc         d\u00E9sactiver la compression lors d'un GC syst\u00E8me
J9CL039=Horodatage non valide lors de l'extraction d'informations de syntaxe UC JVM.
EXEL041=\  -Xalwaysclassgc               activer le d\u00E9chargement de classe dynamique \u00E0 chaque GC
J9CL038=Erreur lors de l'extraction d'informations de syntaxe UC JVM.
EXEL040=\  -Xclassgc                     activer le d\u00E9chargement de classe dynamique
J9CL037=Impossible d'extraire des informations de syntaxe UC JVM lorsque -XX\:-EnableCPUMonitor a \u00E9t\u00E9 sp\u00E9cifi\u00E9.
SHRC429=Impossible de supprimer l'ancienne g\u00E9n\u00E9ration du cache de classes partag\u00E9es "%s"
J9CL036=violation de contrainte de chargement \: %2$.*1$s non visible \u00E0 partir de %4$.*3$s
SHRC428=Ancienne g\u00E9n\u00E9ration du cache de classes partag\u00E9es "%s" supprim\u00E9e
J9CL035=Invokespecial requis par le m\u00E9thodes de l'interface priv\u00E9e
SHRC427=Modificateur utilis\u00E9 pour imprimer les statistiques d\u00E9taill\u00E9es du cache
J9CL034=%1$d \: Echec lors de l'extraction d'infos %2$s. %3$s
SHRC426=\# Entr\u00E9es JCL                       %*c\= %d
J9CL033=Impossible d'enregistrer %s comme biblioth\u00E8que d'amor\u00E7age. Code d'erreur \= %zu
SHRC425=\# Objets Java                      %*c\= %d
J9CL032=%1$d \: Impossible d'extraire des infos %2$s.
SHRC424=\# Profils JIT                      %*c\= %d
J9CL031=Impossible d'enregistrer dbgwrapper.dll comme biblioth\u00E8que d'amor\u00E7age. Code d'erreur \= %zu
SHRC423=\# Indications JIT                          %*c\= %d
J9CL030=Impossible d'allouer de la m\u00E9moire pour les donn\u00E9es natives de locataire
SHRC422=\# Thunks AOT                        %*c\= %d
SHRC421=\# Hi\u00E9rarchie de classes AOT               %*c\= %d
SHRC420=\# Entr\u00E9es de donn\u00E9es AOT                  %*c\= %d
EXEL039=\  -Xnoclassgc                   d\u00E9sactiver le d\u00E9chargement de classe dynamique
EXEL038=\  -Xgcthreads<x>                d\u00E9finir le nombre d'unit\u00E9s d'ex\u00E9cution GC
EXEL037=\nLes arguments des options suivantes sont exprim\u00E9s en tant que nombres d\u00E9cimaux.\n
EXEL036=\  -Xmaxf<x>       pourcentage maximal de segment libre apr\u00E8s GC
EXEL035=\  -Xminf<x>       pourcentage minimal de segment libre apr\u00E8s GC
EXEL034=Une valeur de 0.3 repr\u00E9sente une demande de 30%%\n
EXEL033=\nLes arguments des options suivantes sont exprim\u00E9s sous forme de d\u00E9cimaux entre 0 et 1.
EXEL032=\  -Xmaxe<x>       d\u00E9finir la taille maximale pour l'expansion du segment sur <x>
J9CL029=caract\u00E8res incorrectement form\u00E9s/non mappables trouv\u00E9s
EXEL031=\  -Xmine<x>       d\u00E9finir la taille minimale pour l'expansion du segment sur <x>
J9CL028=Erreur interne lors de la lecture du fichier zip, code d'erreur %d
EXEL030=\  -Xss<x>         d\u00E9finir la taille de la pile d'unit\u00E9s d'ex\u00E9cution sur <x>
J9CL027=Erreur de lecture du fichier zip
SHRC419=octets LocalVariableTable de la classe      %*c\= %u
J9CL026=Impossible d'allouer de la m\u00E9moire pour le contenu envoy\u00E9 HTTP
SHRC418=octets de donn\u00E9es Byte                     %*c\= %d
J9CL025=Impossible d'allouer de la m\u00E9moire pour les en-t\u00EAtes de r\u00E9ponse HTTP
SHRC417=octets de donn\u00E9es JCL                      %*c\= %d
J9CL024=M\u00E9moire satur\u00E9e
SHRC416=octets ReadWrite                     %*c\= %d
J9CL023=M\u00E9moire insuffisante pour lire l'enregistrement
SHRC415=octets Java Object                   %*c\= %d
J9CL022=M\u00E9moire insuffisante pour lister les magasins d'enregistrements
SHRC414=octets de profil JIT                   %*c\= %d
J9CL021=M\u00E9moire insuffisante pour cr\u00E9er la liste d'index
SHRC413=octets d'indication JIT                      %*c\= %d
J9CL020=M\u00E9moire insuffisante pour lire les donn\u00E9es d'environnement local
SHRC412=octets thunk AOT                     %*c\= %d
SHRC411=octets de la hi\u00E9rarchie de classes AOT         %*c\= %d
SHRC410=octets de donn\u00E9es AOT                      %*c\= %d
EXEL029=\  -Xss<x>        d\u00E9finir la taille maximale de la pile d'unit\u00E9s d'ex\u00E9cution Java sur <x>
EXEL028=\  -Xiss<x>        d\u00E9finir la taille initiale de la pile d'unit\u00E9s d'ex\u00E9cution Java sur <x>
EXEL027=\  -Xmso<x>        d\u00E9finir la taille de la pile d'unit\u00E9s d'ex\u00E9cution syst\u00E8me sur <x>
EXEL026=\  -Xmrx<x>        d\u00E9finir la taille maximale de l'ensemble m\u00E9moris\u00E9 sur <x>
EXEL025=\  -Xmr<x>         d\u00E9finir la taille de l'ensemble m\u00E9moris\u00E9 sur <x>
EXEL024=\  -Xmx<x>         d\u00E9finir la taille maximale de m\u00E9moire sur <x>
EXEL023=\  -Xms<x>         d\u00E9finir la taille m\u00E9moire initiale sur <x>
EXEL022=\  -Xms<x>         d\u00E9finir l'ancienne taille d'espace sur <x>
J9CL019=Impossible d'allouer de la m\u00E9moire tampon SIOCGIFCONF
EXEL021=\  -Xmoi<x>        d\u00E9finir l'ancien incr\u00E9ment d'espace sur <x>
J9CL018=impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de fuseau horaire
EXEL020=\  -Xmox<x>         d\u00E9finir l'ancienne taille d'espace maximale sur <x>
J9CL017=impossible d'allouer de la m\u00E9moire pour la ressource de fuseau horaire
SHRC409=octets du code AOT                      %*c\= %d
J9CL016=impossible de cr\u00E9er une entr\u00E9e de chemin d'acc\u00E8s aux classes
SHRC408=g\u00E9n\u00E9ration du cache                    %*.c\= %d\n
J9CL015=Echec de la cr\u00E9ation d'une trace de pile (sans doute, \u00E0 cause d'un manque de m\u00E9moire du syst\u00E8me d'exploitation)
SHRC407=options d'ex\u00E9cution                       %*.c\= 0x%.16llX
J9CL014=Argument de ligne de commande JCL non valide
SHRC406=adresse de d\u00E9but des m\u00E9tadonn\u00E9es              %*c\= 0x%p
J9CL013=Echec de l'allocation du moniteur syst\u00E8me
SHRC405=Impossible de cr\u00E9er un r\u00E9pertoire pour le cache
J9CL012=
SHRC404=Impossible d'obtenir un r\u00E9pertoire pour le cache
J9CL011=Echec du processus de traitement en parall\u00E8le pour l'unit\u00E9 d'ex\u00E9cution syst\u00E8me
SHRC403=Octets utilis\u00E9s dans la zone de d\u00E9bogage des classes         %*c\= %u
J9CL010=Impossible d'allouer JNIEnv
SHRC402=Octets de donn\u00E9es JIT                      %*c\= %d
SHRC401=\# Caches zip                        %*c\= %d
SHRC400=Octets du cache zip                     %*c\= %d
EXEL019=\  -Xmos<x>        d\u00E9finir l'ancienne taille d'espace initiale sur <x>
EXEL018=\  -Xmo<x>         d\u00E9finir l'ancienne taille d'espace initiale/maximale sur <x>
EXEL017=\  -Xmo<x>         d\u00E9finir l'ancienne taille d'espace sur <x>
EXEL016=\  -Xmnx<x>         d\u00E9finir la nouvelle taille d'espace maximale sur <x>
EXEL015=\  -Xmns<x>        d\u00E9finir la nouvelle taille d'espace initiale sur <x>
EXEL014=\  -Xmn<x>         d\u00E9finir la nouvelle taille d'espace initiale/maximale sur <x>
EXEL013=\  -Xmn<x>         d\u00E9finir la nouvelle taille d'espace sur <x>
EXEL012=\  -Xmco<x>        d\u00E9finir l'incr\u00E9ment de segment de classe ROM sur <x>
J9CL009=Unit\u00E9 d'ex\u00E9cution d\u00E9j\u00E0 lanc\u00E9e
EXEL011=\  -Xmca<x>        d\u00E9finir l'incr\u00E9ment de segment de classe RAM sur <x>
J9CL008=Valeur de d\u00E9lai en nanosecondes hors intervalle
EXEL010=Les valeurs suivies de "k" (kilo) ou de "m" (m\u00E9ga) seront trait\u00E9es en cons\u00E9quence.\n
J9CL007=La valeur du d\u00E9lai est n\u00E9gative
J9CL006=Aucune donn\u00E9e de pr\u00E9-v\u00E9rification pour java/lang/Object
J9CL005=Version de biblioth\u00E8que de classes incompatible \: machine virtuelle v%1$i requise, v%2$i identifi\u00E9e
J9CL004=Version de biblioth\u00E8que de classes incompatible \: v%1$i attendue pour JCL, v%2$i identifi\u00E9e
J9CL003=Version de biblioth\u00E8que de classes incompatible \: JCL %1$x, VM %2$x
J9CL002=Classes issues d'une biblioth\u00E8que non-J9 ou de JXE r\u00E9duit de fa\u00E7on incorrecte
J9CL001=Tentative d'ex\u00E9cution avec -jcl\:%s
SHRC755=\t invalidatedaot Affiche uniquement les types aot invalid\u00E9s dans le cache partag\u00E9.
J9CL000=Biblioth\u00E8que de classe incompatible
SHRC754=La re-cr\u00E9ation d'un fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas autoris\u00E9e.
SHRC753=Echec de l'obtention du mutex de cache en \u00E9criture
SHRC752=Echec de l'analyse des sp\u00E9cifications de m\u00E9thode
SHRC751=Echec de l'analyse des sp\u00E9cifications de m\u00E9thode. Pas plus de %d sp\u00E9cifications de m\u00E9thode autoris\u00E9es.
SHRC750=Aucune m\u00E9thode AOT ne correspond aux sp\u00E9cifications de m\u00E9thode
EXEL009=\nLes arguments des options suivantes sont exprim\u00E9s en octets.
EXEL008=\  -Xfuture        activer les contr\u00F4les draconiens pour anticiper le comportement par d\u00E9faut
EXEL007=\  -Xnoaot         ne pas ex\u00E9cuter le code pr\u00E9compil\u00E9
EXEL006=\  -Xnojit         d\u00E9sactiver le compilateur JIT
EXEL005=\  -Xint           ex\u00E9cuter en mode interpr\u00E9t\u00E9 uniquement (\u00E9quivalent de -Xnojit -Xnoaot)
EXEL004=\n  -Xrun<library>[\:options]  charge la biblioth\u00E8que d'agents native\n                            (obsol\u00E8te ; utiliser -agentlib)\n
EXEL003=\  -Xbootclasspath/a\:<chemin>  adjoindre <chemin> au chemin d'acc\u00E8s aux classes d'amor\u00E7age
EXEL002=\  -Xbootclasspath/p\:<chemin>  placer <chemin> au d\u00E9but du chemin d'acc\u00E8s aux classes d'amor\u00E7age
EXEL001=\  -Xbootclasspath\:<chemin>    d\u00E9finir le chemin d'acc\u00E8s aux classes d'amor\u00E7age sur <chemin>
EXEL000=Les options suivantes ne sont pas standard et font l'objet de modification sans pr\u00E9avis.\n
SHRC749=Echec de recherche des m\u00E9thodes AOT
SHRC748=Echec de revalidation des m\u00E9thodes AOT
SHRC747=Echec d'invalidation des m\u00E9thodes AOT
SHRC746=M\u00E9thodes AOT %d ci-dessus d\u00E9tect\u00E9es
SHRC745=M\u00E9thodes AOT %d ci-dessus revalid\u00E9es
SHRC744=M\u00E9thodes AOT %d ci-dessus invalid\u00E9es
SHRC743=Sp\u00E9cifications de m\u00E9thode non valides pour l'option "%s"
SHRC742=IMPORTANT \: Vous pouvez indiquer plusieurs sp\u00E9cifications de m\u00E9thode s\u00E9par\u00E9es par des virgules. Si une valeur d'option contient des virgules, elle doit \u00EAtre entre accolades. \n\tIl peut \u00EAtre n\u00E9cessaire de mettre les options entre guillemets pour emp\u00EAcher l'interpr\u00E9teur de commandes d'intercepter et de fragmenter les lignes de commande s\u00E9par\u00E9es par des virgules, par exemple \: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" or\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC741=Le format de <sp\u00E9cification_m\u00E9thode> est [\!]{*|[*]<nom_module/nom_classe>[*]}[.{*|[*]<nom_m\u00E9thode>[*]}][({*|[*]<param\u00E8tres>[*]})], exemple \:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC740=Syntaxe \: %s{<sp\u00E9cification_m\u00E9thode>[,<sp\u00E9cification_m\u00E9thode>]}
SHRC739=NON VALIDE
SHRC738=Affichez les m\u00E9thodes AOT correspondant aux sp\u00E9cifications de la m\u00E9thode.\n\t<sp\u00E9cification_m\u00E9thode> est d\u00E9finie comme suit \: [\!]{*|[*]<nom_module/nom_classe>[*]}[.{*|[*]<nom_m\u00E9thode>[*]}][({*|[*]<param\u00E8tres>[*]})].
SHRC737=Revalidez les m\u00E9thodes AOT correspondant aux sp\u00E9cifications de la m\u00E9thode.
SHRC736=Invalidez les m\u00E9thodes AOT correspondant aux sp\u00E9cifications de la m\u00E9thode.
SHRC735=Utilisez une machine virtuelle Java %d bits pour effectuer l'op\u00E9ration demand\u00E9e sur le cache partag\u00E9 %d bits "%s" car la machine virtuelle Java %d bits ne peut pas v\u00E9rifier que la m\u00E9moire partag\u00E9e a \u00E9t\u00E9 cr\u00E9\u00E9e par la machine virtuelle Java
SHRC734=Imprimez le nom du fichier d'images instantan\u00E9es de classes partag\u00E9es qui sera utilis\u00E9.
SHRC733=La machine virtuelle Java ne peut pas stocker les chemins d'acc\u00E8s aux classes dans le cache partag\u00E9 cr\u00E9\u00E9, car le cache a \u00E9t\u00E9 cr\u00E9\u00E9 avec l'option '-Xshareclasses\:restrictClasspaths'
SHRC732=La machine virtuelle Java peut stocker les chemins d'acc\u00E8s aux classes dans le cache partag\u00E9 cr\u00E9\u00E9 avec l'option '-Xshareclasses\:restrictClasspaths'
SHRC731=La machine virtuelle Java a ignor\u00E9 l'option '-Xshareclasses\:restrictClasspaths' car le cache partag\u00E9 existant a \u00E9t\u00E9 cr\u00E9\u00E9 sans l'option '-Xshareclasses\:restrictClasspaths'
SHRC730=La machine virtuelle Java a cr\u00E9\u00E9 un cache partag\u00E9 avec l'option '-Xshareclasses\:restrictClasspaths'. Les appels JVM suivants ne pourront pas stocker les chemins d'acc\u00E8s aux classes dans le cache partag\u00E9
SHRC729=L'instantan\u00E9 a \u00E9t\u00E9 cr\u00E9\u00E9 par une g\u00E9n\u00E9ration JVM diff\u00E9rente et ne correspond pas \u00E0 la machine virtuelle Java actuelle
SHRC728=Impossible de lire le fichier d'images instantan\u00E9es du cache partag\u00E9 non permanent "%s"
SHRC727=Une erreur s'est produite lors de la cr\u00E9ation du nouveau cache partag\u00E9 non permanent
SHRC726=Le cache partag\u00E9 non permanent "%s" existe d\u00E9j\u00E0. Il ne peut pas \u00EAtre restaur\u00E9 \u00E0 partir de l'instantan\u00E9.
SHRC725=La taille du fichier d'images instantan\u00E9es du cache partag\u00E9 non permanent "%s" n'est pas valide. Elle est de %lld octets. La taille valide d'un fichier d'images instantan\u00E9es est comprise entre %d et %lld octets.
SHRC724=Le fichier d'images instantan\u00E9es du cache partag\u00E9 "%s" n'existe pas
SHRC723=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations du fichier d'images instantan\u00E9es du cache partag\u00E9 "%s"
SHRC722=La machine virtuelle Java n'autorise pas l'acc\u00E8s au fichier d'images instantan\u00E9es du cache partag\u00E9 "%s" parce que l'ID utilisateur et l'ID groupe du processus JVM sont diff\u00E9rents de ceux du propri\u00E9taire du fichier d'images instantan\u00E9es de cache partag\u00E9 et que l'ID utilisateur du processus JVM n'appartient pas au groupe du propri\u00E9taire du fichier d'images instantan\u00E9es du cache partag\u00E9.
SHRC721=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der au fichier d'images instantan\u00E9es du cache partag\u00E9 non permanent "%s". Pour ouvrir le fichier, utilisez la sous-option 'groupAccess'.
SHRC720=La re-cr\u00E9ation d'un fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas autoris\u00E9e lors de la cr\u00E9ation d'un instantan\u00E9 du cache
SHRC719=L'instantan\u00E9 du cache partag\u00E9 "%s" est d\u00E9truit
SHRC718=L'instantan\u00E9 du cache partag\u00E9 n'existe pas
SHRC717=Impossible de supprimer la g\u00E9n\u00E9ration actuelle de l'instantan\u00E9 du cache partag\u00E9 "%s"
SHRC716=Impossible de supprimer l'ancienne g\u00E9n\u00E9ration de l'instantan\u00E9 du cache partag\u00E9 "%s"
SHRC715=Ancienne g\u00E9n\u00E9ration de l'instantan\u00E9 du cache partag\u00E9 "%s" supprim\u00E9e
SHRC714=Aucun instantan\u00E9 de cache partag\u00E9 n'est disponible
SHRC713=Impossible d'obtenir la longueur du fichier d'images instantan\u00E9es du cache partag\u00E9 "%s"
SHRC712=Tentative de destruction de tous les instantan\u00E9s de cache partag\u00E9 dans cacheDir "%s"
SHRC711=Impossible de repositionner le d\u00E9calage du descripteur de fichier dans le fichier d'images instantan\u00E9es du cache partag\u00E9 non permanent "%s"
SHRC710=Impossible d'\u00E9crire dans le fichier d'images instantan\u00E9es du cache partag\u00E9 non permanent "%s"
SHRC709=La machine virtuelle Java cr\u00E9e un instantan\u00E9 du cache partag\u00E9 non permanent "%s", mais un fichier d'images instantan\u00E9es "%s" existe d\u00E9j\u00E0 et il sera \u00E9cras\u00E9
SHRC708=Impossible de tronquer le fichier d'images instantan\u00E9es du cache partag\u00E9 non permanent existant "%s"
SHRC707=Impossible d'acqu\u00E9rir l'exclusion mutuelle (mutex) du cache "%s"
SHRC706=Impossible d'acqu\u00E9rir le verrou de fichier sur le fichier d'images instantan\u00E9es du cache partag\u00E9
SHRC705=Message d'erreur de la plateforme \: %1$s
SHRC704=Code d'erreur au niveau du port \= %1$d
SHRC703=Impossible d'ouvrir le fichier d'images instantan\u00E9es du cache partag\u00E9 "%s"
SHRC702=Impossible d'obtenir un r\u00E9pertoire pour l'instantan\u00E9 du cache partag\u00E9
SHRC701=Impossible de cr\u00E9er un instantan\u00E9 du cache partag\u00E9 non permanent "%s"
SHRC700=L'instantan\u00E9 du cache partag\u00E9 non permanent "%s" a \u00E9t\u00E9 cr\u00E9\u00E9
PCKD091=L'annotation @Unpacked dans la zone %2$.*1$s de la classe %4$.*3$s n'est pas valide \: le champ @Unpacked ne doit pas \u00EAtre d\u00E9clar\u00E9 'static'
PCKD090=Les annotations dans la zone %2$.*1$s de la classe %4$.*3$s ne sont pas valides \: les annotations @Length et @Unpacked ne doivent pas \u00EAtre utilis\u00E9es conjointement
PCKD089=L'annotation @Unpacked dans la zone %2$.*1$s de la classe %4$.*3$s n'est pas valide \: la classe d\u00E9clarante n'est pas @Packed
PCKD088=L'annotation @Unpacked dans la zone %2$.*1$s de la classe %4$.*3$s n'est pas valide \: le type d'un champ @Unpacked doit \u00EAtre une classe @Packed
PCKD087=Le support de PackedObject est une nouvelle \u00E9volution de la version Java d'IBM. \nIl est fourni en tant qu'aper\u00E7u technologique. Ce contenu est mis \u00E0 disposition moyennant la clause de protection ci-apr\u00E8s.\n\nClause de protection\nLe code et les interfaces de programmation d'application dont il est question ici constituent un aper\u00E7u technologique.\nIl est possible que celui-ci ne soit pas commercialis\u00E9 par IBM en tant que ou dans un produit.\nVous \u00EAtes autoris\u00E9 \u00E0 utiliser ces informations uniquement en interne, \u00E0 des fins d'\u00E9valuation,\net non dans un environnement de production. IBM fournit ces informations "en l'\u00E9tat",\nsans obligation de support et sans garantie d'aucune sorte.\n\nLes renseignements concernant les produits potentiels \u00E0 venir ne sont donn\u00E9s qu'\u00E0 titre\nindicatif pour illustrer l'orientation g\u00E9n\u00E9rale des produits IBM, et ne doivent pas \u00EAtre\nutilis\u00E9s dans le but de prendre une d\u00E9cision d'achat.\nLes renseignements relatifs aux produits potentiels futurs ne constituent pas un engagement,\nni une promesse ou une obligation l\u00E9gale de livrer de la documentation, du code ou des \nfonctionnalit\u00E9s quelconques. Ils ne doivent pas faire partie d'un contrat. Le d\u00E9veloppement, \nla mise \u00E0 disposition et la date de disponibilit\u00E9 des futures caract\u00E9ristiques ou fonctionnalit\u00E9s\nd\u00E9crites dans nos produits demeurent \u00E0 la seule discr\u00E9tion d'IBM.\n
PCKD086=La classe de tableau @Packed "%.*s" ne peut pas avoir de classe membre de tableau @Packed.
PCKD085=Impl\u00E9mentation de m\u00E9thode inattendue trouv\u00E9e dans la classe de tableau @Packed "%.*s"
PCKD084=La classe de tableau @Packed "%.*s" ne peut pas comporter de zones.
PCKD083=La classe de tableau @Packed "%.*s" doit impl\u00E9menter java/io/Serializable.
PCKD082=La classe de tableau @Packed "%.*s" doit impl\u00E9menter java/lang/Cloneable.
PCKD081=La classe de tableau @Packed "%.*s" n'a pas de m\u00E9thode clone().
PCKD080=La classe de tableau @Packed "%.*s" n'a pas de m\u00E9thode getLength().
IREL001=
PCKD079=La classe de tableau @Packed "%.*s" n'a pas de m\u00E9thode at().
IREL000=Le code AOT du fichier %1$s.jar g\u00E9n\u00E9r\u00E9 avec la version %2$s de la machine JVM n'est pas compatible avec la version %3$s en cours de la machine JVM.
PCKD078=La classe de tableau @Packed "%.*s" n'a pas de m\u00E9thode allocate().
PCKD077=La classe de tableau @Packed "%.*s" n'a pas de constructeur priv\u00E9 (private).
PCKD076=Signature incorrecte pour la m\u00E9thode clone() de la classe de tableau @Packed "%.*s".
PCKD075=Signature incorrecte pour la m\u00E9thode getLength() de la classe de tableau @Packed "%.*s".
PCKD074=Signature incorrecte pour la m\u00E9thode at() de la classe de tableau @Packed "%.*s".
PCKD073=Signature incorrecte pour la m\u00E9thode allocate() de la classe de tableau @Packed "%.*s".
PCKD072=La classe de tableau @Packed "%.*s" ne peut pas avoir plus d'un constructeur.
PCKD071=Le constructeur de la classe de tableau @Packed "%.*s" ne doit prendre aucun argument.
PCKD070=Le constructeur de la classe de tableau @Packed "%.*s" doit \u00EAtre d\u00E9clar\u00E9 'private'.
PCKD069=La classe de tableau @Packed "%.*s" doit \u00E9tendre directement PackedObject.
PCKD068=La classe de tableau @Packed "%.*s" doit \u00EAtre d\u00E9clar\u00E9e 'public'.
PCKD067=La classe de tableau @Packed "%.*s" doit \u00EAtre d\u00E9clar\u00E9e 'final'.
PCKD066=La longueur de tableau demand\u00E9e %1$lld (0x%2$llx) est trop grande.
PCKD065=La longueur de tableau demand\u00E9e est trop grande.
PCKD064=Impossible d'obtenir la capacit\u00E9 du ByteBuffer direct.
PCKD063=Impossible d'obtenir l'adresse du ByteBuffer direct.
PCKD062=La classe 'final' @Packed %.*s ne doit pas \u00EAtre vide.
PCKD061=La classe 'final' @Packed ne doit pas \u00EAtre vide.
PCKD060=L'annotation @Length sur %2$.*1$s dans %4$.*3$s n'est pas valide \: la valeur @Length ne doit pas \u00EAtre z\u00E9ro
PORT046=L'ex\u00E9cutable n'a pas pu \u00EAtre ouvert
PORT045=Echec de l'allocation de m\u00E9moire lors de l'extraction des informations syst\u00E8me.
PORT044=Echec de l'allocation de m\u00E9moire lors de l'extraction des informations sur l'hyperviseur.
PORT043=%1$d \: Echec lors de l'extraction d'infos %2$s.
PORT042=Impossible de lire /proc/sysinfo
PORT041=HYPFS non mont\u00E9
PORT040=Echec de la lecture \u00E0 partir de HYPFS
PCKD059=La classe est abstraite.
PCKD058=Erreur dans la zone imbriqu\u00E9e "%2$.*1$s" dans la classe %4$.*3$s. Le type de zone doit \u00EAtre une classe de tableau condens\u00E9e finale.
PCKD057=La classe d'une zone imbriqu\u00E9e doit \u00EAtre une classe de tableau condens\u00E9e.
PCKD056=Erreur dans la zone imbriqu\u00E9e "%2$.*1$s" dans la classe %4$.*3$s. La classe de la zone doit \u00EAtre d\u00E9clar\u00E9e 'final' et @Packed.
PCKD055=La classe d'une zone imbriqu\u00E9e doit \u00EAtre de type final et @Packed.
PCKD054=La classe d'\u00E9l\u00E9ment d'une classe de tableau condens\u00E9e doit \u00EAtre de type final et @Packed.
PCKD053=La classe d'\u00E9l\u00E9ment de la classe de tableau condens\u00E9e %.*s doit \u00EAtre de type final et @Packed.
PCKD052=La classe %2$.*1$s, sous-classe de %4$.*3$s, doit \u00EAtre @Packed car elle \u00E9tend PackedObject.
PCKD051=La superclasse %2$.*1$s de la classe @Packed %4$.*3$s n'est pas valide. Une classe @Packed doit \u00E9tendre PackedObject ou une classe @Packed abstraite.
PCKD050=La superclasse %2$.*1$s de la classe @Packed %4$.*3$s doit \u00EAtre abstraite.
PORT039=Echec de la mise \u00E0 jour de HYPFS
PORT038=Valeur incorrecte pour IBM_JAVA_HYPERVISOR_SETTINGS
PORT037=N'est pas en cours d'ex\u00E9cution sur un hyperviseur.
PORT036=Code retour inattendu g\u00E9n\u00E9r\u00E9 par le service CSRSI sur z/OS
PORT035=__malloc31 n'a pas r\u00E9ussi \u00E0 allouer de la m\u00E9moire tampon sur z/OS
PORT034=Tentative de connexion de la m\u00E9moire partag\u00E9e cr\u00E9\u00E9e dans la cl\u00E9 de protection m\u00E9moire %lu, mais ex\u00E9cution en cours dans la cl\u00E9 %lu.
PORT033=Impossible de d\u00E9tecter un hyperviseur pris en charge.
PORT032=L'op\u00E9ration li\u00E9e \u00E0 l'hyperviseur a \u00E9chou\u00E9.
PORT031=La condition LE %s%i, qui correspond \u00E0 un signal POSIX \u00E9mis par le logiciel, a \u00E9t\u00E9 re\u00E7ue
PORT030=Le param\u00E8tre %s "%s" indique que le clich\u00E9 du processus core doit \u00EAtre dirig\u00E9 vers un programme externe.  Tentative de renommage du processus core ou core.%d.\n
PCKD049=La superclasse d'une classe @Packed doit \u00EAtre abstraite.
PCKD048=La classe @Packed %.*s n'a pas de superclasse.
PCKD047=La classe @Packed n'a pas de superclasse.
PCKD046=La classe @Packed doit \u00EAtre d\u00E9clar\u00E9e 'abstract' ou 'final'.
PCKD045=La classe @Packed %.*s doit \u00EAtre d\u00E9clar\u00E9e 'abstract' ou 'final'.
PCKD044=Une classe de tableau compact (packed array) est requise pour cette op\u00E9ration.
PCKD043=La classe com.ibm.jvm.packed.PackedObject doit \u00EAtre abstraite et non @Packed.
PCKD042=
PCKD041=Le type transtyp\u00E9 est plus grand que l'objet d'origine.
PCKD040=Les longueurs de tableau sont diff\u00E9rentes.
PORT029=Identificateur non valide. Identificateur du fichier \: %1$d.
PORT028=mmap a \u00E9chou\u00E9 en raison d'options de mappage non valides.
PORT027=mmap a \u00E9chou\u00E9 en raison d'un param\u00E8tre de protection de la m\u00E9moire non valide.
PORT026=Le fichier sp\u00E9cifi\u00E9 est un r\u00E9pertoire
PORT025=Type de verrou non valide pour l'op\u00E9ration de verrouillage du fichier. lockFlags \: %1$d
PORT024=IEATDUMP a \u00E9chou\u00E9, car il a \u00E9t\u00E9 impossible d'affecter le jeu de donn\u00E9es de vidage (v\u00E9rifiez l'espace disque et les autorisations de zone).
PORT023=IEATDUMP a \u00E9chou\u00E9, car le mod\u00E8le de vidage d\u00E9fini par l'utilisateur est trop long. Nouvelle tentative de vidage en utilisant le mod\u00E8le par d\u00E9faut.
PORT022=Ajout de .X&DS au mod\u00E8le de vidage d\u00E9fini par l'utilisateur pour permettre les vidages mutliparties.
PORT021=Vous avez ouvert un s\u00E9maphore partag\u00E9 System V p\u00E9rim\u00E9 \: file\:%1$s semid\:%2$d
PORT020=Vous avez ouvert une m\u00E9moire partag\u00E9e System V p\u00E9rim\u00E9e \: file\:%1$s shmid\:%2$d
PCKD039=L'annotation @Length sur %2$.*1$s dans %4$.*3$s n'est pas valide \: la zone ne doit pas \u00EAtre d\u00E9clar\u00E9e 'static'
PCKD038=L'annotation @Length sur %2$.*1$s dans %4$.*3$s est manquante
PCKD037=impossible de cr\u00E9er un tableau @Packed multidimensionnel
PCKD036=La classe @Packed ne peut pas comporter de m\u00E9thodes synchronis\u00E9es d'instance.
PCKD035=La classe @Packed %2$.*1$s ne peut pas comporter la m\u00E9thode synchronis\u00E9e d'instance %4$.*3$s
PCKD034=La classe @Packed ne peut pas contenir de zones compactes imbriqu\u00E9es d\u00E9clar\u00E9es 'final'.
PCKD033=La classe @Packed %2$.*1$s ne peut pas contenir la zone condens\u00E9e imbriqu\u00E9e de type final %4$.*3$s
PCKD032=La classe @Packed ne peut pas contenir de zones transitoires.
PCKD031=La classe @Packed %2$.*1$s ne peut pas contenir la zone transitoire %4$.*3$s
PCKD030=La classe @Packed ne peut pas contenir de zones volatiles.
PORT019=Impossible de cr\u00E9er le r\u00E9pertoire %s.  Les classes partag\u00E9es seront d\u00E9sactiv\u00E9es jusqu'\u00E0 la cr\u00E9ation de ce r\u00E9pertoire.
PORT018=Echec de l'op\u00E9ration \: %1$d (\u00E9chec de %2$s \: %3$d)
PORT017=Echec de l'op\u00E9ration \: %d
PORT016=Erreur interne %i
PORT015=Impossible de r\u00E9soudre les r\u00E9f\u00E9rences de biblioth\u00E8que partag\u00E9e - une biblioth\u00E8que partag\u00E9e pr\u00E9requise peut manquer
PORT014=Echec de chargement de la dll car elle est introuvable
PORT013=Erreur lors du chargement de la biblioth\u00E8que partag\u00E9e - la table dll est introuvable
PORT012=Erreur lors du chargement de la biblioth\u00E8que partag\u00E9e en raison du bit PACE en cours de d\u00E9finition
PORT011=Impossible d'allouer de la m\u00E9moire lors d'une tentative de chargement d'une biblioth\u00E8que partag\u00E9e
PORT010=Le droit de chargement de la biblioth\u00E8que partag\u00E9e n'a pas \u00E9t\u00E9 accord\u00E9
CDRT002=PC d\u00E9faillant \: %1$p (d\u00E9calage %2$p), m\u00E9ta-donn\u00E9es \= %3$p
CDRT001=M\u00E9thode \: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
CDRT000=Impossible de localiser la mappe de pile JIT - abandon de la machine virtuelle en cours
PCKD029=La classe @Packed %2$.*1$s ne peut pas contenir la zone volatile %4$.*3$s
PCKD028=La classe @Packed ne peut pas impl\u00E9menter d'interface.
PCKD027=La classe @Packed %.*s ne doit pas impl\u00E9menter d'interface.
PCKD026=La classe @Packed doit \u00EAtre d\u00E9clar\u00E9e 'final'.
PCKD025=La classe @Packed %.*s doit \u00EAtre d\u00E9clar\u00E9e 'final'.
PCKD024=L'annotation @Length sur %2$.*1$s dans %4$.*3$s n'est pas valide \: la valeur @Length doit \u00EAtre positive
PCKD023=Cette fonction n'est pas applicable aux objets @Packed mixtes.
PCKD022=L'annotation @Length sur %2$.*1$s dans %4$.*3$s n'est pas valide \: le type de zone doit \u00EAtre @Packed
PCKD021=L'annotation @Length sur %2$.*1$s dans %4$.*3$s n'est pas valide \: le type de zone doit \u00EAtre un tableau compact
PCKD020=L'annotation @Length sur %2$.*1$s dans %4$.*3$s n'est pas valide \: la classe d\u00E9clarante n'est pas @Packed
PORT009=La biblioth\u00E8que partag\u00E9e sp\u00E9cifi\u00E9e est introuvable
PORT008=L'architecture du module n'est pas correcte
PORT007=Le module sp\u00E9cifi\u00E9 n'est pas un module
PORT006=Le format du module n'est pas correct
PORT005=Impossible de charger la biblioth\u00E8que partag\u00E9e
PORT004=Echec de la r\u00E9solution de symboles
PORT003=Impossible de charger le module d\u00E9pendant %s
PORT002=Erreur inconnue lors du chargement de la biblioth\u00E8que partag\u00E9e
PORT001=Echec d'allocation de m\u00E9moire lors d'une tentative d'\u00E9criture dans un fichier.
PORT000=
PCKD019=La classe non @Packed %.*s a pr\u00E9c\u00E9demment \u00E9t\u00E9 enregistr\u00E9e comme classe @Packed.
PCKD018=La classe @Packed %.*s a pr\u00E9c\u00E9demment \u00E9t\u00E9 enregistr\u00E9e comme classe non @Packed.
PCKD017=Stockage impossible dans un tableau d'un type @Packed.
PCKD016=Affectation impossible \u00E0 une zone imbriqu\u00E9e d'un type @Packed.
PCKD015=Une classe @Packed doit \u00E9tendre PackedObject ou une classe @Packed abstraite.
PCKD014=Les sous-classes de com.ibm.jvm.packed.PackedObject doivent \u00EAtre @Packed.
PCKD013=com.ibm.jvm.packed.PackedObject ne peut pas \u00EAtre charg\u00E9e par un chargeur de classe non syst\u00E8me.
PCKD012=Cette op\u00E9ration n'est pas valide sur les objets @Packed.
PCKD011=Copie impossible entre objets de types @Packed diff\u00E9rents.
PCKD010=
PCKD009=%2$.*1$s provenant de l'annotation @ImportPacked dans %4$.*3$s a pr\u00E9c\u00E9demment \u00E9t\u00E9 enregistr\u00E9e comme classe non @Packed.
PCKD008=La classe ne correspond pas \u00E0 une annotation @ImportPacked pr\u00E9c\u00E9dente.
PCKD007=Impossible de cr\u00E9er un objet via cette API si la classe de l'objet est un type @Packed mixte
PCKD006=
J2JX110=Le fichier JAR %s a d\u00E9j\u00E0 \u00E9t\u00E9 converti
PCKD005=
PCKD004=N'est pas un objet tableau @Packed
PCKD003=Une classe de tableau @Packed n'est pas valide pour cette op\u00E9ration.
PCKD002=N'est pas un objet @Packed natif
PCKD001=N'est pas un objet @Packed
PCKD000=N'est pas une classe @Packed
SHRC099=%1$d \: 0x%2$p ORPHAN \: %4$.*3$s \u00E0 0x%5$p.
SHRC098=\nStatistiques actuelles du cache "%s" \: \n
SHRC097=Le cache partag\u00E9 "%s" est corrompu. Aucune nouvelle machine JVM ne pourra se connecter au cache.\n \tLes machines JVM existantes pourront continuer \u00E0 fonctionner, mais ne pourront pas mettre \u00E0 jour le cache.
SHRC096=Le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscmx pour d\u00E9finir la taille du cache.
SHRC095=Les tentatives d'appel de markStale sur les \u00E9l\u00E9ments de cache partag\u00E9 ont \u00E9chou\u00E9
SHRC094=El\u00E9ment orphelin trouv\u00E9 mais ROMClass local transmis \u00E0 addROMClassToCache
SHRC093=Fin inattendue d\u00E9tect\u00E9e d'une autre machine JVM lors de la mise \u00E0 jour
J2JX109=\  -E xxx\=yyy                d\u00E9finit la propri\u00E9t\u00E9 syst\u00E8me xxx \u00E0 la valeur de la variable d'environnement yyy \u00E0 l'ex\u00E9cution
SHRC092=Echec ADD lors de la lecture du cache
J2JX108=\  -g[\:lines,source,vars]    g\u00E9n\u00E8re un sous-ensemble (lignes, source, et/ou variables) d'informations de d\u00E9bogage dans JXE
SHRC091=Lecture de donn\u00E9es corrompues pour l'\u00E9l\u00E9ment 0x%p (type de donn\u00E9es non valide)
J2JX107=\  -g\:nosym                  inclut des informations de d\u00E9bogage dans JXE
SHRC090=Impossible d'obtenir le mutex de cache dans le d\u00E9marrage SH_CacheMap
J2JX106=\  -g\:sym                    g\u00E9n\u00E8re un fichier .sym pour le d\u00E9bogage, aucune information de d\u00E9bogage dans JXE
J2JX105=\  -nog                      g\u00E9n\u00E8re aucune information de d\u00E9bogage pour JXE
J2JX104=\  -g                        identique \u00E0 -g\:sym
J2JX103=Impossible de compiler la m\u00E9thode \: %2$.*1$s/%4$.*3$s%6$.*5$s jitErr 0%7$x
J2JX102=Impossible de compiler la m\u00E9thode native \: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX101=Impossible de compiler la m\u00E9thode abstraite \: %2$.*1$s/%4$.*3$s%6$.*5$s
J2JX100=%s n'est pas pris en charge dans cette configuration
SHRC089=Impossible de cr\u00E9er le mutex d'actualisation dans SH_CacheMap
SHRC088=Impossible de cr\u00E9er un cache en tant que ROMImageSegment dans SH_CacheMap
SHRC087=Echec de MarkStale lors de ClasspathManager\:\:update()
SHRC086=Impossible d'entrer le mutex de la table de hachage ClasspathManager
SHRC085=Impossible d'allouer de la m\u00E9moire pour l'en-t\u00EAte d'\u00E9l\u00E9ment de liste li\u00E9e
SHRC084=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e
SHRC083=Impossible d'allouer de la m\u00E9moire pour le tableau identifiedClasspaths dans SH_ClasspathManagerImpl2
SHRC082=Impossible de cr\u00E9er identifiedMutex dans SH_ClasspathManagerImpl2
SHRC081=Impossible de cr\u00E9er cpeTableMutex dans SH_ClasspathManagerImpl2
SHRC080=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage
SHRC079=Impossible de cr\u00E9er la table de hachage dans SH_ClasspathManagerImpl2
SHRC078=Impossible de cr\u00E9er le pool linkedListHdr dans SH_ClasspathManagerImpl2
SHRC077=Impossible de cr\u00E9er le pool linkedListImpl dans SH_ClasspathManagerImpl2
SHRC076=Recherche de la classe %1$s dans le cache partag\u00E9 de l'ID chargeur de classe %2$d...
SHRC075=\ Echec.
SHRC074=\ R\u00E9ussite.
SHRC073=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %3$d d'URL %5$.*4$s (index %6$d)...
VIRT001=Impossible d'initialiser l'hyperviseur.
SHRC072=Option de ligne de commande "%s" non reconnue
VIRT000=Fonction de virtualisation demand\u00E9e.
SHRC071=L'option de ligne de commande "%s" requiert une sous-option
SHRC070=Mises \u00E0 jour incr\u00E9mentielles d\u00E9sactiv\u00E9es
SHRC069=R\u00E9duction des conflits de stockages concurrents d\u00E9sactiv\u00E9e
SHRC068=Mise en cache locale des chemins d'acc\u00E8s aux classes d\u00E9sactiv\u00E9e
SHRC067=V\u00E9rification de l'horodatage d\u00E9sactiv\u00E9e
SHRC066=Verrouillage des tables de hachage locales d\u00E9sactiv\u00E9
SHRC065=Impossible d'allouer le pool dans shrinit
SHRC064=Impossible de cr\u00E9er configMonitor dans shrinit
SHRC063=Impossible d'allouer de la m\u00E9moire pour sharedClassConfig dans shrinit
SHRC062=Erreur lors de la copie du nom d'utilisateur dans le nom de cache par d\u00E9faut
SHRC061=Le nom de cache ne doit pas d\u00E9passer 64 caract\u00E8res. Cache non cr\u00E9\u00E9.
SHRC060=Impossible d'allouer de la m\u00E9moire pour la m\u00E9moire tampon de cha\u00EEnes dans shrinit\:\:hookFindSharedClass
JDTS000=Ecoute du transport dt_socket \u00E0 l'adresse \: %d
OFFC031=D\u00E9chargement \: format non valide du fichier de propri\u00E9t\u00E9s local {%s}.
OFFC030=D\u00E9chargement \: fichier de propri\u00E9t\u00E9s natif local introuvable {%s}.
SHRC059=Impossible d'allouer de la m\u00E9moire pour ClasspathItem dans shrinit\:\:hookFindSharedClass
SHRC058=Impossible d'allouer de la m\u00E9moire pour ClasspathItem dans shrinit\:\:hookStoreSharedClass
SHRC057=Param\u00E8tres erron\u00E9s pour l'option d'expiration
SHRC056=Option de ligne de commande "%s" non reconnue
SHRC055=D\u00E9sactiver les mises \u00E0 jour incr\u00E9mentielles de cache
SHRC054=D\u00E9sactiver l'algorithme permettant de r\u00E9duire les conflits de stockage
SHRC053=D\u00E9sactiver le verrouillage local de table de hachage
SHRC052=D\u00E9sactiver la mise en cache locale des chemins d'acc\u00E8s aux classes
SHRC051=D\u00E9sactiver les mises \u00E0 jour dynamiques
OFFC029=D\u00E9chargement \: \u00E9chec de la cr\u00E9ation du gestionnaire de d\u00E9chargement.
SHRC050=Activer la sortie prolixe
OFFC028=D\u00E9chargement \: \u00E9chec du d\u00E9marrage du contr\u00F4leur de quarantaine.
OFFC027=D\u00E9chargement \: informations de connexion manquantes pour l'isolement distant.
OFFC026=D\u00E9chargement \: informations de connexion non valides pour l'isolement distant.
OFFC025=D\u00E9chargement \: \u00E9chec du d\u00E9marrage du contr\u00F4leur de quarantaine avec url\=%s.
OFFC024=D\u00E9chargement \: isolement JNI activ\u00E9 pour le groupe de biblioth\u00E8ques  {%s}.
OFFC023=D\u00E9chargement de trace \: consignation du processus parall\u00E8le d'optimisation dans %s
OFFC022=Utilitaire de simulation de d\u00E9chargement install\u00E9. Utilisez -Xoffload\:trace\:help pour conna\u00EEtre la syntaxe
OFFC021=\ttuningfork\=device  envoie la sortie tuningfork au p\u00E9riph\u00E9rique d\u00E9fini.
OFFC020=\txml\=filename       consigne l'activit\u00E9 JNI dans le fichier d\u00E9fini.
SHRC049=Mode d\u00E9bogage v\u00E9rifiant tout le bytecode entrant
SHRC048=Dresser la liste de tous les \u00E9l\u00E9ments du cache
SHRC047=Afficher le r\u00E9capitulatif des statistiques de cache
SHRC046=Afficher tous les caches partag\u00E9s et leurs statistiques
SHRC045=D\u00E9truire les caches inutilis\u00E9s pendant <t> minutes
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC043=Activer le partage de bytecode modifi\u00E9\n \t<modContext> est un descripteur utilisateur qui d\u00E9crit le type de modification\n \tLes machines JVM qui utilisent le m\u00EAme <modContext> doivent utiliser les m\u00EAmes modifications
SHRC042=D\u00E9truire tous les caches partag\u00E9s
SHRC041=D\u00E9truire le cache partag\u00E9 (utiliser le param\u00E8tre de nom ou la valeur par d\u00E9faut)
OFFC019=Usage\: -Xoffload\:trace\:[option[,option[,...]]]
SHRC040=Indiquer le nom d'un cache partag\u00E9
OFFC018=Utilitaire de simulation de d\u00E9chargement pour J9, Version %s
J9VM149=%s n'est plus pris en charge. Veuillez ajouter les biblioth\u00E8ques/fichiers jar n\u00E9cessaires au chemin d'acc\u00E8s aux classes.
OFFC017=\thelp           imprime cet \u00E9cran
J9VM148=%s n'est plus pris en charge. Le m\u00E9canisme de remplacement avec normes est pris en charge uniquement via des modules.
OFFC016=\ttax\=spin|delay   d\u00E9finit la strat\u00E9gie de d\u00E9lai.
J9VM147=Impossible de connecter l'unit\u00E9 d'ex\u00E9cution en cours
OFFC015=\toutput\=device    Sortie dans un fichier, 'stdout' ou 'stderr'
J9VM146=invokeinterface de la m\u00E9thode non publique '%4$.*3$s%6$.*5$s' dans %2$.*1$s
OFFC014=\tdelay\=\#[ms|us]   applique un d\u00E9lai de \# milli/microsecondes \u00E0 chaque appel JNI
J9VM145=%s n'est pas pris en charge sous z/OS.
OFFC013=Usage\: -Xoffload\:sim\:[option[,option[,...]]]
J9VM144=trop de param\u00E8tres \: 255 + 1
OFFC012=Utilitaire de simulation de d\u00E9chargement pour J9, Version %s
J9VM143=L'option de ligne de commande %s n'est pas prise en charge dans cette version d'IBM SDK.
OFFC011=Simulateur de d\u00E9chargement \: \u00E9chec de l'initialisation du processus parall\u00E8le d'optimisation.
J9VM142=L'option de ligne de commande -Xrealtime n'est pas prise en charge dans cette version d'IBM SDK.
OFFC010=Unit\u00E9 de dur\u00E9e non reconnue -> %s
J9VM141=m\u00E9thodes par d\u00E9faut conflictuelles pour '%2$.*1$s%4$.*3$s' dans %6$.*5$s \u00E0 partir des classes [%7$s]
J9VM140=L'appelant n'est pas annot\u00E9 comme \u00E9tant @sun.reflect.CallerSensitive.
SHRC039=Afficher l'aide partag\u00E9e g\u00E9n\u00E9rale
SHRC038=Syntaxe \:\n\njava -Xshareclasses[\:option,...]\n\n Les options valides incluses (avec un bref r\u00E9sum\u00E9) sont \:\n\n
SHRC037=Mises \u00E0 jour incr\u00E9mentielles d\u00E9sactiv\u00E9es
SHRC399=Octets de donn\u00E9es                          %*c\= %d
SHRC036=R\u00E9duction des conflits de stockages concurrents d\u00E9sactiv\u00E9e
SHRC398=\# M\u00E9thodes AOT                       %*c\= %d
SHRC035=Mise en cache locale des chemins d'acc\u00E8s aux classes d\u00E9sactiv\u00E9e
SHRC397=Octets AOT                           %*c\= %d
SHRC034=V\u00E9rification de l'horodatage d\u00E9sactiv\u00E9e
SHRC396=%% classes p\u00E9rim\u00E9es                     %*c\= %d%%\n
SHRC033=Verrouillage des tables de hachage locales d\u00E9sactiv\u00E9
SHRC395=\# Classes p\u00E9rim\u00E9es                     %*c\= %d
SHRC032=Le niveau de modification du cache de classes partag\u00E9es auquel vous tentez de vous connecter est erron\u00E9.
SHRC394=\# Jetons                            %*c\= %d
SHRC031=La version de JVM du cache de classes partag\u00E9es auquel vous tentez de vous connecter est incompatible.
SHRC393=\# Adresses URL                              %*c\= %d
OFFC009=D\u00E9chargement \: erreur irr\u00E9m\u00E9diable. Impossible de fermer l'\u00E9v\u00E9nement
SHRC030=L'en-t\u00EAte du cache de classes partag\u00E9es auquel vous tentez de vous connecter est incorrect.
SHRC392=\# Chemins de classe                        %*c\= %d
OFFC008=Simulateur de d\u00E9chargement \: dur\u00E9e de veille non valide. Choisissez une dur\u00E9e >\= 1 milliseconde.
J9VM139=Echec de la cr\u00E9ation d'une unit\u00E9 d'ex\u00E9cution \: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 %4$zd (0x%5$zx)
SHRC391=\# ROMClasses                        %*c\= %d
OFFC007=Simulateur de d\u00E9chargement \: la fr\u00E9quence d'horloge est de %llu tics/seconde, have_nanosleep\=%d
J9VM138=L'option -Xdiagnosticscollector n'est pas prise en charge par cette JVM.
SHRC390=%% utilis\u00E9 de m\u00E9tadonn\u00E9es                     %*c\= %d%%
OFFC006=Simulateur de d\u00E9chargement \: consignation des appels JNI dans %s.
J9VM137=la classe %2$.*1$s comporte des valeurs par d\u00E9faut conflictuelles pour la m\u00E9thode %4$.*3$s%6$.*5$s
OFFC005=Simulateur de d\u00E9chargement \: d\u00E9lai suppl\u00E9mentaire en utilisant sleep.
J9VM136=Le param\u00E8tre /proc/sys/kernel/core_pattern "%s" une cha\u00EEne de format pour le renommage des clich\u00E9s de processus core. La JVM n'est peut-\u00EAtre pas en mesure de localiser les clich\u00E9s du processus core et de les renommer.
OFFC004=Simulateur de d\u00E9chargement \: d\u00E9lai suppl\u00E9mentaire en utilisant spin.
J9VM135=Le param\u00E8tre /proc/sys/kernel/core_pattern "%s" indique que les clich\u00E9s du processus core doivent \u00EAtre dirig\u00E9s vers un programme externe. La JVM n'est peut-\u00EAtre pas en mesure de localiser les clich\u00E9s du processus core et de les renommer.
OFFC003=Simulateur de d\u00E9chargement \: application de %d millisecondes suppl\u00E9mentaires \u00E0 chaque appel JNI.
J9VM134=L'option syst\u00E8me fullcore est param\u00E9tr\u00E9e sur FALSE ; il se peut que les vidages syst\u00E8me soient tronqu\u00E9s.
OFFC002=Simulateur de d\u00E9chargement \: application de %d millisecondes suppl\u00E9mentaires \u00E0 chaque appel JNI.
J9VM133=La taille ulimit maximale (hard) de la m\u00E9moire syst\u00E8me est param\u00E9tr\u00E9e sur %d ; il se peut que les vidages syst\u00E8me soient tronqu\u00E9s.
OFFC001=Utilitaire de simulation de d\u00E9chargement install\u00E9. Utilisez -Xoffload\:sim\:help pour conna\u00EEtre la syntaxe
J9VM132=Mode de mot de verrouillage sp\u00E9cifi\u00E9 incorrect ; java/lang/Class et java/lang/String ne peuvent pas comporter de mots de verrouillage lorsque -Xtenant est pr\u00E9sent \: %s
OFFC000=-Xoffload\:sim\: option non reconnue --> '%s'
J9VM131=Arr\u00EAt en cours du processus \u00E0 l'aide de CEE3AB2() avec fin anormale %1$u, motif %2$u, nettoyage %3$u.
J9VM130=L'application a repris l'ex\u00E9cution apr\u00E8s le traitement d'une condition irr\u00E9m\u00E9diable et est renvoy\u00E9e ou rappel\u00E9e \u00E0 Java sans autorisation (code JIT)
SHRC029=M\u00E9moire insuffisante sur le syst\u00E8me
SHRC028=Acc\u00E8s refus\u00E9
SHRC027=Nom du cache partag\u00E9 trop long
SHRC389=Octets de m\u00E9tadonn\u00E9es                      %*c\= %d
SHRC026=Impossible de cr\u00E9er un cache de la taille demand\u00E9e \: v\u00E9rifiez vos param\u00E8tres SHMMAX et SHMMIN
SHRC388=Octets ROMClass                      %*c\= %d
SHRC025=erreur de connexion de la m\u00E9moire partag\u00E9e
SHRC387=octets disponibles                          %*c\= %d
SHRC024=erreur de d\u00E9connexion de la m\u00E9moire partag\u00E9e
SHRC386=taille du cache                          %*c\= %d
SHRC023=Le cache n'existe pas
SHRC385=pointeur d'allocation                  %*c\= 0x%p\n
SHRC022=Erreur lors de la cr\u00E9ation de la r\u00E9gion de m\u00E9moire partag\u00E9e
SHRC384=adresse de fin                         %*c\= 0x%p
SHRC021=Un code d'erreur inconnu a \u00E9t\u00E9 retourn\u00E9
SHRC383=\nadresse de base                        %*c\= 0x%p
J9VM129=L'application a repris l'ex\u00E9cution apr\u00E8s le traitement d'une condition fatale et est renvoy\u00E9e ou rappel\u00E9e \u00E0 Java sans autorisation
SHRC020=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore
SHRC382=Octets LocalVariableTable de la zone de d\u00E9bogage des classes %*c\= %u\n
J9VM128=Espace de segment de m\u00E9moire Java
SHRC381=Octets LineNumberTable de la classe         %*c\= %u
J9VM127=La taille initiale du sous-allocateur 32 bits ne peut pas \u00EAtre param\u00E9tr\u00E9e sur z\u00E9ro.
SHRC380=%% utilis\u00E9 dans la zone de d\u00E9bogage des classes             %*c\= %u%%
J9VM126=La taille de validation du sous-allocateur 32 bits ne peut pas \u00EAtre param\u00E9tr\u00E9e sur z\u00E9ro.
J9VM125=La taille de validation du sous-allocateur 32 bits est sup\u00E9rieure \u00E0 la taille initiale. Taille de validation \= %1$u, taille initiale \= %2$u.
J9VM124=Impossible de d\u00E9finir la classe %.*s ; '%.*s' est un package de syst\u00E8me prot\u00E9g\u00E9
J9VM123=Tentative d'ex\u00E9cution sur un processeur non pris en charge, la machine virtuelle Java va prendre fin.
J9VM122=Echec de l'obtention de la plage d'adresses user32.dll requise pour -Xprotectcontiguous.
J9VM121=-Xscmaxjitdata n'est pas pris en compte en l'absence de -Xshareclasses
J9VM120=-Xscminjitdata n'est pas pris en compte en l'absence de -Xshareclasses
SHRC019=longueur demand\u00E9e trop faible
SHRC018=impossible d'allouer de la m\u00E9moire
SHRC017=Code d'erreur \: %d
SHRC379=Taille de la zone de d\u00E9bogage des classes               %*c\= %u
SHRC016=Erreur du cache de classes partag\u00E9es \:
SHRC378=\nOptions de ligne de commande associ\u00E9es \:\n
SHRC015=Erreur du cache de classes partag\u00E9es \: indicateur non valide
SHRC377=La valeur -Xscdmx de %u octets est sup\u00E9rieure \u00E0 %u octets de l'espace disponible. Une valeur de %u octets sera utilis\u00E9e pour -Xscdmx \u00E0 la place.
SHRC014=Echec de la suppression du s\u00E9maphore du cache "%s"
SHRC376=%1$d \: 0x%2$p CACHE ZIP \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC013=Echec du retrait de la m\u00E9moire du cache partag\u00E9 "%s"
SHRC375=Le nom du cache est trop long lorsque le nom d'utilisateur est inclus. Il reste %d octets dans cette m\u00E9moire tampon et le nom d'utilisateur fait %d octets.
SHRC012=Impossible de retirer le cache partag\u00E9 "%s" \: des machines JVM y sont encore connect\u00E9es
SHRC374=Cache cr\u00E9\u00E9 avec \:
SHRC011=Erreur \: Impossible d'ouvrir le cache de classes partag\u00E9es
SHRC373=JIT data bytes     \= %d
J9VM119=-Xscmaxjit n'est pas pris en compte en l'absence de -Xshareclasses
SHRC010=Le cache partag\u00E9 "%s" est d\u00E9truit
SHRC372=\# Zip caches       \= %d
J9VM118=-Xscminjit n'est pas pris en compte en l'absence de -Xshareclasses
SHRC371=Zip cache bytes    \= %d
J9VM117=-Xitsn n'est pas pris en compte en l'absence de -Xshareclasses
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister et TraceListener ne sont plus pris en charge. Utilisez les nouvelles versions dans JVMRAS_VERSION_1_5
SHRC370=-Xnolinenumbers    \= false
J9VM116=noLockword \:%.*s
J9RI022=JVMRI en cous d'initialisation ne peut pas allouer de moniteur dump jvri
J9VM115=lockword \:%.*s
J9RI021=jvmri->RunDumpRoutine n'est pas pris en charge.
J9VM114=Mode lockword\=%s
J9RI020=jvmri->CreateThread \: impossible d'allouer un moniteur priv\u00E9
J9VM113=-----------------------------
J9VM112=Configuration lockword
J9VM111=Option lockword non valide sp\u00E9cifi\u00E9e \:%s
J9VM110=Mode lockword non valide sp\u00E9cifi\u00E9 \:%s
SHRC009=Cache partag\u00E9 ouvert \: %1$s taille \: %2$d octets
SHRC008=Cache partag\u00E9 cr\u00E9\u00E9 \: %1$s taille \: %2$d octets
SHRC007=Impossible de retirer le cache de classes partag\u00E9es "%s"
SHRC369=-Xnolinenumbers    \= true
SHRC006=Lors des %1$d derni\u00E8res minutes, %2$d caches sont arriv\u00E9s \u00E0 expiration
SHRC368=Arr\u00EAt d'un cache de classes partag\u00E9es activ\u00E9 pour le d\u00E9bogage.
SHRC005=Aucun cache de classes partag\u00E9es disponible
SHRC367=debug enabled      \= false
J9RI019=jvmri->InjectOutOfMemory non pris en charge.
SHRC004=Impossible de d\u00E9truire le cache "%s"
SHRC366=debug enabled      \= true
J9RI018=jvmri->NotifySignal \: \u00E9mission du signal %d.
SHRC003=heure de la derni\u00E8re d\u00E9connexion
SHRC365=Active le stockage des informations de d\u00E9bogage de classe dans la classe partag\u00E9e.
J9RI017=Impossible d'allouer l'agent de nettoyage dans jvmri->SetOutOfMemoryHook, fonction non enregistr\u00E9e.
SHRC002=en cours d'utilisation
SHRC364=Echec de l'appel de SH_OSCachesysv\:\:acquireWriteLock() \u00E0 j9shsem_wait sur semid %d avec l'erreur %d.
J9RI016=jvmri->SetOutOfMemoryHook appel\u00E9 avec rappel vide, fonction non enregistr\u00E9e.
SHRC001=ID m\u00E9moire partag\u00E9e du syst\u00E8me d'exploitation
SHRC363=Impossible d'allouer une API pour les classes partag\u00E9es dans shrinit
J9VM109=Syst\u00E8me d'exploitation non pris en charge (%s) \: Windows XP ou une version plus r\u00E9cente est requis.
J9RI015=jvmri->RunDumpRoutine \: componentId hors limites.
SHRC000=Cache partag\u00E9
SHRC362=Impossible d'allouer de la m\u00E9moire pour ClasspathItem
J9VM108=-Xlog\:info,warn,error\n
J9RI014=jvmri->RunDumpRoutine \: r\u00E9cup\u00E9ration de donn\u00E9es de composant impossible.
SHRC361=Erreur lors de la connexion \u00E0 la m\u00E9moire partag\u00E9e au cours de l'ouverture/la cr\u00E9ation.
J9VM107=-Xlog\:error,warn
J9RI013=jvmri->ReleaseRasInfo \: structure poss\u00E9dant une zone de type non prise en charge.
SHRC360=Donn\u00E9es d'octet non trouv\u00E9es pour la cl\u00E9 %.*s dans le cache partag\u00E9...
J9VM106=Les options info, warn, error, vital et config peuvent \u00EAtre combin\u00E9es \u00E0 l'aide d'une ',' par exemple \:\n
J9RI012=jvmri->ReleaseRasInfo appel\u00E9 avec structure RasInfo vide.
J9VM105=-Xlog\:config            Consigne les messages de configuration de la machine virtuelle Java.\n
J9RI011=L'une des zones de type de la structure RasInfo n'est pas prise en charge.
J9VM104=-Xlog\:vital             Consigne les messages critiques de la machine virtuelle Java. Cette option est activ\u00E9e par d\u00E9faut.
J9RI010=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
J9VM103=-Xlog\:error             Consigne les messages d'erreur de la machine virtuelle Java. Cette option est activ\u00E9e par d\u00E9faut.
J9VM102=-Xlog\:warn              Consigne les messages d'avertissement de la machine virtuelle Java.
J9VM101=-Xlog\:info              Consigne les messages d'information de la machine virtuelle Java.
J9VM100=-Xlog\:all               Consigne tous les messages de la machine virtuelle Java.
SHRC359=Donn\u00E9es d'octet trouv\u00E9es pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC358=Echec du stockage des donn\u00E9es d'octet pour la cl\u00E9 %.*s dans le cache partag\u00E9.
SHRC357=Donn\u00E9es d'octet stock\u00E9e pour la cl\u00E9 %.*s dans le cache partag\u00E9.
J9RI009=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
SHRC356=Echec du stockage du code AOT non trouv\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
J9RI008=jvmri->GetRasInfo \: r\u00E9cup\u00E9ration de composants impossible.
SHRC355=Code AOT stock\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
J9RI007=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
SHRC354=Code AOT non trouv\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
J9RI006=jvmri->GetRasInfo appel\u00E9 avec structure RasInfo vide.
SHRC353=Code AOT trouv\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
J9RI005=jvmri->GetComponentDataArea \: composant %s sans dataArea sous cette machine virtuelle.
SHRC352=Echec du stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec le jeton %5$.*4$s.
J9RI004=jvmri->DynamicVerbosegc non pris en charge.
SHRC351=Classe stock\u00E9e %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec le jeton %5$.*4$s.
J9RI003=Impossible d'allouer l'agent de nettoyage dans jvmri->DumpRegister, fonction non enregistr\u00E9e.
SHRC350=Echec du stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s.
J9RI002=jvmri->DumpRegister appel\u00E9 avec rappel vide, fonction non enregistr\u00E9e.
J9RI001=Erreur interne lors de la suppression de l'agent de nettoyage dans jvmri->DumpDeregister, il se peut que la fonction ne soit pas d\u00E9senregistr\u00E9e.
J9RI000=jvmri->CreateThread \: impossible d'allouer la m\u00E9moire des arguments d'unit\u00E9 d'allocation
SHRC349=Classe stock\u00E9e %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s.
SHRC348=Echec du stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s (index %6$d).
SHRC347=Classe stock\u00E9e %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s (index %6$d).
SHRC346=Classe %1$s non trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec le jeton %4$.*3$s.
SHRC345=Classe %1$s trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec le jeton %4$.*3$s.
SHRC344=Classe %1$s non trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec l'URL %4$.*3$s.
SHRC343=Classe %1$s trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec l'URL %4$.*3$s.
SHRC342=Classe %1$s non trouv\u00E9e dans le cache partag\u00E9 pour l'ID de chargeur de classe %2$d.
SHRC341=Classe %1$s trouv\u00E9e dans le cache partag\u00E9 pour l'ID de chargeur de classe %2$d.
SHRC340=Echec de la v\u00E9rification du contr\u00F4le de redondance cyclique (CRC) du cache partag\u00E9. CRC stock\u00E9 %1$x, CRC calcul\u00E9 %2$x
SHRC339=Message d'erreur de la plateforme \: %1$s
SHRC338=Code d'erreur au niveau du port \= %1$d
SHRC699=Impossible de restaurer le cache partag\u00E9 non permanent "%s" \u00E0 partir de l'instantan\u00E9
SHRC337=Message d'erreur de la plateforme \: %1$s
SHRC698=Le cache partag\u00E9 non permanent "%s" a \u00E9t\u00E9 restaur\u00E9 \u00E0 partir de l'instantan\u00E9
SHRC336=Code d'erreur au niveau du port \= %1$d
SHRC697=Impossible d'obtenir un r\u00E9pertoire pour le cache partag\u00E9
SHRC335=Echec de la correction d'erreur \: impossible de d\u00E9truire le s\u00E9maphore partag\u00E9.
SHRC696=Les sous-options "%s" et "%s" sont incompatibles. La sous-option "%s" est ignor\u00E9e
J2SE000=-Djava.runtime.version=pxp6480sr2-20151023_01 (SR2)
SHRC334=Echec de la correction d'erreur \: impossible de d\u00E9truire la m\u00E9moire partag\u00E9e.
SHRC695=Restaurer un nouveau cache partag\u00E9 non permanent \u00E0 partir d'un instantan\u00E9
SHRC333=Protection de page de m\u00E9moire par d\u00E9faut activ\u00E9e pour le cache
SHRC694=D\u00E9truire tous les instantan\u00E9s de cache partag\u00E9
SHRC332=Protection de pages activ\u00E9e pour le cache
SHRC693=D\u00E9truire l'instantan\u00E9 d'un cache partag\u00E9 (utiliser le param\u00E8tre de nom ou la valeur par d\u00E9faut)
SHRC331=S\u00E9maphore acquis diff\u00E9rent de celui utilis\u00E9 pr\u00E9c\u00E9demment avec ce cache.
SHRC692=Cr\u00E9er un instantan\u00E9 d'un cache partag\u00E9 non permanent existant
SHRC330=SH_CompositeCacheImpl\:\:runExitCode n'a pas pu obtenir le mutex de zone d'\u00E9criture (code de retour %d).
SHRC691=Restreindre le nombre de chemins d'acc\u00E8s aux classes                  \= false
SHRC690=Restreindre le nombre de chemins d'acc\u00E8s aux classes                  \= true
JITM018=La taille de page volumineuse %1$zu%2$s %3$s n'est pas une taille prise en charge pour le cache de code JIT ; %4$zu%5$s %6$s utilis\u00E9 \u00E0 la place.
JITM017=La taille de page volumineuse %1$zu%2$s %3$s  n'est pas une taille prise en charge pour le cache de code JIT ; %4$zu%5$s utilis\u00E9 \u00E0 la place.
JITM016=La taille de page volumineuse %1$zu%2$s n'est pas une taille prise en charge pour le cache de code JIT ; %3$zu%4$s %5$s utilis\u00E9 \u00E0 la place.
JITM015=La taille de page volumineuse %1$zu%2$s n'est pas une taille prise en charge pour le cache de code JIT ; %3$zu%4$s utilis\u00E9 \u00E0 la place.
JITM014=Des virgules suppl\u00E9mentaires sont d\u00E9tect\u00E9es dans l'option '-Xlp' ; elles sont ignor\u00E9es
JITM013=L'option '%1$s' n'est pas compl\u00E8te ; le param\u00E8tre '%2$s' doit \u00EAtre sp\u00E9cifi\u00E9.
JITM012=La valeur de '%s' n'est pas correcte
JITM011=La valeur %s indiqu\u00E9e est trop \u00E9lev\u00E9e
JITM010=%s doit \u00EAtre suivi d'une valeur num\u00E9rique
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex n'a pas pu obtenir le mutex de la table de hachage (code de retour %d).
SHRC328=System V IPC a signal\u00E9 l'erreur '%s'
SHRC689=Permet \u00E0 une machine virtuelle Java de stocker les chemins d'acc\u00E8s aux classes dans le cache cr\u00E9\u00E9 avec l'option "restrictClasspaths".
SHRC327=Echec de l'appel de SH_OSCachesysv\:\:acquireWriteLock() \u00E0 j9shsem_wait avec l'erreur %d.
SHRC688=Les chemins d'acc\u00E8s aux classes ne peuvent \u00EAtre ajout\u00E9s que via la premi\u00E8re initialisation du cache par la machine virtuelle Java.
SHRC326=Echec de l'envoi du verrou utilisateur du cache des classes partag\u00E9es au cours de l'initialisation. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC687=Impossible de cr\u00E9er un nouveau cache de classe partag\u00E9e lors de l'ex\u00E9cution de l'option -Xshareclasses\:readonly
SHRC325=Echec de l'envoi du verrou de l'en-t\u00EAte du cache des classes partag\u00E9es au cours de l'initialisation. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC686=Impossible de d\u00E9marrer le cache de classes partag\u00E9es. Continuez sans l'utiliser car -Xshareclasses\:nonfatal est sp\u00E9cifi\u00E9
SHRC324=ERREUR \: Echec lors de la sortie du mutex pour l'en-t\u00EAte du cache de classe partag\u00E9e. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC685=Une erreur s'est produite lors de l'ouverture de la m\u00E9moire partag\u00E9e. Impossible de verrouiller le fichier de contr\u00F4le.
SHRC323=ERREUR \: Echec lors de l'entr\u00E9e du mutex pour l'en-t\u00EAte du cache de classe partag\u00E9e. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC684=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Impossible de verrouiller le fichier de contr\u00F4le.
SHRC322=Echec de l'initialisation des s\u00E9maphores du cache de classes partag\u00E9es. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC683=Limite syst\u00E8me du nombre total de fichiers ouverts atteinte.
SHRC321=Correction d'erreur \: fermeture des s\u00E9maphores de m\u00E9moire partag\u00E9s.
SHRC682=Limite syst\u00E8me du nombre maximal de r\u00E9gions de m\u00E9moire partag\u00E9e ou limite \u00E0 l'\u00E9chelle du syst\u00E8me de la m\u00E9moire allou\u00E9e aux r\u00E9gions de m\u00E9moire partag\u00E9e atteinte.
SHRC320=Correction d'erreur \: destruction des s\u00E9maphores de m\u00E9moire partag\u00E9s.
SHRC681=Limite syst\u00E8me du nombre maximal de s\u00E9maphores ou nombre maximal de s\u00E9maphores \u00E0 l'\u00E9chelle du syst\u00E8me atteint.
SHRC680=Echec de la correction d'erreur \: impossible de supprimer le fichier de contr\u00F4le du jeu de s\u00E9maphores %s associ\u00E9 au cache de classe partag\u00E9e.
JITM009=La configuration syst\u00E8me ne prend pas en charge le param\u00E8tre '%.*s' dans l'option '-Xlp'
JITM008=Echec d'allocation de m\u00E9moire par JIT
JITM007=Le code AOT du cache des classes partag\u00E9es ne peut pas \u00EAtre ex\u00E9cut\u00E9 avec les param\u00E8tres JVMPI ou JVMTI en cours. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM006=Le code AOT du cache des classes partag\u00E9es ne peut pas \u00EAtre ex\u00E9cut\u00E9 avec la r\u00E8gle de r\u00E9cup\u00E9ration de place en cours. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM005=Le code AOT du cache des classes partag\u00E9es ne peut pas \u00EAtre ex\u00E9cut\u00E9 dans la version JVM actuelle. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM004=Le code AOT du cache de classes partag\u00E9es ne peut pas s'ex\u00E9cuter sur ce processeur. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM003=Echec de l'initialisation de l'ex\u00E9cution de AOT. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM002=Erreur de stockage du code AOT dans le cache de classes partag\u00E9es. Endommagement possible du cache des classes partag\u00E9es. Le code AOT du cache de classes partag\u00E9es est ignor\u00E9.
JITM001=Espace insuffisant pour le code AOT dans le cache de classes partag\u00E9es. Nouveau code AOT non g\u00E9n\u00E9r\u00E9.
JITM000=Mat\u00E9riel non pris en charge [%d].
SHRC319=Correction d'erreur \: fermeture de la m\u00E9moire partag\u00E9e.
SHRC318=Correction d'erreur \: destruction de la m\u00E9moire partag\u00E9e.
SHRC679=Echec de la correction d'erreur \: impossible de supprimer le fichier de contr\u00F4le du jeu de s\u00E9maphores %s associ\u00E9 au cache de classe partag\u00E9e.
SHRC317=Imprimez le nom du fichier cache de classes partag\u00E9es qui sera utilis\u00E9.
SHRC678=Message d'erreur de la plateforme \: %1$s
SHRC316=Impossible de s\u00E9rialiser le cache, car aucune unit\u00E9 d'ex\u00E9cution n'est en cours.
SHRC677=Code d'erreur au niveau du port \= %1$d
SHRC315=impossible d'initialiser les segments de m\u00E9moire de classe du cachelet.
SHRC676=Echec de la destruction de la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classes partag\u00E9es.
SHRC314=Impossible d'allouer de la m\u00E9moire pour la tableau de rechercher dans SH_Manager.
SHRC675=Echec de la destruction de la m\u00E9moire partag\u00E9e associ\u00E9e \u00E0 un cache de classes partag\u00E9es.
SHRC313=Echec de la cr\u00E9ation du mutex jclCacheMutex dans shrinit
SHRC674=L'utilisateur n'est pas autoris\u00E9 \u00E0 d\u00E9truire la m\u00E9moire partag\u00E9e avec shmid\=%d. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire la m\u00E9moire partag\u00E9e.
SHRC312=Erreur de lib\u00E9ration du verrou en \u00E9criture pour l'en-t\u00EAte du fichier de cache des classes partag\u00E9es.
SHRC673=Echec de la destruction du jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classes partag\u00E9es.
SHRC311=Erreur lors de la lib\u00E9ration du verrou en \u00E9criture de la connexion au fichier de cache des classes partag\u00E9es.
SHRC672=Echec de la destruction du jeu de s\u00E9maphores associ\u00E9 \u00E0 un cache de classes partag\u00E9es.
SHRC310=Le cache permanent ne peut pas se trouver dans un syst\u00E8me de fichiers r\u00E9seau. S\u00E9lectionnez un r\u00E9pertoire de caches diff\u00E9rent.
SHRC671=L'utilisateur n'est pas autoris\u00E9 \u00E0 d\u00E9truire le jeu de s\u00E9maphores avec semid\=%d. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire le jeu de s\u00E9maphores.
SHRC670=Correction d'erreur \: tentative d'utilisation de la m\u00E9moire partag\u00E9e en mode lecture seule si la r\u00E9gion de m\u00E9moire partag\u00E9e existe, en r\u00E9ponse \u00E0 l'option "-Xshareclasses\:nonfatal".
SHRC309=Les options "grow" et "readonly" ne peuvent pas \u00EAtre utilis\u00E9es ensemble.
SHRC308=Echec de la s\u00E9rialisation du cache "%s". Echec de la mise \u00E0 jour des d\u00E9calages Classe ROM dans les m\u00E9thodes AOT.
SHRC669=Echec de la correction d'erreur \: impossible de d\u00E9truire la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classes partag\u00E9es.
SHRC307=\tROMMETHOD \: %2$.*1$s Signature \: %4$.*3$s Adresse \: 0x%5$p
SHRC668=Echec de la correction d'erreur \: impossible de d\u00E9truire la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classes partag\u00E9es. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire la m\u00E9moire partag\u00E9e.
SHRC306=\ Signature \: %2$.*1$s Adresse \: 0x%3$p
SHRC667=Correction d'erreur \: une m\u00E9moire partag\u00E9e d\u00E9truite portant l'id\=%d est associ\u00E9e \u00E0 un cache de classes partag\u00E9es.
SHRC305=Impossible d'allouer de la m\u00E9moire pour la table de recherche dans SH_ClasspathManagerImpl2
SHRC666=Correction d'erreur \: une m\u00E9moire partag\u00E9e d\u00E9truite est associ\u00E9e \u00E0 un cache de classes partag\u00E9es.
SHRC304=Echec du remplacement du cache "%s"
SHRC665=Echec de la correction d'erreur \: impossible de d\u00E9truire le jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classes partag\u00E9es.
SHRC303=Echec de la cr\u00E9ation du cache imbriqu\u00E9 "%s"
SHRC664=Echec de la correction d'erreur \: impossible de d\u00E9truire le jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classes partag\u00E9es. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire le jeu de s\u00E9maphores.
SHRC302=Impossible d'augmenter la taille du cache imbriqu\u00E9 "%s". Echec de l'allocation d'un bloc pour des informations.
SHRC663=Correction d'erreur \: un jeu de s\u00E9maphores d\u00E9truit portant l'id\=%d est associ\u00E9 \u00E0 un cache de classes partag\u00E9es.
SHRC301=Impossible d'augmenter la taille du cache imbriqu\u00E9 "%s". Echec de l'allocation d'un nouveau cache pour des informations.
SHRC662=Correction d'erreur \: un jeu de s\u00E9maphores d\u00E9truit est associ\u00E9 \u00E0 un cache de classes partag\u00E9es.
SHRC300=Le cache des classes partag\u00E9es est utilis\u00E9 par une autre machine JVM. Impossible d'augmenter la m\u00E9moire du cache imbriqu\u00E9.
SHRC661=La machine virtuelle Java n'a pas pu associer l'ID de la m\u00E9moire partag\u00E9e id\=%d avec le cache de classe partag\u00E9.
SHRC660=La machine virtuelle Java n'a pas pu associer l'ID du jeu de s\u00E9maphores id\=%d avec le cache de classe partag\u00E9.
VMUT013=Fichier d'options %s non valide
SHRC659=Une erreur s'est produite lors de l'ouverture de la m\u00E9moire partag\u00E9e
VMUT012=%2$.*1$s n'est pas une superinterface directe de %4$.*3$s.
SHRC658=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations du fichier de cache partag\u00E9.
VMUT011=Allocation de m\u00E9moire impossible pour le tableau d'options de ligne de commande
SHRC657=La machine virtuelle Java n'autorise pas l'acc\u00E8s au fichier de cache partag\u00E9 parce que l'ID d'utilisateur et de groupe du processus JVM sont diff\u00E9rents de ceux du propri\u00E9taire du fichier de cache partag\u00E9 et que l'ID utilisateur du processus JVM n'appartient pas au groupe du propri\u00E9taire du fichier de cache partag\u00E9.
VMUT010=Valeur d'option incorrectement form\u00E9e ; l'option "%1$s%3$.*2$s" contient des caract\u00E8res de fin "%4$s" qui ont \u00E9t\u00E9 ignor\u00E9s.
SHRC656=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der au fichier de cache partag\u00E9. Pour la connexion au cache de classe partag\u00E9e, utilisez la sous-option 'groupAccess'.
SHRC655=Le cache est accessible pour l'utilisateur en cours \= %s
SHRC654=La machine virtuelle Java n'autorise pas l'acc\u00E8s \u00E0 la r\u00E9gion de m\u00E9moire partag\u00E9e du cache partag\u00E9 cr\u00E9\u00E9 et poss\u00E9d\u00E9 par un autre utilisateur ne faisant pas partie de son groupe.
SHRC653=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der \u00E0 la m\u00E9moire partag\u00E9e associ\u00E9e au cache de classe partag\u00E9e non permanent. Pour la connexion au cache de classe partag\u00E9e non permanent, utilisez les sous-options 'groupAccess' et 'readonly'.
SHRC652=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der \u00E0 la m\u00E9moire partag\u00E9e associ\u00E9e au cache de classe partag\u00E9e non permanent. Pour la connexion au cache de classe partag\u00E9e non permanent, utilisez la sous-option 'groupAccess'.
SHRC651=L'ID utilisateur effectif du processus d\u00E9tect\u00E9 par la machine virtuelle Java est le propri\u00E9taire et non le cr\u00E9ateur de la m\u00E9moire partag\u00E9e associ\u00E9e au cache partag\u00E9. La machine virtuelle Java ne se connectera pas au cache partag\u00E9 pour emp\u00EAcher l'acc\u00E8s non intentionnel au cache partag\u00E9.
SHRC650=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations de la m\u00E9moire partag\u00E9e associ\u00E9e au cache partag\u00E9.
VMUT009=Valeur incorrectement form\u00E9e pour -Xservice
VMUT008=Valeur incorrectement form\u00E9e pour IBM_JAVA_OPTIONS
VMUT007=Valeur incorrectement form\u00E9e pour JAVA_TOOL_OPTIONSS
VMUT006=Option incorrectement form\u00E9e %s d\u00E9tect\u00E9e dans -Xoptionsfile
VMUT005=Option trop \u00E9lev\u00E9e \: '%s'
VMUT004=Option incorrectement form\u00E9e \: '%s'
VMUT003=Fichier des options introuvable
SHRC649=La machine virtuelle Java n'autorise pas l'acc\u00E8s au jeu de s\u00E9maphores du cache partag\u00E9 cr\u00E9\u00E9 et poss\u00E9d\u00E9 par un autre utilisateur ne faisant pas partie de son groupe.
VMUT002=(erreur d'acc\u00E8s)
SHRC648=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der au jeu de s\u00E9maphores associ\u00E9 au cache de classe partag\u00E9e non permanent. Pour la connexion au cache de classe partag\u00E9e non permanent, utilisez la sous-option 'groupAccess'.
VMUT001=(unit\u00E9 d'ex\u00E9cution sans nom)
SHRC647=L'ID utilisateur effectif du processus d\u00E9tect\u00E9 par la machine virtuelle Java est le propri\u00E9taire et non le cr\u00E9ateur du jeu de s\u00E9maphores associ\u00E9 au cache partag\u00E9. La machine virtuelle Java ne se connectera pas au cache partag\u00E9 pour emp\u00EAcher l'acc\u00E8s non intentionnel au cache partag\u00E9.
VMUT000=(m\u00E9moire insuffisante)
SHRC646=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations du jeu de s\u00E9maphores associ\u00E9 au cache partag\u00E9.
SHRC645=Activer le mode diagnostic mprotect
SHRC644=La machine virtuelle Java s'est connect\u00E9e au cache de classe partag\u00E9e cr\u00E9\u00E9 en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic). L'option -Xshareclasses\:mprotect\=none sera ignor\u00E9e.
SHRC643=La machine virtuelle Java s'est connect\u00E9e au cache de classe partag\u00E9e cr\u00E9\u00E9 en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic). L'utilisation du cache dans ce mode peut avoir une incidence sur les performances.
SHRC642=La machine virtuelle Java a cr\u00E9\u00E9 le cache de classe partag\u00E9e en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic). L'utilisation du cache dans ce mode peut avoir une incidence sur les performances.
SHRC641=La machine virtuelle Java tente d'utiliser le cache de classe partag\u00E9e existant en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic), mais le cache n'effectuait pas la cr\u00E9ation dans ce mode. Dans ce cas, l'option mprotect\=diagnostic est ignor\u00E9e sous z/OS.
SHRC640=La machine virtuelle Java utilise le cache de classe partag\u00E9e existant en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic), mais le cache n'effectuait pas la cr\u00E9ation dans ce mode. L'utilisation du cache dans ce mode peut avoir une incidence sur les performances.
SMAP005=
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP000=
J9GC086=Echec de l'instanciation des m\u00E9tadonn\u00E9es des r\u00E9f\u00E9rences compress\u00E9es ; %1$zu%2$s demand\u00E9
J9GC085=taille initiale des m\u00E9tadonn\u00E9es des r\u00E9f\u00E9rences compress\u00E9es
SHRC639=Seules les options d'utilitaire de cache partag\u00E9 peuvent \u00EAtre utilis\u00E9es en combinaison avec -Xmt. Placez d'autres options de cache partag\u00E9 dans le fichier javad.options.
J9GC084=La r\u00E9solution de l'horloge du syst\u00E8me d'exploitation ne semble pas prendre en charge le temps de pause cible demand\u00E9.  Substitution \u00E0 l'aide de l'option de ligne de commande -Xgc\:overrideHiresTimerCheck
SHRC638=La cr\u00E9ation de cache \u00E0 l'aide de l'option cacheRetransformed force le mode disableBCI.
J9GC083=Echec de l'initialisation ; la location multiple ne prend en charge que  -Xgcpolicy\:balanced
SHRC637=La sous-option -Xshareclasses\:cacheRetransformed est incompatible avec un cache partag\u00E9 existant activ\u00E9 par BCI.
J9GC082=La taille demand\u00E9e pour la taille de page %1$s %2$zu%3$s%4$s n'est pas une taille prise en charge ; %5$zu%6$s%7$s utilis\u00E9 \u00E0 la place
SHRC636=La sous-option "disableBCI" est incompatible avec le cache partag\u00E9 existant activ\u00E9 par BCI.
J9GC081=Des virgules suppl\u00E9mentaires sont d\u00E9tect\u00E9es dans l'option '-Xlp' ; elles sont ignor\u00E9es
SHRC635=Stocker le fichier classe interm\u00E9diaire \= true
J9GC080=La configuration syst\u00E8me ne prend pas en charge le param\u00E8tre '%.*s' dans l'option '-Xlp'
SHRC634=L'option "-XX\:-StoreIntermediateClassfile" a \u00E9t\u00E9 sp\u00E9cifi\u00E9e, mais le cache existant a \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de l'option "-XX\:+StoreIntermediateClassfile".
SHRC633=L'option "-XX\:+StoreIntermediateClassfile" a \u00E9t\u00E9 sp\u00E9cifi\u00E9e, mais le cache existant n'a pas \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de l'option "-XX\:+StoreIntermediateClassfile".
SHRC632=L'espace r\u00E9serv\u00E9 pour les donn\u00E9es JIT dans le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscminjitdata pour augmenter l'espace r\u00E9serv\u00E9 pour les donn\u00E9es JIT.
SHRC631=L'espace r\u00E9serv\u00E9 pour les donn\u00E9es AOT dans le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscminaot pour augmenter l'espace r\u00E9serv\u00E9 pour les donn\u00E9es AOT.
SHRC630=Espace satur\u00E9 pour le stockage de donn\u00E9es non AOT/non JIT, telles que des classes, dans le cache partag\u00E9 "%s".
J9GC079=L'option '%1$s' n'est pas compl\u00E8te ; le param\u00E8tre '%2$s' doit \u00EAtre sp\u00E9cifi\u00E9.
J9GC078='%1$s' n'est pas sp\u00E9cifi\u00E9 comme premier param\u00E8tre dans l'option '%2$s'
J9GC077=La configuration syst\u00E8me ne prend pas en charge la taille de page volumineuse %1$zu%2$s %3$s demand\u00E9e
J9GC076=La configuration syst\u00E8me ne prend pas en charge la taille de page volumineuse %1$zu%2$s demand\u00E9e
J9GC075=Une erreur s'est produite lors de l'analyse syntaxique de l'option '-Xlp'
SHRC629=Le fichier de contr\u00F4le de m\u00E9moire partag\u00E9e est en lecture seule.
J9GC074=La taille de page volumineuse %1$zu%2$s %3$s n'est pas une taille prise en charge, %4$zu%5$s %6$s utilis\u00E9 \u00E0 la place.
SHRC628=Le fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas lisible.
J9GC073=La taille de page volumineuse %1$zu%2$s %3$s  n'est pas une taille prise en charge, %4$zu%5$s utilis\u00E9 \u00E0 la place.
SHRC627=La re-cr\u00E9ation d'un fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas autoris\u00E9e lors de l'ex\u00E9cution en mode lecture seule.
J9GC072=La taille de page volumineuse %1$zu%2$s n'est pas une taille prise en charge ; %3$zu%4$s %5$s utilis\u00E9 \u00E0 la place.
SHRC626=Impossible d'obtenir les statistiques du cache partag\u00E9 car aucun cache partag\u00E9 valide n'existe.
J9GC071=La valeur de '%s' n'est pas correcte
SHRC625=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. La recherche de la taille de m\u00E9moire partag\u00E9e a \u00E9chou\u00E9.
J9GC070=Echec du d\u00E9marrage du r\u00E9cup\u00E9rateur de place
SHRC624=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. La recherche d'ID utilisateur a \u00E9chou\u00E9.
SHRC623=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. La recherche d'ID groupe a \u00E9chou\u00E9.
SHRC622=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. Non concordance de cl\u00E9 de m\u00E9moire partag\u00E9e.
SHRC621=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. Non concordance d'ID m\u00E9moire partag\u00E9e.
SHRC620=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. Le fichier de contr\u00F4le est endommag\u00E9.
J9GC069=Echec de l'initialisation de l'unit\u00E9 d'ex\u00E9cution Finalize
J9GC068=ScopedMemory.join/joinAndEnter interrupted
J9GC067=Echec de l'instanciation du segment de m\u00E9moire partag\u00E9 \: %1$s (nouvelle taille %2$zu%3$s, ancienne taille %4$zu%5$s)
J9GC066=La g\u00E9om\u00E9trie n\u00E9cessaire de segment de m\u00E9moire partag\u00E9 n'a pas pu \u00EAtre allou\u00E9e
J9GC065=Echec de l'allocation du nouvel espace
SHRC619=Le fichier de contr\u00F4le de s\u00E9maphore est en lecture seule.
J9GC064=Echec d'allocation de l'ancien espace
SHRC618=Le fichier de contr\u00F4le de s\u00E9maphore n'est pas lisible.
J9GC063=Impossible d'ouvrir le fichier '%s' en \u00E9criture
SHRC617=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Marqueur de s\u00E9maphore introuvable dans le jeu de s\u00E9maphores
J9GC062=La valeur %s doit \u00EAtre une puissance de deux
SHRC616=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Non concordance du nombre de s\u00E9maphores dans le jeu de s\u00E9maphores.
J9GC061=taille maximale espace m\u00E9moire sectoris\u00E9e
SHRC615=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Non concordance de cl\u00E9 s\u00E9maphore.
J9GC060=taille espace m\u00E9moire p\u00E9renne
SHRC614=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Non concordance d'ID s\u00E9maphore.
SHRC613=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Le fichier de contr\u00F4le est endommag\u00E9.
SHRC612=Cl\u00E9 de stockage (0-15) artificiellement d\u00E9finie sur z/OS \u00E0 des fins de test.
SHRC611=La sous-option "disableBCI" est sp\u00E9cifi\u00E9e, mais le cache existant a \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de la sous-option "enableBCI".
SHRC610=D\u00E9sactivez le support d'instrumentation de byte-code.
J9GC059=-Xgcpolicy\:metronome n'est pas autoris\u00E9 sans l'option -Xrealtime
J9GC058=Echec de l'allocation de l'espace m\u00E9moire p\u00E9renne
J9GC057=%1$s ne doit pas \u00EAtre sup\u00E9rieur \u00E0 %2$s
J9GC056=tailles des pages volumineuses disponibles \:
J9GC055=taille des pages volumineuses
SHRC609=%1$s donn\u00E9es jointes mises \u00E0 jour %2$s pour %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC054=La taille de page volumineuse %1$zu%2$s n'est pas une taille prise en charge, %3$zu%4$s utilis\u00E9 \u00E0 la place.
SHRC608=%1$s donn\u00E9es jointes trouv\u00E9es %2$s pour %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC053=m\u00E9moire maximale
SHRC607=%1$s donn\u00E9es jointes stock\u00E9es %2$s pour  %8$.*7$s.%4$.*3$s%6$.*5$s
J9GC052=incr\u00E9ment de segment des classes ROM
SHRC606=Ajoutez des suggestions JIT non fonctionnelles aux m\u00E9thodes \u00E0 des fins de test ; \u00E0 utiliser avec -Xint et un cache pr\u00E9-rempli.
J9GC051=incr\u00E9ment de segment des classes RAM
SHRC605=La taille de m\u00E9moire pour "%s" est trop \u00E9lev\u00E9e ou sp\u00E9cifie des unit\u00E9s autres que 'K','M' ou 'G'.
J9GC050=m\u00E9moire maximale approximable
SHRC604=<taille> octets de r\u00E9serve de l'espace cache pour les donn\u00E9es de classe brute
SHRC603=Octets de donn\u00E9es de classe brute utilis\u00E9s     %*c\= %lu
SHRC602=%% de zone de donn\u00E9es de classe brute utilis\u00E9     %*c\= %lu%%
SHRC601=Taille de zone de donn\u00E9es de classe brute    %*c\= %lu
SHRC600=La zone de donn\u00E9es de classe brute est endommag\u00E9e car le stockage de %u octets d\u00E9passe l'espace disponible de la zone disponible ('d\u00E9but d'espace disponible'\=%p, 'fin d'espace disponible'\=%p).
J9GC049=taille d\u00E9finie enregistr\u00E9e
J9GC048=incr\u00E9ment d'ancien espace
J9GC047=taille maximale d'ancien espace
J9GC046=taille initiale d'ancien espace
J9GC045=taille initiale de m\u00E9moire
J9GC044=taille maximale de nouvel espace
J9GC043=taille initiale de nouvel espace
J9GC042=La somme de %1$s et %2$s est trop petite pour %3$s
J2JX099=Option(s) incompl\u00E8te(s) sur la ligne de commande. La premi\u00E8re \u00E9tait \: %s
J9GC041=Type fvtest inconnu \: %s
J2JX098=Argument [%1$s] non valide pour l'option \: %2$s
J9GC040=Option inconnue \: %s
J2JX097=Option(s) non identifi\u00E9e(s) sur la ligne de commande. La premi\u00E8re \u00E9tait \: %s
J2JX096=Impossible de trouver la fonction j9bcv_verifyCreateStackAttributes
J2JX095=Impossible de trouver la fonction j9bcv_verifyClassStructure
J2JX094=Echec de l'ouverture du v\u00E9rificateur de DLL %1$s \: %2$s
J2JX093=Aucun fichier de classe indiqu\u00E9 sur la ligne de commande
J2JX092=Erreur interne li\u00E9e \u00E0 la machine virtuelle nouvellement cr\u00E9\u00E9e
J2JX091=Cr\u00E9ation de la machine virtuelle Java r\u00E9ussie
J2JX090=Tentative de cr\u00E9ation d'une machine virtuelle Java utilisable avec AOT
J9GC039=*** %1$s obsol\u00E8te \: pr\u00E9f\u00E9rez %2$s ***
J9GC038=La valeur %s indiqu\u00E9e est trop \u00E9lev\u00E9e
J9GC037=%1$s n'est pas pris en charge avec des valeurs autres que %2$zu
J9GC036=La valeur de %1$s doit \u00EAtre sup\u00E9rieure \u00E0 %2$zu
J9GC035=%s doit \u00EAtre suivi d'une valeur num\u00E9rique
J9GC034=La valeur de %1$s doit \u00EAtre comprise de %2$zu \u00E0 %3$zu
J9GC033=La valeur de %1$s doit \u00EAtre comprise entre %2$.2f et %3$.2f (inclus)
J9GC032=La configuration syst\u00E8me ne prend pas en charge l'option '%s'
J2JX089=Erreur interne \: %1$s introuvable dans %2$s
J9GC031='%1$s' et '%2$s' sont incompatibles
J2JX088=Erreur interne \: \u00E9chec de l'ouverture de %1$s \: %2$s
J9GC030=La valeur %1$s de %2$.2f doit \u00EAtre au moins %3$s inf\u00E9rieure \u00E0 la valeur %4$s de %5$.2f
J2JX087=Erreur interne \: impossible de d\u00E9terminer le nom de l'ex\u00E9cutable
J2JX086=%1$i enregistr\u00E9s dans le fichier de symboles %2$s
J2JX085=Erreur interne \: code erreur non pris en charge \u00E0 partir de create rom class %d
J2JX084=Fermeture d'un segment %d et d\u00E9marrage d'un nouveau segment
J2JX083=Inclusion de  %s dans AOT
J2JX082=Exclusion de %s de AOT
J2JX081=Erreur \: %s
J2JX080=Erreur de v\u00E9rification dans la m\u00E9thode %1$i (%3$.*2$s%5$.*4$s) pour le PC %6$i
J9GC029=Erreur d'option \: '%s'
J9GC028=Option trop \u00E9lev\u00E9e \: '%s'
J9GC027=Option incorrectement form\u00E9e \: '%s'
J9GC026=-Xverbosegclog n'a pas r\u00E9ussi \u00E0 allouer des structures internes
J9GC025=Somme de %1$s et %2$s
J9GC024=La somme de %1$s et de %2$s est trop \u00E9lev\u00E9e pour le segment
J9GC023=La somme de %1$s et de %2$s doit \u00EAtre \u00E9gale \u00E0 %3$s
J9GC022=La somme de %1$s et de %2$s est trop \u00E9lev\u00E9e pour %3$s
J2JX079=Erreur \: %1$s \u00E0 %2$i
J9GC021=La taille de %1$s doit \u00EAtre \u00E9gale \u00E0 %2$s
J2JX078=Action recommand\u00E9e \:
J9GC020=Taille de %s trop \u00E9lev\u00E9e pour le segment
J2JX077=Fichier de classe incorrect
J2JX076=Fichier de classe incorrect \: %s
J2JX075=Nom d'entr\u00E9e trop long \: %s
J2JX074=Tentative d'ajour d'une entr\u00E9e en double au JXE \: %s
J2JX073=Traitement du fichier \: %s
J2JX072=Impossible d'ouvrir le r\u00E9pertoire %s
J2JX071=Traitement du r\u00E9pertoire \: %s
J2JX070=augmentation de l'espace \: %i octets
J9GC019=Taille de %1$s trop \u00E9lev\u00E9e pour %2$s
J9GC018=Taille de %1$s trop faible pour %2$s
J9GC017=Taille de %1$s trop faible, taille minimale requise \: %2$zu %3$so
J9GC016=Echec de l'allocation du segment survivant dans l'espace m\u00E9moire par d\u00E9faut
J9GC015=Echec de l'allocation de l'espace m\u00E9moire par d\u00E9faut
J9GC014=Echec de l'allocation des segments de m\u00E9moire des classes de la machine virtuelle
J9GC013=Echec de l'allocation des segments de m\u00E9moire des objets de la machine virtuelle
J9GC012=Echec de l'allocation des segments de m\u00E9moire de la machine virtuelle
J2JX069=taille m\u00E9moire estim\u00E9e \: %i octets
J9GC011=Echec de l'initialisation du pool d'espaces m\u00E9moire
J2JX068=taille de fichier \: %i octets
J9GC010=Echec de l'initialisation de la gestion de la finalisation
J2JX067=Aucune classe valide trouv\u00E9e dans %s
J2JX066=Impossible d'ouvrir le fichier \: %s
J2JX065=Erreur de fermeture du fichier zip \: %s
J2JX064=Les valeurs valides de l'option -precompileTarget sont \:
J2JX063=Valeurs par d\u00E9faut \:
J2JX062=classfile(s)                les fichiers se terminant par .class, .jar ou .zip\n                             seront examin\u00E9s et ajout\u00E9s au jxe\n
J2JX061=Options de compilation AOT \:\n   -[no]precompile           [ne pas] marquer toutes les m\u00E9thodes pour pr\u00E9-compilation\n   -[no]precompileMethod xxx [ne pas] marquer les m\u00E9thodes nomm\u00E9es pour pr\u00E9-compilation\n   -[no]compileAheadOfTime   compiler \u00E0 l'avance la m\u00E9thode marqu\u00E9e\n   -precompileTarget xxx     g\u00E9n\u00E9rer un jxe pour l'architecture et le syst\u00E8me d'exploitation cible xxx\n   -precompileOptions xxx    transmettre  xxx au moteur de pr\u00E9-compilation\n   -[no]precompileResolve    [ne pas] tenter de r\u00E9soudre les r\u00E9f\u00E9rences externes lors de la pr\u00E9-compilation\n   -[no]stripBytecode        [ne pas] effectuer un strip sur le bytecode pour les m\u00E9thodes compil\u00E9es aot\n
J2JX060=\  -j2se                     utilisez cette option si vous utilisez jar2jxe dans un environnement Java SE\n
J9GC009=Echec de l'initialisation du mutex pour les statistiques du r\u00E9cup\u00E9rateur de place
J9GC008=Echec de l'initialisation des extensions de module
J9GC007=Echec de l'initialisation, impossible d'analyser la ligne de commande
J9GC006=Echec de l'initialisation, m\u00E9moire satur\u00E9e
J9GC005=Echec de l'initialisation
J9GC004=Echec de l'instanciation du r\u00E9cup\u00E9rateur de place global
J9GC003=Echec de l'instanciation du r\u00E9partiteur de t\u00E2ches
J9GC002=Echec de l'instanciation du segment. %1$zu%2$s demand\u00E9
J2JX059=\  -[no]tools                le r\u00E9pertoire des outils est [n'est pas] ajout\u00E9 \u00E0 la liste des r\u00E9pertoires d'extensions
J9GC001=Echec de l'instanciation du segment
J2JX058=\  -padJxe                   adjoindre le jxe avec xxx octets suppl\u00E9mentaires
J9GC000=Erreur interne, m\u00E9moire satur\u00E9e
J2JX057=\  -[no]segmented            [ne pas] g\u00E9n\u00E9rer des jxe \u00E0 segments multiples\n   -maxSegmentSize xxx       taille maximale des jxe segment\u00E9s (nombre hexad\u00E9cimal)\n   -maxSegmentSize seg\=xxx   taille maximale d'un jxe segment\u00E9 pr\u00E9cis (nombre hexad\u00E9cimal)\n   -locate xxx               localiser l'image \u00E0 l'adresse xxx (nombre hexad\u00E9cimal)\n   -locate seg\=xxx           localiser l'image d'un segment \u00E0 l'adresse hexad\u00E9cimale xxx
J2JX056=\  -fileExtension xxx        consid\u00E9rer les fichiers termin\u00E9s par .xxx comme des fichiers .jar
J2JX055=\  -vmOption xxx             utiliser vmOption xxx lors de l'ex\u00E9cution de jxe
J2JX054=\  -versionName xxx          d\u00E9finir le nom de version de jxe sur xxx
J2JX053=\  -description xxx          d\u00E9finir la description du jxe sur xxx
J2JX052=\  -uuid xxx                 d\u00E9finir l'UUID du jxe sur xxx
J2JX051=\  -D xxx\=yyy                d\u00E9finir la propri\u00E9t\u00E9 syst\u00E8me xxx sur yyy
J2JX050=\  -startupClass xxx         d\u00E9finir la classe de d\u00E9marrage en xxx\n   -noStartupClass           indiquer que le jxe ne poss\u00E8de pas de classe de d\u00E9marrage
J2JX049=\  -srcDir xxx               inclure tous les fichiers de l'arborescence de r\u00E9pertoires xxx
J2JX048=\  -outputFormat xxx         d\u00E9finir le format de sortie sur xxx (c, bin ou jar)
J2JX047=\  -o xxx                    d\u00E9finir le nom de fichier de sortie de base sur xxx
J2JX046=\  -be                       g\u00E9n\u00E9rer une sortie big-endian\n   -le                       g\u00E9n\u00E9rer une sortie little-endian
J2JX045=\  -version                  imprimer la version de ce programme
J2JX044=\  -[no]profile              [ne pas] g\u00E9n\u00E9rer un fichier .prf pour le profilage
J2JX043=
J2JX042=\  -[no]verify               [ne pas] v\u00E9rifier le format de fichier de classe
J2JX041=\  -q                        mode silencieux\n   -[no]logo                 [ne pas] imprimer le message de copyright\n   -verbose                  mode prolixe
J2JX040=Syntaxe \:\t%s [options] fichier(s) de classe\n\n[options]\n   -help, -?                 imprimer la syntaxe
VERB036=taille initiale des m\u00E9tadonn\u00E9es des r\u00E9f\u00E9rences compress\u00E9es
VERB035=tailles des pages volumineuses disponibles pour le cache de code JIT \:
VERB034=taille des pages volumineuses pour le cache de code JIT
VERB033=espace cache de classes partag\u00E9es max autoris\u00E9 pour les donn\u00E9es JIT
VERB032=espace cache de classes partag\u00E9es min r\u00E9serv\u00E9 pour les donn\u00E9es JIT
VERB031=espace cache de classes partag\u00E9es r\u00E9serv\u00E9 pour les attributs de d\u00E9bogage des classes
VERB030=cache de classes partag\u00E9es max autoris\u00E9 pour JIT
J2JX039=IBM est une marque d'IBM Corp.\nJava ainsi que toutes les marques et logos incluant Java\n sont des marques de Sun Microsystems, Inc.
J2JX038=El\u00E9ments sous licence - Propri\u00E9t\u00E9 d'IBM
J2JX037=
J2JX036=Cible \: %s\n
J2JX035=(c) Copyright IBM Corp. 1991, 2005  All Rights Reserved
J2JX034=J9 Java JAR to JXE, Version %s
J2JX033=Erreur interne \: \u00E9chec de la compilation de la classe rom d'erreurs
J2JX032=Nombre impair de guillemets dans la liste de param\u00E8tres
J2JX031=Lecture du fichier JAR termin\u00E9 \: %s
J2JX030=Erreur de lecture de %1$s \u00E0 partir de %2$s
VERB029=cache de classes partag\u00E9es min r\u00E9serv\u00E9 pour JIT
VERB028=Pile d\u00E9taill\u00E9e \: Impossible d'imprimer les informations de la pile pour les unit\u00E9s d'ex\u00E9cution actuellement en cours d'ex\u00E9cution
VERB027=Pile d\u00E9taill\u00E9e \: L'unit\u00E9 d'ex\u00E9cution en cours d'ex\u00E9cution "%2$.*1$s" utilise %3$zd/%4$zd octets sur les piles Java/C
VERB026=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (endian JXE oppos\u00E9 non pris en charge)
VERB025=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (en-t\u00EAte d'image JXE corrompu)
VERB024=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (rom.classes manquant pour JXE)
VERB023=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (erreur inconnue)
VERB022=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (type de fichier inconnu)
VERB021=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (type de fichier non pris en charge)
VERB020=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (fichier corrompu)
J2JX029=Traitement en cours \: %s
J2JX028=Erreur de lecture de l'entr\u00E9e \u00E0 partir de %s
J2JX027=Impossible d'ouvrir ou de lire %s
J2JX026=le segment %d ne correspond pas \u00E0 la taille de segment maximale requise
J2JX025=Tentative d'ajout de la classe en double \u00E0 JXE %s
J2JX024=fichier de classe ajout\u00E9 \: %s
J2JX023=tentative d'ajout du fichier de classe %s en cours
J2JX022=%s incorrect
J2JX021=Impossible de charger %1$s \: %2$s
J2JX020=Taille de ncpRef [%1$x] passant de %2$u \u00E0 %3$u entr\u00E9es
CFRE138=L'attribut Classfile fait r\u00E9f\u00E9rence \u00E0 une entr\u00E9e de pool de constantes inexistante
CFRE137=La classe comporte plus d'un attribut RuntimeVisibleTypeAnnotations ou RuntimeInvisibleTypeAnnotations
CFRE136=modificateurs non autoris\u00E9s pour la m\u00E9thode de l'interface
CFRE135=Le nom du param\u00E8tre de la m\u00E9thode n'est pas UTF8
CFRE134=Le param\u00E8tre de m\u00E9thode a un indicateur non valide.
CFRE133=La m\u00E9thode comporte deux attributs MethodParameters
CFRE132=type_annotation target_type non reconnu
CFRE131=L'attribut BootstrapMethods requis par invokedynamic est absent ou trop petit
CFRE130=plusieurs attributs BootstrapMethods
VERB019=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (\u00E9chec lecture fichier)
VERB018=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (\u00E9chec E-S fichier)
VERB017=cache de classes partag\u00E9es max autoris\u00E9 pour AOT
VERB016=cache de classes partag\u00E9es min r\u00E9serv\u00E9 pour AOT
VERB015=taille du cache des classes partag\u00E9es
VERB014=m\u00E9moire maximale
VERB013=incr\u00E9ment de segment des classes ROM
VERB012=incr\u00E9ment de segment des classes RAM
VERB011=taille de pile des unit\u00E9s d'ex\u00E9cution Java
VERB010=taille maximale de pile des unit\u00E9s d'ex\u00E9cution Java
J2JX019=Taille de la m\u00E9moire tampon [%1$x] passant de %2$u \u00E0 %3$u
J2JX018=Cr\u00E9ation de %s r\u00E9ussie
J2JX017=Echec de l'\u00E9criture de donn\u00E9es vers le fichier \: %s
J2JX016=Echec de cr\u00E9ation/effacement de fichier \: %s
J2JX015=Code erreur inconnu \: %d
J2JX014=Echec de l'initialisation d'AOT
J2JX013=Erreur interne \: \u00E9chec d'inversion de l'ordre des octets
J2JX012=UUID fourni incorrect
J2JX011=Erreur interne \: entr\u00E9e ZIP ouverte
J2JX010=Erreur interne \: \u00E9chec de la lecture
CFRE129=entr\u00E9e de pool de constantes non valide dans les fichiers classe pour les version ant\u00E9rieures \u00E0 la version 51.0
CFRE128=Signature methodtype non valide
CFRE127=L'index de m\u00E9thode d'amorce doit faire r\u00E9f\u00E9rence \u00E0 une entr\u00E9e de pool de constantes MethodHandle
CFRE126=Les emplacements r\u00E9serv\u00E9s pour le bytecode invokedynamic ne sont pas \u00E9gaux \u00E0 z\u00E9ro
CFRE125=Le bytecode invokedynamic doit r\u00E9f\u00E9rencer une entr\u00E9e de pool de constantes InvokeDynamic
CFRE124=la balise de valeur de l'\u00E9l\u00E9ment d'annotation n'est pas valide
CFRE123=Les constantes MethodHandle doivent faire r\u00E9f\u00E9rence \u00E0 une zone ou \u00E0 une r\u00E9f\u00E9rence de m\u00E9thode
CFRE122=La classe doit \u00EAtre au au maximum publique ou un module
CFRE121=nom de zone non admis
CFRE120=les codes d'op\u00E9ration jsr et jsr_w ne sont pas valides dans les fichiers classe avec les versions >\= 51.0
VERB009=incr\u00E9ment de pile des unit\u00E9s d'ex\u00E9cution Java
VERB008=taille initiale de pile des unit\u00E9s d'ex\u00E9cution Java
VERB007=taille de pile d'unit\u00E9s d'ex\u00E9cution du syst\u00E8me d'exploitation
VERB006=Echec de l'initialisation
VERB005=Erreur \: Nom de fichier manquant pour -Xverbosegclog
VERB004=Erreur \: Le nombre de cycles associ\u00E9 \u00E0 -Xverbosegclog doit \u00EAtre positif
VERB003=Erreur \: Le nombre de fichiers associ\u00E9 \u00E0 -Xverbosegclog doit \u00EAtre positif
VERB002=Pile d\u00E9taill\u00E9e \: L'utilisation maximale des piles Java/C \u00E9tait de  %1$zd/%2$zd octets
VERB001=
VERB000=Pile d\u00E9taill\u00E9e \: "%2$.*1$s" a utilis\u00E9 %3$zd/%4$zd octets sur les piles Java/C
J2JX009=Erreur interne \: \u00E9chec de la recherche
J2JX008=Erreur interne \: aucune entr\u00E9e
J2JX007=Erreur interne \: entr\u00E9e en double
J9VM099=-Xlog\:none              D\u00E9sactive les options de journal de la machine virtuelle Java sp\u00E9cifi\u00E9es pr\u00E9c\u00E9demment, y compris les valeurs par d\u00E9faut.
J2JX006=M\u00E9moire satur\u00E9e
J9VM098=-Xlog\:help              Imprime l'aide -Xlog de la machine virtuelle Java.
J2JX005=Erreur interne \: tailles diff\u00E9rentes
J9VM097=\nSyntaxe \:\n
J2JX004=Erreur interne \: CRC diff\u00E9rents
J9VM096=-Xscdmx n'est pas pris en compte en l'absence de -Xshareclasses
J2JX003=Erreur interne \: argument de fonction incorrect
J9VM095=violation de contrainte de chargement lors de la r\u00E9solution de la m\u00E9thode "%2$.*1$s.%4$.*3$s%6$.*5$s" \: le chargeur "%8$.*7$s@%9$x" de la classe "%11$.*10$s" et le chargeur "%13$.*12$s@%14$x" de la classe "%16$.*15$s" ont des types diff\u00E9rents pour la signature de m\u00E9thode
J2JX002=%1$d m\u00E9thode(s) sur %2$d pr\u00E9compil\u00E9e(s) pour la cible %3$s.
J9VM094=L'unit\u00E9 d'ex\u00E9cution "%s" est toujours active apr\u00E8s avoir ex\u00E9cut\u00E9 les unit\u00E9s d'ex\u00E9cution de fermeture.
J2JX001=Ressource stock\u00E9e \: %s
J9VM093=Cette version de Java n\u00E9cessite une unit\u00E9 centrale prenant en charge les extensions SSE2 ou sup\u00E9rieures.  Consultez la rubrique relative aux environnements pris en charge dans le manuel IBM Java User Guide pour obtenir des d\u00E9tails.
J2JX000=Tentative d'ajout de fichier de ressources [%s] en double, fichier ignor\u00E9.
J9VM092=Cr\u00E9ation adaptative prise en charge
J9VM091=Cr\u00E9ation adaptative prise en charge
TRCE019=Initialisation incorrecte du moteur de trace ; CR \= %d
J9VM090=R\u00E9ponse lente \u00E0 la demande r\u00E9seau (%d secs), v\u00E9rifiez la configuration IP DNS
TRCE018=Impossible d'allouer une cl\u00E9 de m\u00E9moire locale d'unit\u00E9 d'ex\u00E9cution UTE
CFRE119=plusieurs attributs SourceFile
TRCE017=Impossible d'allouer une cl\u00E9 de m\u00E9moire locale d'unit\u00E9 d'ex\u00E9cution RAS
CFRE118=octets suppl\u00E9mentaires apr\u00E8s EOF
TRCE016=Stockage pour RasGlobalStorage non disponible ; trace non activ\u00E9e
CFRE117=champ ne peut \u00EAtre que final ou volatile
TRCE015=Erreur d'enregistrement de l'abonn\u00E9 d'\u00E9criture de trace
CFRE116=le bytecode d'invoke doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment Methodref
TRCE014=Echec de l'initialisation du moteur de trace ; trace non activ\u00E9e
CFRE115=dimensions de tableau > 255
TRCE013=Consignation des informations de comptage de trace dans %s
CFRE114=nom de champ non valide
TRCE012=Impossible d'ouvrir le fichier de compteur de trace %s ; compteurs redirig\u00E9s vers stderr.
CFRE113=EOF inattendu
TRCE011=Module non configur\u00E9 pour la trace \: %s
CFRE112=VM ne prend pas en charge la v\u00E9rification dynamique
TRCE010=Incident d'allocation de m\u00E9moire native ; reprise des param\u00E8tres de trace nodynamic.
CFRE111=UTF8 incorrect
CFRE110=constante incompatible pour le champ
J9VM089=Avertissement \: impossible de v\u00E9rifier les param\u00E8tres syscorepath en utilisant sysconfig \: %s.
J9VM088=Avertissement \: syscorepath n'a pas \u00E9t\u00E9 configur\u00E9, ce qui peut emp\u00EAcher la g\u00E9n\u00E9ration d'un fichier core syst\u00E8me (si un est n\u00E9cessaire).\n\t\tConsultez les instructions d'installation WebSphere Real Time pour configurer correctement les param\u00E8tres de configuration syscorepath.\n\t\tREMARQUE \: syscorepath doit \u00EAtre configur\u00E9 chaque fois que la machine est d\u00E9marr\u00E9e.
J9VM087=resetDumpOption n\u00E9cessite %s
J9VM086=Option trop \u00E9lev\u00E9e \: '%s'
J9VM085=Option incorrectement form\u00E9e \: '%s'
J9VM084=Erreur IFA \: code de retour inattendu %08x du service de commutation IFA
J9VM083=Erreur de basculement vers le processeur IFA ; cr \: %08x
J9VM082=Impossible de passer au processeur IFA - probl\u00E8me "extattr +a lib%s.so"
J9VM081=Valeur d'option incorrectement form\u00E9e ; l'option "%1$s%3$.*2$s" contient des caract\u00E8res de fin "%4$s" qui ont \u00E9t\u00E9 ignor\u00E9s
TRCE009=Erreur d'\u00E9criture dans le fichier snap
J9VM080=queryVmDump n\u00E9cessite %s
TRCE008=Erreur lors de la recherche dans le fichier de trace \: %s
CFRE109=signature de m\u00E9thode non valide
TRCE007=Erreur d'ouverture de la prochaine g\u00E9n\u00E9ration de fichier de trace \: %s
CFRE108=index de la m\u00E9thode de la m\u00E9thode englobante doit faire r\u00E9f\u00E9rence \u00E0 un nom et un type
TRCE006=Erreur d'\u00E9criture de %d octets dans le fichier de trace \: %s cr \: %d
CFRE107=d\u00E9calage hors plage dans le bytecode de jump
TRCE005=Erreur d'\u00E9criture d'en-t\u00EAte dans le fichier de trace \: %s
CFRE106=m\u00E9thode en double
TRCE004=Erreur d'ouverture du fichier de trace \: %s
CFRE105=superClass doit \u00EAtre une classe
TRCE003=Erreur lors du traitement de l'option de trace, d\u00E9tail \: %s
CFRE104=champ ne peut \u00EAtre que public, private ou protected
TRCE002=Erreur lors du traitement de l'option de trace \: -Xtrace\:%s\=%s
CFRE103=m\u00E9thode de type abstract ne doit pas \u00EAtre private, static, final, native, synchronized ou strict
TRCE001=Erreur lors du traitement de l'option de trace \: -Xtrace\:%s
CFRE102=signature de champ non valide
TRCE000=Option de trace non reconnue \: -Xtrace\:%s
CFRE101=d\u00E9calage hors plage dans le bytecode de switch
CFRE100=trop de dimensions demand\u00E9es dans le bytecode de multianewarray
J9VM079=triggerOneOffDump(%1$s) n\u00E9cessite %2$s
J9VM078=Valeur incorrectement form\u00E9e pour JAVA_TOOL_OPTIONS
J9VM077=Remarque \: -Xdfpbd n'a aucun impact dans cette version de Java
J9VM076=m\u00E9moire native \u00E9puis\u00E9e lors de l'allocation de l'entr\u00E9e de liste pour l'objet finalisable ou de r\u00E9f\u00E9rence
J9VM075=op\u00E9ration non admise sur l'unit\u00E9 d'ex\u00E9cution eventron
J9VM074=La classe %2$.*1$s acc\u00E8de sans autorisation \u00E0 %3$s dans la classe %5$.*4$s+
J9VM073=La classe %2$.*1$s acc\u00E8de sans autorisation au membre %3$s de la classe %5$.*4$s
J9VM072=m\u00E9moire native \u00E9puis\u00E9e
J9VM071=tentative de liaison r\u00E9cursive de la m\u00E9thode native %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM070=\u00E9puisement de la m\u00E9moire native au cours de la liaison de m\u00E9thode native %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM069=violation de contrainte de chargement \: le chargeur "%2$.*1$s@%3$x" a lanc\u00E9 pr\u00E9alablement le chargement pour un type diff\u00E9rent portant le nom "%5$.*4$s" d\u00E9fini par le chargeur "%7$.*6$s@%8$x"
J9VM068=-Xshareclasses non activ\u00E9, option -Xzero\:sharestring ignor\u00E9e
J9VM067=-Xshareclasses non activ\u00E9, option -Xzero\:sharezip ignor\u00E9e
J9VM066=type d'argument non concordant
J9VM065=cet objet n'est pas une instance de la classe d\u00E9clarante
J9VM064=setDumpOption requiert %s
J9VM063=seekDumpAgent requiert %s
J9VM062=removeDumpAgent requiert %s
J9VM061=insertDumpAgent requiert %s
J9VM060=runNamedDump(%1$s) requiert %2$s
J9VM059=-Xscmaxaot n'est pas pris en compte en l'absence de -Xshareclasses
J9VM058=-Xscminaot n'est pas pris en compte en l'absence de -Xshareclasses
J9VM057=Taille maximale de la m\u00E9moire cache du moniteur d\u00E9pass\u00E9e
J9VM056=Version sup\u00E9rieure
J9VM055=Erreur irr\u00E9m\u00E9diable \: Version majeure de JXE est diff\u00E9rente de %d
J9VM054=Echec de la cr\u00E9ation d'une unit\u00E9 d'ex\u00E9cution \: retVal %1$zd, errno %2$zd
J9VM053=Option incorrectement form\u00E9e %s d\u00E9tect\u00E9e dans -Xoptionsfile
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] d\u00E9finit la taille maximale du tableau mis en cache\n
J9VM051=Syntaxe \:\n
J9VM050=-Xjni \: option non identifi\u00E9e --> '%s'
J9VM049=Dur\u00E9es de conservation JLM non prises en charge
J9VM048=Dur\u00E9es de conservation JLM prises en charge
J9VM047=JLM non pris en charge
J9VM046=JLM pris en charge
J9VM045=Moniteurs de syst\u00E8me \u00E0 trois niveaux non pris en charge
J9VM044=Moniteurs de syst\u00E8me \u00E0 trois niveaux pris en charge
J9VM043=-----------------------
J9VM042=Configuration de l'utilisation des unit\u00E9s d'ex\u00E9cution
J9VM041=nombre d'arguments incorrect
J9VM040=d\u00E9passement de capacit\u00E9 dans la pile du syst\u00E8me d'exploitation
SHRC299=Le cache des classes partag\u00E9es "%s" n'a pas \u00E9t\u00E9 cr\u00E9\u00E9 avec l'option imbriqu\u00E9e. Impossible d'augmenter la m\u00E9moire du cache.
SHRC298=Pour ex\u00E9cuter l'utilitaire "%s" sur le cache de classes permanent "%s", utilisez la sous-option "persistent".
SHRC297=Pour pouvoir utiliser des caches de classes partag\u00E9es permanents sur AIX, affectez \u00E0 la variable d'environnement CORE_MMAP la valeur "yes"
SHRC296=L'utilisation de l'option "noCoreMmap" implique qu'IBM ne sera pas susceptible de vous aider \u00E0 r\u00E9soudre les blocages, car les donn\u00E9es de classes ne figureront pas dans les vidages syst\u00E8me.
SHRC295=D\u00E9sactivez la d\u00E9pendance sur CORE_MMAP sur AIX
SHRC294=%1$d\: 0x%2$p CHARARRAY \: \u00E0 0x%3$p.
SHRC293=Impossible d'allouer de la m\u00E9moire pour le pool d'\u00E9l\u00E9ments de table de hachage dans ROMClassResourceManager
SHRC292=Impossible d'entrer le mutex de table de hachage ROMClassResourceManager
J9VM039=-Xscmx n'est pas pris en compte en l'absence de -Xshareclasses
SHRC291=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ROMClassResourceManager
J9VM038=-Xthr \: option non identifi\u00E9e --> '%s'
SHRC290=Echec de la cr\u00E9ation de la nouvelle table de hachage dans ROMClassResourceManager
J9VM037=Echec de l'allocation du moniteur
J9VM036=division par z\u00E9ro
J9VM035=Impossible d'allouer OutOfMemoryError
J9VM034=JVMRI requiert un moteur de trace ex\u00E9cut\u00E9 avec l'option -Xtrace
J9VM033=Erreur irr\u00E9m\u00E9diable \: \u00E9chec de l'initialisation de %s
J9VM032=Erreur irr\u00E9m\u00E9diable \: impossible de charger %1$s \: %2$s
VRFY041=invokespecial d'un initialiseur incorrect
J9VM031=La classe %2$.*1$s obligatoire doit r\u00E9sider dans le chemin des classes d'amor\u00E7age mais figure dans le chemin des classes d'application dans %4$.*3$s
VRFY040=le v\u00E9rificateur n'a pas pu allouer de m\u00E9moire native
J9VM030=UTF8 incorrect dans la fonction JNI
SHRC289=Ne pas d\u00E9tecter lorsqu'un cache se trouve dans un syst\u00E8me de fichiers r\u00E9seau distant.
SHRC288=ID de m\u00E9moire partag\u00E9e   \= %d
SHRC287=Le cache permanent ne peut pas se trouver dans un syst\u00E8me de fichiers r\u00E9seau. S\u00E9lectionnez  "nonpersistent" ou un r\u00E9pertoire de caches diff\u00E9rent.
SHRC286=Cache de classes partag\u00E9es %1$s ouvert en lecture seule
SHRC285=Cache permanent de classes partag\u00E9es %1$s ouvert en lecture seule
SHRC284=Impossible de cr\u00E9er un cache en mode de lecture seule
SHRC283=Ouvrez le cache avec des droits en lecture seule
VRFY039=bytecode inconnu
SHRC282=La taille de page du syst\u00E8me d'exploitation est incompatible avec ce cache. Tentative de recr\u00E9ation du cache.
J9VM029=\tat (m\u00E9thode inconnue)
VRFY038=invokespecial sur une cible non valide
SHRC281=Tentative de destruction de tous les caches dans cacheDir %s
J9VM028=\t\u00E0 %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
VRFY037=objet non initialis\u00E9 pendant un branchement en arri\u00E8re
SHRC280=Cr\u00E9ation d'une liste de tous les caches dans cacheDir %s
J9VM027=\t\u00E0 %2$.*1$s.%4$.*3$s (%6$.*5$s)
VRFY036=pile en sous capacit\u00E9
J9VM026=\t\u00E0 %2$.*1$s.%4$.*3$s (source inconnue)
VRFY035=aucune erreur
J9VM025=\t\u00E0 %2$.*1$s.%4$.*3$s (m\u00E9thode native)
VRFY034=PC cible non valide
J9VM024=Exception dans l'unit\u00E9 d'ex\u00E9cution "%.*s"
VRFY033=champ de type non compatible
J9VM023=Ceci indique que soit JAVA_HOME est incorrect, soit les biblioth\u00E8ques de classe ne sont pas install\u00E9es
VRFY032=r\u00E9cepteur incorrect pour <init>
J9VM022=Echec de la mappe de pile, r\u00E9sultat \= %p - arr\u00EAt de la machine virtuelle en cours
VRFY031=tentative d'ex\u00E9cuter iinc sur une variable non enti\u00E8re
J9VM021=M\u00E9moire satur\u00E9e pour la mappe de pile de l'interpr\u00E9teur - arr\u00EAt de la machine virtuelle en cours
VRFY030=type incorrect sur la pile
J9VM020=Recherche effectu\u00E9e dans %.*s
SHRC279=Recr\u00E9er le cache partag\u00E9 au d\u00E9marrage
SHRC278=L'utilitaire "%s" ne peut pas fonctionner sur un cache de classes incompatible "%s". Utilisez une machine JVM de niveau correct.
SHRC277=Pour ex\u00E9cuter l'utilitaire "%s" sur un cache partag\u00E9 non permanent "%s", vous devez \u00E9galement utiliser la sous-option "nonpersistent"
SHRC276=Pour ex\u00E9cuter l'utilitaire "%s" sur le cache de classes permanent "%s", n'utilisez pas la sous-option "nonpersistent"
SHRC275=D\u00E9finir l'emplacement des fichiers de cache JVM
SHRC274=Protection de page de m\u00E9moire d\u00E9sactiv\u00E9e pour le cache
SHRC273=Protection de page de m\u00E9moire par d\u00E9faut activ\u00E9e pour le cache
VRFY029=returnAddress non valide pour l'instruction ret
SHRC272=Protection de page de m\u00E9moire compl\u00E8te activ\u00E9e pour le cache
J9VM019=Erreur irr\u00E9m\u00E9diable \: Impossible de trouver et d'initialiser la classe requise %.*s
VRFY028=dimension incorrecte
SHRC271=Sous-option non reconnue pour l'option mprotect\=
J9VM018=Allocation de m\u00E9moire impossible pour le pool de tables de chargement de biblioth\u00E8que partag\u00E9e
VRFY027=r\u00E9cepteur incompatible avec la classe d\u00E9clarante
SHRC270=Configurer la protection des pages de m\u00E9moire cache
J9VM017=Allocation de m\u00E9moire impossible pour le tableau d'options de ligne de commande
VRFY026=EOF inattendu
J9VM016=Erreur d'arr\u00EAt de la biblioth\u00E8que %1$s(%2$d) \: %3$s
VRFY025=acc\u00E8s incorrect \u00E0 des donn\u00E9es prot\u00E9g\u00E9es
J9VM015=Erreur d'initialisation de la biblioth\u00E8que %1$s(%2$d) \: %3$s
VRFY024=les arguments sont de type non compatible
J9VM014=Erreur d'arr\u00EAt dans la fonction %1$s(%2$d) \: %3$s
VRFY023=param\u00E8tre tableswitch non entier
J9VM013=Erreur d'initialisation dans la fonction %1$s(%2$d) \: %3$s
VRFY022=sous-routines doivent \u00EAtre r\u00E9analys\u00E9es pour chaque jsr
J9VM012=Impossible de d\u00E9charger %1$s \: %2$s
VRFY021=objet d\u00E9clench\u00E9 ne peut pas \u00EAtre d\u00E9clench\u00E9
J9VM011=Impossible de charger %1$s \: %2$s
VRFY020=arguments appel\u00E9s de type non compatible
J9VM010=Echec de l'initialisation de %s
SHRC269=Le syst\u00E8me ne prend pas en charge la protection des pages de m\u00E9moire
SHRC268=[-Xshareclasses mise en cache des entr\u00E9es retransform\u00E9es d\u00E9sactiv\u00E9e]
SHRC267=D\u00E9sactiver la mise en cache de classes figurant dans le chemin d'acc\u00E8s aux classes d'amor\u00E7age
SHRC266=[-Xshareclasses mise en cache des classes retransform\u00E9es activ\u00E9e]
SHRC265=Mettre en cache les classes retransform\u00E9es \u00E0 l'aide de JVMTI
SHRC264=Ne pas arrondir les zones de cache aux limites des pages
SHRC263=Activer les pages pour la sortie prolixe de CompositeCache
VRFY019=\u00E9chec chargement de classe
SHRC262=Octets de donn\u00E9es         \= %d
J9VM009=Echec de J9VMDllMain
VRFY018=nombre maximum de piles d\u00E9pass\u00E9
SHRC261=Activer la sortie prolixe pour les donn\u00E9es internes de type cha\u00EEne
J9VM008=J9VMDllMain introuvable
VRFY017=<init> n'appelle pas ce <init> ni super <init>
SHRC260=Echec de la cr\u00E9ation du pool dans ByteDataManager
J9VM007=Option de ligne de commande non identifi\u00E9e \: %s
VRFY016=param\u00E8tre de d\u00E9calage du bytecode non entier
J9VM006=Option de ligne de commande incorrecte \: %s
VRFY015=return multiples pour un m\u00EAme jsr
J9VM005=Valeur incorrecte pour la variable d'environnement \: %s
VRFY014=bytecode retourn\u00E9 incompatible avec le type retourn\u00E9
J9VM004=Impossible de charger la biblioth\u00E8que requise par \: %s
VRFY013=violation de contrainte de chargement de classe
J9VM003=Compilateur JIT "%s" introuvable. L'interpr\u00E9teur va \u00EAtre utilis\u00E9.
VRFY012=forme de la pile incoh\u00E9rente
J9VM002=Fichier des options introuvable
VRFY011=param\u00E8tre lookupswitch non entier
J9VM001=Valeur incorrectement form\u00E9e pour -Xservice
VRFY010=plusieurs jsr utilisant un seul return
J9VM000=Valeur incorrectement form\u00E9e pour IBM_JAVA_OPTIONS
SHRC259=Impossible d'entrer le mutex de table de hachage Manager
SHRC258=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans Manager
SHRC257=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e dans Manager
SHRC256=Le cache partag\u00E9 permanent "%1$s" a \u00E9t\u00E9 d\u00E9truit
SHRC255=Erreur de mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du fichier de cache de classes partag\u00E9es lors de l'arr\u00EAt de la JVM
SHRC254=Erreur lors de la d\u00E9finition de la longueur du fichier de cache de classes partag\u00E9es
SHRC253=Erreur lors de l'\u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
VRFY009=tableau de type non compatible
SHRC252=Erreur lors de la recherche dans le fichier de cache de classes partag\u00E9es
VRFY008=index de tableau non entier
SHRC251=N'effectuez pas l'auto-suppression des caches \u00E0 partir d'ID de g\u00E9n\u00E9ration diff\u00E9rents
VRFY007=m\u00E9thode de type final remplac\u00E9e
SHRC250=Le cache ne peut \u00EAtre ouvert en lecture seule, car il n'a pas encore \u00E9t\u00E9 initialis\u00E9
VRFY006=nouvelle taille de tableau non entier
VRFY005=variable locale de type non compatible
VRFY004=l'extension de jsr a rencontr\u00E9 un trop grand nombre de jsr
VRFY003=classe ne contient pas de donn\u00E9es de pr\u00E9-v\u00E9rification
VRFY002=s\u00E9quence bytecode non valide
VRFY001=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s
VRFY000=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC249=Erreur \: le niveau de modification de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es est incorrect
SHRC248=Erreur \: la version de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es est incorrecte
JNCK100=Conseil JNI dans %1$s \: cette fonction ne peut pas \u00EAtre utilis\u00E9e avec des objets condens\u00E9s. Utilisez %2$s \u00E0 la place
SHRC247=Erreur \: l'identificateur de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es est incorrect
SHRC246=Cache non volatile des classes partag\u00E9es %1$s attach\u00E9
SHRC245=Erreur lors du mappage du fichier de cache de classes partag\u00E9es
SHRC244=Erreur lors de l'obtention de la longueur du fichier de cache de classes partag\u00E9es
SHRC243=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au fichier de cache de classes partag\u00E9es
SHRC242=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du fichier de cache de classes partag\u00E9es
SHRC241=Erreur \: Impossible de supprimer le fichier de cache de classes partag\u00E9es
SHRC240=Erreur \: impossible d'acqu\u00E9rir le verrou en \u00E9criture de la connexion au fichier de cache de classes partag\u00E9es
EXEX026=\  -jxe <fichierjxe>   place fichierjxe dans classpath et ex\u00E9cute la classe\n                    de d\u00E9marrage du fichier JXE.
EXEX025=Syntaxe \: \t%s [-jxe] [options] <jxeFile> [arguments...]
EXEX024=%s JXE ne contient aucune classe de d\u00E9marrage.
EXEX023=Impossible d'initialiser les utilitaires JXE.
EXEX022=
EXEX021=
EXEX020=
SHRC239=Erreur \: impossible d'acqu\u00E9rir le verrou en \u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
SHRC238=Erreur \: le cache de classes partag\u00E9es n'est pas connect\u00E9
SHRC599=L'espace disponible de la zone de donn\u00E9es de classe brute est endommag\u00E9e ('d\u00E9but d'espace disponible'\=%p, 'fin d'espace disponible'\=%p, 'taille disponible'\=%lu octets)
SHRC237=Cache permanent des classes partag\u00E9es %1$s ouvert
SHRC598=La zone de donn\u00E9es de classe brute est endommag\u00E9e car la taille de %lu est sup\u00E9rieure \u00E0 la taille totale du cache de %lu.
SHRC236=Cache permanent des classes partag\u00E9es %1$s cr\u00E9\u00E9
SHRC597=La valeur -Xshareclasses\:rcdSize\=%u octets est sup\u00E9rieure \u00E0 %u octets de l'espace disponible ; la valeur -Xshareclasses\:rcdSize\=%u est utilis\u00E9e \u00E0 la place.
SHRC235=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au fichier de cache de classes partag\u00E9es
SHRC596=Effectuez des v\u00E9rifications suppl\u00E9mentaires lors du stockage et de l'allocation des donn\u00E9es de classe non concordantes
SHRC234=Erreur lors de l'acquisition du verrou en lecture de la connexion au fichier de cache de classes partag\u00E9es
SHRC595=Les options de lignes de commande "%s" et "%s" sont incompatibles
SHRC233=Erreur lors de la cr\u00E9ation de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
SHRC594=La sous-option -Xshareclasses\:cacheRetransformed est incompatible avec un cache partag\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de la sous-option enableBCI
SHRC232=Impossible de cr\u00E9er un cache en mode de lecture seule
SHRC593=BCI activ\u00E9         \= false
SHRC231=Erreur lors de la d\u00E9finition de la longueur du fichier de cache de classes partag\u00E9es
EXEX019=
SHRC592=BCI activ\u00E9        \= true
SHRC230=Erreur lors de l'initialisation de l'en-t\u00EAte des donn\u00E9es du cache partag\u00E9
EXEX018=
SHRC591=%1$d \: 0x%2$p JITHINT \: %4$.*3$s
EXEX017=Erreur de mappage de jxe dans flash
SHRC590=La sous-option "enableBCI" a \u00E9t\u00E9 sp\u00E9cifi\u00E9e, mais le cache existant n'a pas \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de la sous-option "enableBCI".
EXEX016=Param\u00E8tres jxespace non valides.
EXEX015=Erreur de d\u00E9marrage de la VM \: M\u00E9moire insuffisante
EXEX014=Pour conna\u00EEtre la syntaxe, ex\u00E9cutez %s -help
EXEX013=Erreur interne de la VM \: Echec de la cr\u00E9ation de la VM Java
EXEX012=Option -jar indisponible pour cette biblioth\u00E8que de classe
EXEX011=
EXEX010=%s requiert un param\u00E8tre
JDBG021=option de d\u00E9bogage non identifi\u00E9e
JDBG020=option de d\u00E9bogage non identifi\u00E9e \: '%s'
SHRC229=Erreur \: en-t\u00EAte non valide dans le fichier de cache de classes partag\u00E9es
SHRC228=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re connexion au cache de classes partag\u00E9es
SHRC589=Cr\u00E9ez le cache \u00E0 l'aide du support d'instrumentation de byte-code.
SHRC227=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte du fichier de cache de classes partag\u00E9es
SHRC588=Erreur lors de la lib\u00E9ration du verrou en lecture de l'en-t\u00EAte de cache de classes partag\u00E9es interinvit\u00E9
SHRC226=Erreur lors de l'ouverture du fichier de cache de classes partag\u00E9es
SHRC587=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re connexion du cache de classes partag\u00E9es interinvit\u00E9
SHRC225=Erreur d'obtention du chemin du fichier de cache
SHRC586=Erreur \: en-t\u00EAte non valide dans le cache de classes partag\u00E9es interinvit\u00E9
SHRC224=M\u00E9moire insuffisante pour la copie locale du nom du cache
SHRC585=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte de cache de classes partag\u00E9es interinvit\u00E9
SHRC223=Impossible de cr\u00E9er/utiliser des caches de classes partag\u00E9es permanents, car le verrouillage de fichiers n'est pas pris en charge
SHRC584=Erreur lors de l'acquisition du verrou en lecture de la connexion au cache de classes partag\u00E9es interinvit\u00E9
SHRC222=Les caches de classes partag\u00E9es permanents ne peuvent pas \u00EAtre cr\u00E9\u00E9s/utilis\u00E9s car le mappage de m\u00E9moire ne prend pas en charge les fonctions requises
SHRC583=Erreur de mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du cache de classe partag\u00E9e interinvit\u00E9
SHRC221=Message d'erreur de la plateforme \: %1$s
EXEX009=\  -verify          activer la v\u00E9rification des fichiers de classe.\n  -X               imprimer l'aide sur les options non standard.
SHRC582=Erreur \: Impossible de supprimer le cache de classes partag\u00E9es interinvit\u00E9
SHRC220=Code d'erreur au niveau du port \= %1$d
EXEX008=\  -verbose[\:class,gc,stack,sizes]\n                   activer la sortie prolixe (par d\u00E9faut\=class).\n
SHRC581=Erreur de mappage dans l'objet partag\u00E9 interinvit\u00E9
EXEX007=\  -jcl\:<config>[\:options]\n                   indiquer la biblioth\u00E8que partag\u00E9e JCL \u00E0 utiliser (par exemple, cdc, cldc, ...).\n
SHRC580=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au cache de classes partag\u00E9es interinvit\u00E9
EXEX006=\  -debug\:<options> activer le d\u00E9bogage, <options> JDWP standard.\n
JDBG019=Liste de translation %zx non tri\u00E9e
EXEX005=\  -D<prop>\=<val>   d\u00E9finir la valeur d'une propri\u00E9t\u00E9 syst\u00E8me.\n
JDBG018=ignorer l'option de d\u00E9bogage non identifi\u00E9e
EXEX004=\  -jxespace\:<adrPhysique>,<taille>,<adrLogique>\n                   mapper la r\u00E9gion de m\u00E9moire pour les jxe, (valeurs hexad\u00E9cimales).\n  -jxeaddr\:<adrLogique>\n                   ex\u00E9cuter un jxe directement \u00E0 partir de la m\u00E9moire, (adresse hexad\u00E9cimale).
JDBG017=
EXEX003=\  -jxe\:<fichier_jxe>   ex\u00E9cuter le fichier jxe nomm\u00E9.
JDBG016=Echec de la connexion JVM
EXEX002=\n[options]\n  -classpath <chemin>\n  -cp <chemin>       d\u00E9finir le chemin d'acc\u00E8s aux classes sur <chemin>.
JDBG015=D\u00E9bogage du serveur de r\u00E9ponse
EXEX001=Syntaxe \:\t%s [options] -jxe\:<fichier_jxe> [arguments...]
JDBG014=impossible d'allouer le pool vm->debuggerClassReferences
EXEX000=Syntaxe \:\t%s [options] classname [arguments...]
JDBG013=impossible d'allouer le pool vm->debuggerReferences
JDBG012=Echec de j9dbg_init_server
JDBG011=impossible d'allouer debugServer
JDBG010=Exemple \: java -Xrunjdwp\:transport\=dt_socket,address\=localhost\:8000\n
SHRC219=[Acc\u00E8s de groupe -Xshareclasses pour les nouveaux caches activ\u00E9]
SHRC218=[Cache non volatile -Xshareclasses d\u00E9sactiv\u00E9]
SHRC579=Erreur d'initialisation de l'en-t\u00EAte des donn\u00E9es du cache partag\u00E9 interinvit\u00E9
SHRC217=[Cache non volatile -Xshareclasses activ\u00E9]
SHRC578=Erreur lors de la cr\u00E9ation de l'en-t\u00EAte dans le cache de classe partag\u00E9e interinvit\u00E9
SHRC216=Cr\u00E9er un cache de classes partag\u00E9es non permanent
SHRC577=Impossible de cr\u00E9er un cache partag\u00E9 interinvit\u00E9 en mode lecture seule
SHRC215=Cr\u00E9er un cache de classes partag\u00E9es permanent
SHRC576=Le cache partag\u00E9 interinvit\u00E9 ne peut \u00EAtre ouvert en lecture seule, car il n'a pas encore \u00E9t\u00E9 initialis\u00E9
SHRC214=Impossible d'entrer le mutex de table de hachage ByteDataManager
SHRC575=Erreur lors de l'acquisition de l'en-t\u00EAte dans le cache de classe partag\u00E9e interinvit\u00E9
SHRC213=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de la table de hachage dans ByteDataManagerImpl
SHRC574=Le cache partag\u00E9 interinvit\u00E9 ne peut pas se trouver dans un syst\u00E8me de fichiers r\u00E9seau. S\u00E9lectionnez  "nonpersistent" ou un r\u00E9pertoire de caches diff\u00E9rent.
SHRC212=Enregistrement de donn\u00E9es de type octet pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC573=L'option de ligne de commande "-Xshareclasses\:%s" n\u00E9cessite "-Xvirt"
SHRC211=Recherche de donn\u00E9es de type octet pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC572=Sp\u00E9cification cible incorrecte trouv\u00E9e. La cible sp\u00E9cifi\u00E9e dans l'en-t\u00EAte de cache est %s, mais %s est attendu.
SHRC210=[Sortie d\u00E9taill\u00E9e des donn\u00E9es de type octet -Xshareclasses activ\u00E9e]
SHRC571=Cache interinvit\u00E9 des classes partag\u00E9es %1$s attach\u00E9
SHRC570=Le cache partag\u00E9 interinvit\u00E9 "%1$s" a \u00E9t\u00E9 d\u00E9truit
JDBG009=j9methodids\=y|n                utiliser id m\u00E9thode j9               n\n
JDBG008=onuncaught\=y|n                  d\u00E9bog. exceptions non intercept\u00E9es ?          n
JDBG007=onthrow\=<nom exception>         d\u00E9bogage en cas d'exception     n\u00E9ant
JDBG006=server\=y|n                      \u00E9coute du d\u00E9bogueur ?            n
JDBG005=address\=<adr \u00E9coute/connexion>  sp\u00E9cif. transport               "localhost\:8888"
JDBG004=transport\=<nom>                 sp\u00E9cif. transport               n\u00E9ant
JDBG003=suspend\=y|n                     attente au d\u00E9marrage ?                o
JDBG002=---------------------           -----------                     -------
JDBG001=Nom d'option et valeur          Description                     Valeur par d\u00E9faut
JDBG000=Syntaxe de -Xrunjdwp \: -Xrunjdwp\:[help]|[<option>\=<valeur>, ...]\n
SHRC209=Active la sortie d\u00E9taill\u00E9e des donn\u00E9es de type octet
SHRC208=Impossible d'allouer de la m\u00E9moire pour pool d'\u00E9l\u00E9ments de la table de hachage dans CompiledMethodManagerImpl
SHRC569=Cache interinvit\u00E9 des classes partag\u00E9es %1$s cr\u00E9\u00E9
SHRC207=Impossible d'entrer le mutex de table de hachage CompiledMethodManager
SHRC568=Cache interinvit\u00E9 des classes partag\u00E9es %1$s ouvert
SHRC206=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de la table de hachage dans CompiledMethodManagerImpl
SHRC567=Cache interinvit\u00E9 de classes partag\u00E9es %1$s ouvert en lecture seule
SHRC205=Echec de cr\u00E9ation d'\u00E9l\u00E9ment de table de hachage dans CompiledMethodManagerImpl
SHRC566=L'identificateur de l'en-t\u00EAte du cache de classes partag\u00E9es interinvit\u00E9 est incorrect
SHRC204=Impossible de cr\u00E9er le mutex de table de hachage dans le gestionnaire de classes partag\u00E9es
SHRC565=Cr\u00E9er un cache de classes partag\u00E9es interinvit\u00E9
SHRC203=Impossible de cr\u00E9er la table de hachage dans le gestionnaires de classes partag\u00E9es
SHRC564=[cache partag\u00E9 interinvit\u00E9 -Xshareclasses activ\u00E9]
SHRC202=Echec de l'initialisation des pools dans le gestionnaire de classes partag\u00E9es
SHRC563=Ouverture d'un cache Realtime qui n'est pas compatible avec cette machine virtuelle Java ; utilisez l'option -Xrealtime de la machine virtuelle Java pour acc\u00E9der \u00E0 ce cache
SHRC201=\ Succ\u00E8s du remplacement de %2$.*1$s.
SHRC562=Donn\u00E9es endommag\u00E9es lues pour l'en-t\u00EAte de l'entr\u00E9e du cache 0x%p (longueur d'\u00E9l\u00E9ment non valide de %u octets)
SHRC200=\ Succ\u00E8s de la recherche de %2$.*1$s.
SHRC561=Echec de l'initialisation du cache de classes partag\u00E9 ; l'espace disponible dans le syst\u00E8me de fichiers n'est pas suffisant. Espace disque libre disponible en octets \= %lld, octets demand\u00E9s \= %lld.
SHRC560=Le nom du cache interne n'est pas correct.
SHRC559=Echec de la cr\u00E9ation d'un r\u00E9pertoire "%s" pour le cache de classes partag\u00E9
SHRC558=Options disponibles pour -Xshareclasses\:printStats\=<options>. Utilisez '+' pour sp\u00E9cifier plusieurs options. Exemple \: printstats\=aot+url \n
SHRC557=Sous-option non reconnue pour l'option printstats\=. Utilisez printstats\=help pour afficher les options disponibles.
SHRC556=Affichez le r\u00E9capitulatif des statistiques de cache. Utilisez printstats\=help pour afficher les options disponibles.
SHRC555=Le cache contient des classes associ\u00E9es \u00E0 des num\u00E9ros de ligne et des classes sans num\u00E9ro de ligne
SHRC554=Le cache contient uniquement des classes sans num\u00E9ro de ligne
SHRC553=Le cache contient uniquement des classes associ\u00E9es \u00E0 des num\u00E9ros de ligne
SHRC552=Impossible d'allouer la taille de bloc demand\u00E9e pour le cache "%s". Octets disponibles \= %d, octets demand\u00E9s \= %d
SHRC551=Le cache "%s" est plein. Echec de l'allocation de la taille de bloc %d.
SHRC550=L'indicateur d'ex\u00E9cution ROUND_TO_PAGE_SIZE manque. -Xshareclasses\:checkStringTableReset requiert que la table de cha\u00EEnes soit arrondie en fonction de la taille de page.
SHRC549=-Xshareclasses\:checkStringTableReset peut \u00E9chouer. La table de cha\u00EEnes n'est pas assez grande. Sa taille doit \u00EAtre sup\u00E9rieure \u00E0 la taille de page du syst\u00E8me d'exploitation. Taille de la table \= %d, taille de page \= %d
SHRC548=Forcer la r\u00E9initialisation de la table de cha\u00EEnes lorsqu'elle est endommag\u00E9e.
SHRC547=Impossible d'allouer de la m\u00E9moire pour chaque matrice de caract\u00E8res dans shrinit
SHRC546=%1$d \: 0x%2$p INUTILISE1 \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC545=%1$d \: 0x%2$p CHAINE ROM \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC544=%1$d \: 0x%2$p MACHINE VIRTUELLE \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC543=%1$d \: 0x%2$p AOTDATA \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC542=%1$d \: 0x%2$p POOL \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC541=%1$d \: 0x%2$p AUXILIAIRE \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC540=%1$d \: 0x%2$p INCONNU \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC539=%1$d \: 0x%2$p AOTTHUNK \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC538=%1$d \: 0x%2$p AOTCH \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC537=%1$d \: 0x%2$p JCL \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC536=%1$d \: 0x%2$p JITHINT \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC535=\t bytedata     Affiche tous les autres types de donn\u00E9es d'octets dans le cache partag\u00E9.
SHRC534=\t jcl               Affiche uniquement les types jcl dans le cache partag\u00E9.
SHRC533=\t aotdata       Affiche uniquement les types aotdata dans le cache partag\u00E9.
SHRC532=\t aotthunk     Affiche uniquement les types aotthunk dans le cache partag\u00E9.
SHRC531=\t aotch           Affiche uniquement les type aotch dans le cache partag\u00E9.
SHRC530=\t jithint       Affche uniquement les types d'astuce jit dans le cache partag\u00E9.
DUMP042=Signal abandonn\u00E9 re\u00E7u pendant l'ex\u00E9cution sur la pile Java. Les agents de vidage de la machine virtuelle Java n'ont pas pu s'ex\u00E9cuter.
DUMP041=Utilisation incorrecte de -Xdump msg_filter
DUMP040=Vidage %1$s \u00E9crit dans les ensembles de donn\u00E9es \u00E0 l'aide du mod\u00E8le de nom %2$s
SHRC529=\t orphan         Affiche uniquement les types orphelins dans le cache partag\u00E9.
SHRC528=\t extra           Affiche tous les types priv\u00E9s suivants dans le cache partag\u00E9.
SHRC527=\t zipcache     Affiche uniquement les types de cache zip dans le cache partag\u00E9.\n
SHRC526=\t jitprofile Affiche uniquement les types de profil jit dans le cache partag\u00E9.
SHRC525=\t aot               Affiche uniquement les types aot dans le cache partag\u00E9.
SHRC524=\t rommethod   Affiche uniquement les types de m\u00E9thode rom dans le cache partag\u00E9.
SHRC523=\t romclass     Affiche uniquement les types de classe rom dans le cache partag\u00E9.
DUMP039=Traitement de l'\u00E9v\u00E9nement de vidage "%1$s", d\u00E9tails "%3$.*2$s" \u00E0 %4$s - Veuillez patienter.
SHRC522=\t token           Affiche uniquement les types de jeton dans le cache partag\u00E9.
DUMP038=Le vidage d'instantan\u00E9 n'est pas \u00E9crit, car le tra\u00E7age s'effectue dans un fichier \: %1$s
SHRC521=\t url               Affiche uniquement les types d'URL dans le cache partag\u00E9.
DUMP037=Erreur dans le vidage %1$s \: %2$s a \u00E9chou\u00E9, code d'erreur \: %3$d
SHRC520=\t classpath   Affiche uniquement les types de chemin d'acc\u00E8s aux classes dans le cache partag\u00E9.
DUMP036=Filtre -Xdump non valide ou manquant
DUMP035=L'utilisateur a demand\u00E9 un vidage %1$s via %2$s
DUMP034=L'utilisateur a demand\u00E9 un vidage %1$s en utilisant '%2$s' via %3$s
DUMP033=La machine virtuelle Java a demand\u00E9 un vidage %1$s \u00E0 la suite d'un \u00E9v\u00E9nement
DUMP032=La machine virtuelle Java a demand\u00E9 un vidage %1$s en utilisant '%2$s' en r\u00E9ponse \u00E0 un \u00E9v\u00E9nement
DUMP031=Le clich\u00E9 de tas demand\u00E9 n'a pas \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9, car le verrou exclusif VM n'a pas \u00E9t\u00E9 demand\u00E9. Ajoutez request\=exclusive+prepwalk+compact \u00E0 l'option de ligne de commande -Xdump\:heap\:.
DUMP030=Impossible d'\u00E9crire le vidage dans le fichier %s \: %s
SHRC519=\t all               Affiche tous les types suivants dans le cache partag\u00E9.
SHRC518=Options disponibles pour -Xshareclasses\:printAllStats\=<options>. Utilisez '+' pour sp\u00E9cifier plusieurs options. Exemple \: printallstats\=aot+url \n
SHRC517=Sous-option non reconnue pour l'option printallstats\=. Utilisez printallstats\=help pour afficher les options disponibles.
SHRC516=R\u00E9pertoriez tous les \u00E9l\u00E9ments du cache par d\u00E9faut. Utilisez printallstats\=help pour afficher les options disponibles.
SHRC515=Echec de l'obtention du r\u00E9pertoire cache par d\u00E9faut.
SHRC514=Valeur non valide pour l'option cacheDirPerm. Celle-ci doit correspondre \u00E0 une autorisation de type Unix sur la plage 0700 - 0777 ou 1700 - 1777 (en repr\u00E9sentation octale).
SHRC513=D\u00E9finir des autorisations de type Unix pour la cr\u00E9ation de r\u00E9pertoires cache
DUMP029=La demande pour prepwalk ou compact avant de cr\u00E9er un vidage syst\u00E8me sera ignor\u00E9e, car le verrou excessif VM n'a pas \u00E9t\u00E9 demand\u00E9.
SHRC512=aucune donn\u00E9e en cache
DUMP028=Le verrou exclusif VM n'a pas pu \u00EAtre obtenu avant de cr\u00E9er le vidage syst\u00E8me.
SHRC511=Valeur non conforme de l'indicateur d'initialisation du cache composite. La valeur de ccInitComplete est %lu
DUMP027=Le clich\u00E9 de tas demand\u00E9 n'a pas \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9, car un autre composant d\u00E9tient le verrou exclusif VM.
SHRC510=D\u00E9sactiver la cr\u00E9ation de vidages de caches endommag\u00E9s
DUMP026=IEATDUMP Le nom d\u00E9passe la longueur maximale. Le nom par d\u00E9faut est utilis\u00E9.
DUMP025=Echec IEATDUMP pour DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Plusieurs clich\u00E9s de tas ont \u00E9t\u00E9 demand\u00E9s, mais %%id est absent dans l'\u00E9tiquette du fichier \: les vidages vont \u00EAtre remplac\u00E9s
DUMP023=La pr\u00E9paration de segment de m\u00E9moire demand\u00E9 n'a pas \u00E9t\u00E9 ex\u00E9cut\u00E9e, car aucun acc\u00E8s exclusif n'a \u00E9t\u00E9 demand\u00E9 ou n'a pu \u00EAtre obtenu.
DUMP022=La compression de segment de m\u00E9moire demand\u00E9e n'a pas \u00E9t\u00E9 ex\u00E9cut\u00E9e, car un acc\u00E8s exclusif n'a pas \u00E9t\u00E9 demand\u00E9 ou n'a pas pu obtenu.
DUMP021=Le clich\u00E9 de tas demand\u00E9 n'a pas \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9, car aucun acc\u00E8s exclusif n'a \u00E9t\u00E9 demand\u00E9 ou n'a pu \u00EAtre obtenu.
DUMP020=Le vidage %s a \u00E9t\u00E9 \u00E9crit
SHRC509=Cr\u00E9er un cache d'une g\u00E9n\u00E9ration plus vieux que la g\u00E9n\u00E9ration actuelle.
SHRC508=S\u00E9maphore acquis diff\u00E9rent de celui utilis\u00E9 pr\u00E9c\u00E9demment avec ce cache. ancien semid\=%d, nouveau semid\=%d
SHRC507=Effectuer des v\u00E9rifications suppl\u00E9mentaires lors du stockage et de l'allocation des donn\u00E9es de d\u00E9bogage de classes
SHRC506=La zone de d\u00E9bogage est endommag\u00E9e vu que la taille de %lu est sup\u00E9rieure \u00E0 la taille totale du cache de %u stock\u00E9e dans l'en-t\u00EAte du cache
SHRC505=La zone de d\u00E9bogage est endommag\u00E9e vu que la diff\u00E9rence entre l'adresse plafond %p de l'espace libre moins l'adresse plancher %p d\u00E9passe la taille de la r\u00E9gion de d\u00E9bogage de %lu octets
SHRC504=Le d\u00E9but des donn\u00E9es de cache est Null. D\u00E9but des donn\u00E9es \: %p
SHRC503=La zone de d\u00E9bogage est endommag\u00E9e vu que le stockage des %d octets de 'table de num\u00E9ros de ligne' et des %d octets de 'table de variable locale' d\u00E9boucherait sur une adresse plafond de %p pour les 'donn\u00E9es de table de num\u00E9ros de ligne' sup\u00E9rieure \u00E0 la nouvelle adresse plancher de %p pour les 'donn\u00E9es de table de variable locale'
DUMP019=Machine virtuelle Java demandant un vidage %s
SHRC502=La zone de d\u00E9bogage est endommag\u00E9e vu que l'adresse plancher %p de 'donn\u00E9es de table de variable locale' est sup\u00E9rieure \u00E0 son adresse plafond %p
DUMP018=L'\u00E9v\u00E9nement demand\u00E9 n'est pas disponible \: ex\u00E9cutez la commande avec -Xdump\:indicateur dynamique
SHRC501=La zone de d\u00E9bogage est endommag\u00E9e vu que l'adresse plancher %p de 'donn\u00E9es de table de num\u00E9ros de ligne' est sup\u00E9rieure \u00E0 son adresse plafond %p
DUMP017=Abandon en cours \: Impossible de compresser le fichier (%s)
SHRC500=La zone de d\u00E9bogage est endommag\u00E9e vu que l'adresse plancher %p d'espace disponible est sup\u00E9rieure \u00E0 son adresse plafond %p
DUMP016=Abandon en cours \: Impossible de cr\u00E9er le fichier (%s)
DUMP015=Abandon en cours \: Impossible d'ouvrir ou de lire (%s)
DUMP014=Action de machine virtuelle non reconnue \: ...%s
DUMP013=Ev\u00E9nement de vidage trait\u00E9 "%1$s", d\u00E9tails "%3$.*2$s".
DUMP012=Erreur dans le vidage %1$s \: %2$s
DUMP011=Le vidage %1$s a cr\u00E9\u00E9 le processus %2$d
DUMP010=Vidage %1$s \u00E9crit dans %2$s
EXEL111=\  -XX\:+StoreIntermediateClassfile   stocker les donn\u00E9es de classe brutes \u00E0 utiliser pendant la re-transformation
EXEL110=\  -XX\:ShareClassesDisableBCI   cr\u00E9er le cache de classes partag\u00E9es sans le support d'instrumentation de bytecode
DUMP009=Le vidage %s est indisponible
DUMP008=utilisation de '%s'
DUMP007=JVM demandant un vidage %1$s en utilisant '%2$s'
DUMP006=Traitement de l'\u00E9v\u00E9nement de vidage "%1$s", d\u00E9tails "%3$.*2$s" - Veuillez patienter.
DUMP005=Outil externe manquant
DUMP004=Nom de fichier manquant
DUMP003=Agent de vidage non reconnu \: %s
DUMP002=Jeton non reconnu \: %%%1$c
DUMP001=Ev\u00E9nement de vidage non reconnu \: ...%s
DUMP000=Option de vidage non reconnue \: -Xdump\:%s
TNNT004=Fichier tenant.properties (%1$s) mal form\u00E9.  Impossible de d\u00E9coder la cl\u00E9 requise\='%2$s' valeur\='%3$s'
TNNT003=Fichier tenant.properties mal form\u00E9 (%1$s). Cl\u00E9 requise manquante (%2$s)
TNNT002=Impossible de lire le fichier de propri\u00E9t\u00E9s d'isolation requis (%1$s)
EXEL109=\  -XX\:ShareClassesEnableBCI   cr\u00E9er le cache de classes partag\u00E9es, \u00E0 l'aide du support d'instrumentation de bytecode
TNNT001=Allocation de m\u00E9moire impossible pour le lanceur de locataire
EXEL108=\  -Xzero\:nosharebootzip   ne pas partager les caches d'entr\u00E9e de fichier JAR d'amor\u00E7age dans le cache de classe partag\u00E9e
TNNT000=Gestion de locataire activ\u00E9e.
EXEL107=\  -Xscmaxjitdata<x>   d\u00E9finir l'espace maximal du cache de classes partag\u00E9es autoris\u00E9 pour les donn\u00E9es JIT sur <x>
EXEL106=\  -Xscminjitdata<x>   d\u00E9finir l'espace minimal du cache de classes partag\u00E9es r\u00E9serv\u00E9 aux donn\u00E9es JIT sur <x>
EXEL105=\  -Xscmaxjit<x>   d\u00E9finir l'espace maximal du cache de classes partag\u00E9es autoris\u00E9 pour les donn\u00E9es JIT sur <x>
EXEL104=\  -Xscminjit<x>  d\u00E9finir l'espace minimal du cache de classes partag\u00E9es r\u00E9serv\u00E9 aux donn\u00E9es JIT sur <x>
EXEL103=\  -Xscdmx<x>      d\u00E9finir la taille de la zone d'attribut de d\u00E9bogage du cache de classes partag\u00E9es sur <x>
EXEL102=\n  -Xdiagnosticscollector active le collecteur de diagnotic
EXEL101=\n  -Xhealthcenter  active l'agent Health Center
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj  activer le temps r\u00E9el souple
CFRE099=modificateurs de m\u00E9thode non autoris\u00E9s
CFRE098=signature de la variable locale doit \u00EAtre une cha\u00EEne
CFRE097=entr\u00E9e de classe interne en double dans l'attribut InnerClasses
CFRE096=cible n'est pas une instruction dans le bytecode de switch
CFRE095=annotations doivent \u00EAtre des interfaces
CFRE094=bytecode de instanceof doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE093=m\u00E9thode ne peut \u00EAtre que public, private ou protected
CFRE092=signature non valide
CFRE091=d\u00E9but de PC du gestionnaire d'exception n'est pas une instruction
CFRE090=bytecode de new ne peut pas cr\u00E9er des tableaux
CFRE089=nom et type attendus
CFRE088=nom de variable locale doit \u00EAtre une cha\u00EEne
CFRE087=le bytecode de m\u00E9thode d'interface doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment InterfaceMethodref
CFRE086=m\u00E9thode contient deux attributs Code
CFRE085=nom interne doit \u00EAtre une cha\u00EEne
CFRE084=aucune erreur
CFRE083=la classe est de type abstract et final
CFRE082=la m\u00E9thode <init> ne doit pas \u00EAtre de type static, final, synchronized, native ou abstract
CFRE081=fichier source doit \u00EAtre de type UTF8
CFRE080=signature de m\u00E9thode non valide
CFRE079=PC du gestionnaire d'exception non valide
CFRE078=index de la classe de la m\u00E9thode englobante doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE077=les interfaces doivent \u00EAtre de type abstract
CFRE076=magic number incorrect
CFRE075=signature de variable locale non valide
CFRE074=aucun attribut Code indiqu\u00E9
CFRE073=attribut StackMap/StackMapTable trouv\u00E9 hors de l'attribut Code
CFRE072=entr\u00E9es non tri\u00E9es dans le bytecode de lookupswitch
CFRE071=tableau de bytecode est vide
CFRE070=num\u00E9ro de ligne PC non valide
CFRE069=longueur d'attribut sup\u00E9rieure aux donn\u00E9es d'attribut
CFRE068=nom de classe non valide
CFRE067=balise d'entr\u00E9e de pool de constantes inconnue
CFRE066=plusieurs attributs InnerClasses
CFRE065=attributs de m\u00E9thode eglobante multiples
CFRE064=descripteur doit \u00EAtre une cha\u00EEne de type UTF8
CFRE063=le bytecode d'invoke appelle une m\u00E9thode non valide
CFRE062=nombre maximum de variables locales inf\u00E9rieur \u00E0 la taille des arguments
CFRE061=nom doit \u00EAtre une cha\u00EEne de type UTF8
CFRE060=fin de PC du gestionnaire d'exception n'est pas une instruction ni la fin d'un tableau de bytecodes
CFRE059=PC du gestionnaire d'exception n'est pas une instruction
CFRE058=variable locale en d\u00E9passement de capacit\u00E9 lors du retour de sous-routine
CFRE057=type du gestionnaire d'exception doit \u00EAtre une classe
CFRE056=nombre d'arguments de bytecode d'invokeinterface incorrect
CFRE055=fin de PC du gestionnaire d'exception non valide
CFRE054=le bytecode de zone doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment Fieldref
CFRE053=m\u00E9thode contient plus de 255 emplacements d'argument
CFRE052=classe externe doit \u00EAtre une classe
CFRE051=constante cha\u00EEne doit \u00EAtre une cha\u00EEne
CFRE050=m\u00E9thode de l'interface doit \u00EAtre d\u00E9clar\u00E9e public et abstract
J9TI067=Annule un abonnement aux points de trace de la VM
J9TI066=Cr\u00E9e un abonnement aux points de trace de la VM
J9TI065=Fonction d'initialisation d'agent %s introuvable dans la biblioth\u00E8que %s
J9TI064=La fonction d'initialisation d'agent %s a \u00E9chou\u00E9 pour la biblioth\u00E8que %s ; code retour \: %d
J9TI063=Extrait le pointeur J9Method \u00E0 partir d'un JMethodID
J9TI062=Extrait le pointeur J9VMThread \u00E0 partir d'un jthread
J9TI061=Annule un abonnement aux enregistrements GC prolixes
J9TI060=Cr\u00E9e un abonnement aux enregistrements GC prolixes
CFRE049=bytecode de checkcast doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE048=variable locale en d\u00E9passement de capacit\u00E9 lors de l'enregistrement
CFRE047=classe de l'interface doit uniquement \u00EAtre \: public, abstract ou annotation
CFRE046=remplissage de bytecode de switch incorrect
CFRE045=pool de constantes en d\u00E9passement de capacit\u00E9
CFRE044=l'emplacement r\u00E9serv\u00E9 du bytecode d'invokeinterface n'est pas \u00E9gal \u00E0 z\u00E9ro
CFRE043=bytecode ne peut pas \u00EAtre \u00E9largi
CFRE042=taille du tableau de bytecode > 65535
CFRE041=version mineure incorrecte
CFRE040=longueur d'attribut inf\u00E9rieure aux donn\u00E9es d'attribut
J9TI059=Obtenez le volume de m\u00E9moire native utilis\u00E9 par la machine virtuelle Java, divis\u00E9 en cat\u00E9gories de m\u00E9moire.
J9TI058=D\u00E9finition des options de journal de la machine virtuelle Java impossible.
J9TI057=Conversion de la cha\u00EEne native des options de journal de la machine virtuelle Java impossible.
J9TI056=Analyse des options de journal de la machine virtuelle Java impossible.
J9TI055=Allocation de m\u00E9moire tampon impossible pour les options de journal de la machine virtuelle Java.
J9TI054=Demande un vidage JLM (Java Lock Monitor) avec un sp\u00E9cificateur de format.
J9TI053=D\u00E9finit les options de journal VM.
J9TI052=Interroge les options de journal VM en cours.
J9TI051=Efface l'option per-method pour l'entr\u00E9e s\u00E9lective et quitte la notification.
J9TI050=Obtient un code de hachage du moniteur d'un objet.
RCMT000=La gestion des ressources est activ\u00E9e.
CFRE039=variable locale en d\u00E9passement de capacit\u00E9 lors du chargement
CFRE038=m\u00E9thode contient deux attributs Exceptions
CFRE037=temp contient un type incorrect
CFRE036=cible n'est pas une instruction dans le bytecode de jump
CFRE035=bytecode de new doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE034=bytecode incomplet
CFRE033=plage de gestionnaire d'exception est vide
CFRE032=superclass de l'interface doit \u00EAtre java.lang.Object
CFRE031=exception \u00E9mise doit \u00EAtre une classe
CFRE030=superclass null
J9TI049=Retourne les noms de classe, de m\u00E9thode et de package d'un groupe de pointeurs de m\u00E9thode RAM
J9TI048=Obtient les m\u00E9tadonn\u00E9es de trace qui peuvent \u00EAtre utilis\u00E9es avec le formateur pour traiter les m\u00E9moires tampon de trace de processus
J9TI047=Tous les enregistrements de trace en cours d'utilisation sont bascul\u00E9s et envoy\u00E9s aux abonn\u00E9s aux traces
J9TI046=Annule un abonnement aux enregistrements de trace externes
J9TI045=Cr\u00E9e un abonnement aux enregistrements de trace externes
J9TI044=Supprimer toutes les balises d'objet.
J9TI043=Signale uniquement le chargement de classe pour les classes array.
J9TI042=Signale les balises automatiques du nouvel objet allou\u00E9 et sa classe.
J9TI041=Signale l'\u00E9v\u00E9nement de changement de nom du ou des objets (d\u00E9placement ou suppression).
J9TI040=Ajouter la fonction \u00E9tendue can_autotag_objects.
CFRE029=bytecode de multianewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE028=ldc* bytecode doit faire r\u00E9f\u00E9rence \u00E0 une constante
CFRE027=bytecode de multianewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe array
CFRE026=type de bytecode de newarray non reconnu
CFRE025=champ contient deux attributs ConstantValue
CFRE024=nom de classe doit \u00EAtre une cha\u00EEne
CFRE023=pool de constantes vide
CFRE022=thisClass doit \u00EAtre une classe
CFRE021=champ en double
CFRE020=d\u00E9but de PC du gestionnaire d'exception non valide
J9TI039=D\u00E9truit un cache partag\u00E9 nomm\u00E9.
J9TI038=Ex\u00E9cute une it\u00E9ration sur les caches partag\u00E9s.
J9TI037=Obtient la m\u00E9moire totale utilis\u00E9e pour le tas.
J9TI036=Obtient la m\u00E9moire actuellement libre dans le tas.
J9TI035=Cycle de r\u00E9cup\u00E9ration de place termin\u00E9.
J9TI034=Cycle de r\u00E9cup\u00E9ration de place d\u00E9marr\u00E9.
J9TI033=R\u00E9initialise les options de vidage de la machine virtuelle.
J9TI032=Indique qu'un processus a trait\u00E9 l'\u00E9v\u00E9nement asynchrone
J9TI031=Annule l'\u00E9v\u00E9nement asynchrone sur un ou tous les processus
J9TI030=Signale l'\u00E9v\u00E9nement asynchrone sur un ou tous les processus
CFRE019=d\u00E9but de PC de variable locale non valide
CFRE018=classe interne doit \u00EAtre une classe
CFRE017=plusieurs attributs StackMap/StackMapTable
CFRE016=variable locale en d\u00E9passement de capacit\u00E9 lors de l'incr\u00E9ment
CFRE015=les interfaces doivent \u00EAtre des classes
CFRE014=attribut de code indiqu\u00E9 pour une m\u00E9thode abstraite ou native
CFRE013=longueur du PC de variable locale non valide
CFRE012=constante doit \u00EAtre une valeur
CFRE011=bytecode de anewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE010=nombre n\u00E9gatif de paires correspondance/d\u00E9calage dans le bytecode de lookupswitch
J9TI029=Interroge la configuration de l'agent de vidage RAS.
J9TI028=Rapporte la fin d'un dump RAS.
J9TI027=Rapporte le d\u00E9but d'un dump RAS.
J9TI026=D\u00E9clenche un dump en utilisant la configuration RAS donn\u00E9e.
J9TI025=Autoriser l'interface JNI directe pour les \u00E9v\u00E9nements d'entr\u00E9e et de sortie de m\u00E9thode (cela peut \u00EAtre \u00E0 l'origine de la g\u00E9n\u00E9ration non fiable de rapport d'entr\u00E9e/sortie)
J9TI024=Sortie de m\u00E9thode sans valeur retourn\u00E9e.
J9TI023=Obtient des informations \u00E9tendues du cadre pour une liste de processus.
J9TI022=Obtient des informations \u00E9tendues du cadre pour toutes les traces de la pile.
J9TI021=Obtient des informations \u00E9tendues du cadre.
J9TI020=Obtient l'ID processus du SE \u00E0 partir d'un jthread
CFRE009=champ de l'interface doit \u00EAtre d\u00E9clar\u00E9 comme \: public, static et final
CFRE008=haut < bas dans le bytecode de tableswitch
CFRE007=signature de zone incorrecte
CFRE006=attribut StackMap/StackMapTable non valide
CFRE005=interface en double
CFRE004=bytecode inconnu
CFRE003=version majeure incorrecte
JNCK099=Erreur JNI dans %1$s \: l'argument \#%2$d n\u00E9cessite un type non tableau
JVMP000=La tentative d'instrumentation de %.*s via JVMPI a \u00E9t\u00E9 refus\u00E9e
CFRE002=nom de m\u00E9thode non valide
JNCK098=Erreur JNI dans %1$s \: l'argument \#%2$d attend %3$s %4$s ; l'argument r\u00E9el est %5$s %6$s
CFRE001=%1$s; classe\=%3$.*2$s, d\u00E9calage\=%4$u
JNCK097=\tadvice         affiche un conseil
CFRE000=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u
JNCK096=\twarn           affiche des avertissements
JNCK095=Erreur JNI dans la valeur retourn\u00E9e \: le type de retour est une r\u00E9f\u00E9rence, mais la valeur (0x%1$p) n'est pas une r\u00E9f\u00E9rence d'objet valide. Son type est \: %2$s
JNCK094=Erreur JNI dans %1$s \: Les donn\u00E9es point\u00E9es par l'argument \#%2$d ont \u00E9t\u00E9 modifi\u00E9es pendant l'ex\u00E9cution de %3$s. Les donn\u00E9es ont probablement \u00E9t\u00E9 modifi\u00E9es par un autre processus ou par un appel imbriqu\u00E9. Le r\u00E9sultat de %4$s peut \u00EAtre incorrect et la VM peut devenir instable
JNCK093=Erreur JNI dans %s \: La m\u00E9thode n'est pas un constructeur
J9TI019=D\u00E9finit le mode de notification pour les \u00E9v\u00E9nements \u00E9tendus, autorisant la s\u00E9lectivit\u00E9 au niveau du processus
JNCK092=\tvalist         v\u00E9rifier la r\u00E9utilisation de va_list
J9TI018=D\u00E9finit une m\u00E9thode pour la notification s\u00E9lective d'entr\u00E9e et de sortie.
JNCK091=Information d\u00E9tect\u00E9e dans le cadre du gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
J9TI017=Contr\u00F4le diverses options de la VM et de la compilation.
JNCK090=Avertissement d\u00E9tect\u00E9 dans le cadre du gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
J9TI016=Autorisation de la mise en ligne en pr\u00E9sence d'\u00E9v\u00E9nements de m\u00E9thode d'entr\u00E9e/sortie (cela peut \u00EAtre \u00E0 l'origine de la g\u00E9n\u00E9ration non fiable de rapport d'entr\u00E9e/sortie)
J9TI015=Demande un dump de JLM (Java Lock Monitor).
J9TI014=Contr\u00F4le JLM (Java Lock Monitor) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI013=Autorise les rappels pour les allocations instrumentables (celles non report\u00E9es par VMObjectAlloc).
J9TI012=Ajouter une option -Xdump dynamique
J9TI011=Ajouter une option -Xtrace dynamique
J9TI010=Entr\u00E9e de m\u00E9thode comprenant des informations \u00E9tendues sur le type de m\u00E9thode.
JNCK089=Erreur d\u00E9tect\u00E9e dans le cadre du gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
JNCK088=Avertissement JNI dans %1$s \: Argument \#%2$d est une r\u00E9f\u00E9rence faible. Une r\u00E9f\u00E9rence faible peut \u00EAtre vide \u00E0 tout moment. La r\u00E9f\u00E9rence doit \u00EAtre promue en utilisant NewLocalRef ou NewGlobalRef et doit \u00EAtre compar\u00E9e \u00E0 NULL avant l'appel \u00E0 %3$s
JNCK087=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas une ressource java/lang/reflect/Method ou java/lang/reflect/Constructor
JNCK086=Avertissement JNI dans %1$s \: L'argument \#%2$d n'est pas une ressource java/nio/Buffer. %3$s renverra un code erreur
JNCK085=Conseil d\u00E9tect\u00E9 dans JNI_OnLoad, biblioth\u00E8que %.*s\n
JNCK084=Avertissement d\u00E9tect\u00E9 dans JNI_OnLoad, biblioth\u00E8que %.*s\n
JNCK083=Erreur d\u00E9tect\u00E9e dans JNI_OnLoad, biblioth\u00E8que %.*s\n
J9TI009=Indique la fin d'une phase de compilation JIT. (Non prot\u00E9g\u00E9 contre les rappels)
JNCK082=Conseil d\u00E9tect\u00E9 dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
J9TI008=Indique le d\u00E9but d'une phase de compilation JIT. (Non prot\u00E9g\u00E9 contre les rappels)
JNCK081=Avertissement d\u00E9tect\u00E9 dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
J9TI007=Obtenir toutes les fonctions \u00E9tendues disponibles via capabilities_ptr.
JNCK080=Erreur d\u00E9tect\u00E9e dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
J9TI006=Renoncer aux fonctions \u00E9tendues de capabilities_ptr.
J9TI005=Ajouter les nouvelles fonctions \u00E9tendues \u00E0 partir de capabilities_ptr.
J9TI004=Retourner via capabilities_ptr les fonctions \u00E9tendues disponibles actuellement.
J9TI003=Echec de Agent_OnLoad pour la biblioth\u00E8que %s
J9TI002=Agent_OnLoad introuvable dans la biblioth\u00E8que %s
J9TI001=La biblioth\u00E8que d'agents %1$s n'a pas pu \u00EAtre ouverte (%2$s)
J9TI000=M\u00E9moire insuffisante lors de la tentative de chargement de la biblioth\u00E8que d'agents %s
JNCK079=Conseil d\u00E9tect\u00E9 dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK078=Avertissement d\u00E9tect\u00E9 dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK077=Erreur d\u00E9tect\u00E9e dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK076=Erreur jnichk interne dans %s \: M\u00E9moire satur\u00E9e
JNCK075=Erreur jnichk interne dans %1$s \: Descripteur 0x%2$x non identifi\u00E9
JNCK074=Conseil JNI dans %s \: La m\u00E9moire tampon semble ne pas \u00EAtre modifi\u00E9e. Utilisez JNI_ABORT au lieu du mode 0.
JNCK073=Conseil JNI dans %1$s \: JNI_ABORT a \u00E9t\u00E9 indiqu\u00E9 mais n'a pas \u00E9t\u00E9 trait\u00E9 en raison de la modification des donn\u00E9es.\n(Donn\u00E9es d'origine \: CRC\=0x%2$x, nouvelles donn\u00E9es \: CRC\=0x%3$x).\nPuisque %4$s a renvoy\u00E9 le contenu r\u00E9el du tableau, les modifications ne seront pas annul\u00E9es. Il se peut que ce ne soit pas l'objectif vis\u00E9.
JNCK072=Conseil JNI dans %1$s \: JNI_COMMIT a \u00E9t\u00E9 indiqu\u00E9 mais ne sera pas pris en compte.\nPuisque %2$s a renvoy\u00E9 le contenu r\u00E9el du tableau, la m\u00E9moire tampon ne sera plus valide apr\u00E8s cet appel. Il se peut que ce ne soit pas l'objectif vis\u00E9.
JNCK071=Avertissement JNI \: La m\u00E9moire situ\u00E9e \u00E0 0x%1$p acquise par %2$s n'a pas \u00E9t\u00E9 lib\u00E9r\u00E9e avant le retour depuis le code natif. Il s'agit probablement d'une fuite de m\u00E9moire.
JNCK070=Avertissement JNI dans %1$s \: Donn\u00E9es de tableau originales modifi\u00E9es entre %2$s et %3$s.\n(Donn\u00E9es d'origine \: CRC\=0x%4$x, nouvelles donn\u00E9es \: CRC\=0x%5$x).\nDu fait que %6$s a renvoy\u00E9 une copie du contenu du tableau, le nouveau contenu sera perdu.
JNCK069=Avertissement JNI dans %1$s \: Fin hors intervalle (%2$d + %3$d > %4$d)
JNCK068=Avertissement JNI dans %1$s \: D\u00E9but ou index hors intervalle (%2$d >\= %3$d)
JNCK067=Avertissement JNI dans %1$s \: Longueur n\u00E9gative de r\u00E9gion (%2$d) indiqu\u00E9e
JNCK066=Avertissement JNI dans %1$s \: Index ou d\u00E9but n\u00E9gatif (%2$d) indiqu\u00E9
JNCK065=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 de cadre de r\u00E9f\u00E9rences locales de %2$d \u00E0 %3$d. Les r\u00E9f\u00E9rences %4$d sont utilis\u00E9es.\nUtilisez EnsureLocalCapacity ou PushLocalFrame pour augmenter de mani\u00E8re explicite le cadre.
JNCK064=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 du pool de r\u00E9f\u00E9rences faibles globales de %2$d en %3$d.\nCela peut indiquer une fuite de m\u00E9moire.
JNCK063=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 du pool de r\u00E9f\u00E9rences globales de %2$d \u00E0 %3$d.\nIl peut s'agit d'un indicateur de perte de m\u00E9moire.
JNCK062=Erreur JNI dans %s \: Cette fonction ne doit pas \u00EAtre appel\u00E9e \u00E0 l'int\u00E9rieur d'une section critique
JNCK061=Avertissement JNI dans %1$s \: L'argument \#%2$d est une signature de zone mal form\u00E9e ("%3$s")
JNCK060=Avertissement JNI dans %1$s \: L'argument \#%2$d est une signature de m\u00E9thode mal form\u00E9e ("%3$s")
JNCK059=Avertissement JNI dans %1$s \: L'argument \#%2$d est un identificateur mal form\u00E9 ("%3$s")
JNCK058=Avertissement JNI dans %1$s \: Apr\u00E8s avoir appel\u00E9 %2$s et avant d'appeler %3$s, recherchez les exceptions \u00E0 l'aide de ExceptionCheck, ExceptionClear ou ExceptionOccurred
JNCK057=Erreur JNI dans %1$s \: N'utilisez pas %2$s pour lib\u00E9rer la m\u00E9moire 0x%3$p acquise \u00E0 l'aide de %4$s
JNCK056=Erreur JNI dans %1$s \: 0x%2$p de m\u00E9moire re\u00E7u de l'objet 0x%3$p ; lib\u00E9ration de 0x%4$p
JNCK055=Erreur JNI dans %1$s \: Le pointeur 0x%2$p n'a \u00E9t\u00E9 renvoy\u00E9 par aucune fonction JNI ou a d\u00E9j\u00E0 \u00E9t\u00E9 lib\u00E9r\u00E9
JNCK054=Erreur JNI dans %1$s \: Option de mode %2$d non identifi\u00E9e
JNCK053=Erreur JNI \: La section critique doit \u00EAtre lib\u00E9r\u00E9e avant le retour de la fonction
JNCK052=Erreur JNI dans %1$s \: La classe %3$.*2$s est obsol\u00E8te
JNCK051=Erreur VM interne dans %1$s \: Les octets transmis %2$p sont de taille inf\u00E9rieure aux octets de r\u00E9f\u00E9rence JNI %3$p
SHRC199=\ Succ\u00E8s de l'enregistrement de %2$.*1$s.
JNCK050=Erreur JNI dans %s \: PopLocalFrame appel\u00E9 sans cadre local sur la pile
SHRC198=Enregistrement du code AOT pour ROMMethod 0x%1$p dans le cache partag\u00E9...
SHRC197=Recherche du code AOT pour ROMMethod 0x%1$p dans le cache partag\u00E9...
SHRC196=[Sortie d\u00E9taill\u00E9e AOT -Xshareclasses activ\u00E9e]
SHRC195=Activer la sortie d\u00E9taill\u00E9e pour AOT
SHRC194=\tpour ROMClass %2$.*1$s \u00E0 0x%3$p.
SHRC193=%1$d \: 0x%2$p AOT \: %4$.*3$s
SHRC192=La valeur de -Xscmaxaot est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC191=La valeur de -Xscminaot est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC190=La valeur de -Xscminaot ne doit pas \u00EAtre sup\u00E9rieure \u00E0 la valeur de -Xscmaxaot
