MWF.xApplication.appstore.LP = {
    "title": "appstore",

    "all": "ທັງໝົດ",
    "searchPlaceholder": "ກະລຸນາໃສ່ຄໍາຄົ້ນຫາ",
    "close": "ປິດ",

    "install": "ຕິດຕັ້ງ",
    "installed": "ຕິດຕັ້ງແລ້ວ",
    "update": "ອັບເດດ",
    "installVip": "ຕິດຕໍ່ພວກເຮົາ",
    "installing": "ກຳລັງຕິດຕັ້ງ...",

    "updateInfoTitle": "ອັບເດດການຢືນຢັນແອັບ",
    "installInfoTitle": "ຕິດຕັ້ງການຢືນຢັນຄໍາຮ້ອງສະຫມັກ",
    "updateInfo": "ທ່ານແນ່ໃຈບໍ່ທີ່ຈະອັບເດດແອັບນີ້? ຖ້າແອັບໆຂອງທ່ານຖືກແກ້ໄຂ, ການປັບປຸງນີ້ຈະປ່ຽນແທນການອອກແບບທີ່ດັດແປງຂອງທ່ານ.",
    "installInfo": "ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການຕິດຕັ້ງແອັບນີ້?",

    "installSuccess": "ຕິດຕັ້ງແອັບສຳເລັດແລ້ວ!",
    "contactUs": "ສະແກນລະຫັດ QR ໃນ WeChat ເພື່ອຕິດຕໍ່ກັບທີ່ປຶກສາການຂາຍສໍາລັບຂໍ້ມູນເພີ່ມເຕີມ!",
    "phoneNumber": "400-888-0545",

    "clickToConfig": "ຄລິກທີ່ນີ້ເພື່ອຕັ້ງຄ່າລະບົບ",
    "clickToDoc":"ຄລິກທີ່ນີ້ສໍາລັບຄໍາແນະນໍາການຕັ້ງຄ່າ",

    "notAdmin": "ຂໍອະໄພ, ມີພຽງແຕ່ຜູ້ບໍລິຫານເທົ່ານັ້ນທີ່ສາມາດເຂົ້າເຖິງຕະຫຼາດແອັບຯໄດ້, ທ່ານມີສິດອະນຸຍາດບໍ່ພຽງພໍ!",

    "offlineInstall": "ຕິດຕັ້ງອອບໄລນ໌",
    "offlineInstallInfo":"ທ່ານສາມາດຄລິກທີ່ນີ້ເພື່ອຕິດຕັ້ງຊຸດແອັບພລິເຄຊັນອອຟໄລ",

    "configDocUrl": "https://www.o2oa.net/cms/serverdeployment/112.html"
}
