MWF.xApplication.portal.ScriptDesigner.LP = {
    "title": "ໂປຣແກມແກ້ໄຂເນື້ອໃນ",
    "newScript": "ສ້າງ Script",
    "scriptLibrary":"ຫໍສະໝຸດເນື້ອໃນ",
    "property": "ຄຸນສົມບັດ",
    "include":"ລວມ",

    "id": "ລະຫັດ",
    "name": "ຊື່",
    "alias": "ນາມແຝງ",
    "description": "ຄໍາອະທິບາຍ",

    "notice": {
        "save_success":"ສະຄຣິບຖືກບັນທຶກສຳເລັດແລ້ວ!",
        "deleteDataTitle":"ລຶບການຢືນຢັນຂໍ້ມູນ",
        "deleteData":"ທ່ານແນ່ໃຈບໍ່ທີ່ຈະລຶບຂໍ້ມູນປັດຈຸບັນ ແລະຂໍ້ມູນຍ່ອຍຂອງມັນອອກ?",

        "changeTypeTitle":"ປ່ຽນການຢືນຢັນປະເພດຂໍ້ມູນ",
        "changeTypeDeleteChildren": "ການປ່ຽນປະເພດຂໍ້ມູນຈະລຶບຂໍ້ມູນເດັກນ້ອຍທັງໝົດ. ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການປະຕິບັດມັນ?",
        "changeType": "ການປ່ຽນປະເພດຂໍ້ມູນຈະປ່ຽນຄ່າຂອງຂໍ້ມູນ. ທ່ານແນ່ໃຈບໍວ່າທ່ານຕ້ອງການທີ່ຈະປະຕິບັດມັນ?",

        "inputTypeError":"ປະເພດຂໍ້ມູນທີ່ທ່ານໃສ່ຜິດ, ກະລຸນາໃສ່ໃໝ່",
        "sameKey": "ຊື່ລາຍການທີ່ເຈົ້າໃສ່ນັ້ນມີຢູ່ໃນວັດຖຸແລ້ວ, ກະລຸນາໃສ່ໃໝ່",
        "emptyKey": "ຊື່ໂຄງການບໍ່ສາມາດຫວ່າງເປົ່າໄດ້, ກະລຸນາໃສ່ໃໝ່",
        "numberKey": "ຊື່ລາຍການບໍ່ສາມາດເປັນຕົວເລກໄດ້, ກະລຸນາໃສ່ໃໝ່",

        "inputName":"ກະລຸນາໃສ່ຊື່ສະຄຣິບ"
		},
        "version" : {
            "title" : "ເບິ່ງປະຫວັດສະບັບແບບຟອມ",
            "close" : "ປິດ",
            "no":"ເລກລໍາດັບ",
            "updateTime":"ເວລາອັບເດດ",
            "op":"ການກະທຳ",
            "resume" : "ຊີວະປະຫວັດ",
            "resumeConfirm" :"ສືບຕໍ່ການຢືນຢັນ",
            "resumeInfo" :"ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງດໍາເນີນການຟື້ນຟູແບບຟອມ? ຫຼັງຈາກຢືນຢັນການຟື້ນຟູແລ້ວ, ແບບຟອມປະຈຸບັນຈະຖືກປັບປຸງ ແລະແບບຟອມປະຈຸບັນຈະຕ້ອງຖືກບັນທຶກດ້ວຍຕົນເອງເພື່ອໃຫ້ມີຜົນ",
            "resumeSuccess" :"ສືບຕໍ່ສຳເລັດ"
        },
        "formToolbar":{
            "save": "ບັນທຶກເນື້ອໃນ",
            "autoSave": "ບັນທຶກອັດຕະໂນມັດ",
            "fontSize": "ຂະຫນາດຕົວອັກສອນ",
            "style": "ແບບ",
            "scriptEditor": "ຕົວແກ້ໄຂສະຄຣິບ",
            "viewAllVersions": "ເບິ່ງສະບັບສະຄຣິບທັງໝົດ"
        }
};
