MWF.xApplication.FaceSet.LP = {
	"title": "FaceTest",
  "noMedia": "お使いのブラウザはビデオ撮影をサポートしていません。Edge、Chrome、またはFirefoxブラウザを使用してください。",
  "button_takePic": "撮影",
  "button_completed": "完了",
  "pic1": "1枚目の写真を撮影するには「撮影」ボタンをクリックしてください。",
  "pic2": "笑顔を保ちながら2枚目の写真を撮影してください。",
  "pic3": "異なる角度で移動したり表情を変えたりして3枚目の写真を撮影してください。",
  "completed": "おめでとうございます！設定が完了しました。 「完了」ボタンをクリックすると、カメラを使用してシステムにログインできます。",
  "description": "顔認識特徴トークンを使用した顔認証に関する説明",
  "saveAttrError": "顔認識特徴を保存できませんでした。後で「完了」ボタンを再度クリックして再試行してください。",
  "getFaceToken": "顔認識特徴を取得中..."
};