MWF.xApplication.FaceSet.LP = {
	"title": "FaceTest",
	"noMedia": "Browser ຂອງເຈົ້າບໍ່ສາມາດ ສະໜັບສະໜູນຖ່າຍຮູບວີດີໂອໄດ້，ກະລຸນານຳໃຊ້  Edge、Chrome ຫຼື Firefox Browser",
	"button_takePic": "ຖ່າຍ  ຮູບ",
	"button_completed": "ສຳ  ເລັດ",
	"pic1": "ກະລຸນາກົດປຸ່ມ“ຖ່າຍຮູບ”，ຖ່າຍຮູບ 1 ຮູບ",
	"pic2": "ກະລຸນາຍິ້ມ,ຖ່າຍຮູບໃບທີ່ສອງ",
	"pic3": "ກະລຸາຍ້ຍໄປມຸມອື່ນ, ຫຼື ປ່ຽນການສະແດງອອກ, ຖ່າຍຮູບໃບທີ່ 3 ",
	"completed": "ຂໍສະແດງຄວາມຍິນດີ! ກນຕັ້ງລະບົບສຳເລັດແລ້ວ, ກົດປຸ່ມ“ສຳເລັດ”，ເຈົ້າສາມາດເຂົ້າລະບົບກ້ອງໄດ້ແລ້ວ。",
	"description": "Token",
	"saveAttrError": "ການບັນທຶກລັກສະນະໃບໜ້າລົ້ມເລວ，ກະລຸນາກົດປຸ່ມ“ສຳເລັດ”ອີກຄັ້ງ",

	"getFaceToken": "ກຳລັງຮັບລັກສະນະຂອງໃບໜ້າ......"
};